
	/*******************************************************************************
	*  Файл генерирован автоматически с помощью либпроцессора Динрус               *
	*  Дата:6.12.2013                                           Время: 17 ч. 22 мин.

	*******************************************************************************/


	module lib.7z;

	import stdrus;

	проц грузи(Биб биб)
	{

	
		//вяжи(функция_1)("_CreateObject", биб);

		//вяжи(функция_2)("_GetHandlerProperty", биб);

		//вяжи(функция_3)("_GetHandlerProperty2", биб);

		//вяжи(функция_4)("_GetMethodProperty", биб);

		//вяжи(функция_5)("_GetNumberOfFormats", биб);

		//вяжи(функция_6)("_GetNumberOfMethods", биб);

		//вяжи(функция_7)("_SetLargePageMode", биб);

	}

ЖанБибгр 7Z;

		static this()
		{
			7Z.заряжай("7z.dll", &грузи );
		}

	extern(C)
	{


		//проц function(   ) функция_1; 

		//проц function(   ) функция_2; 

		//проц function(   ) функция_3; 

		//проц function(   ) функция_4; 

		//проц function(   ) функция_5; 

		//проц function(   ) функция_6; 

		//проц function(   ) функция_7; 

	}

