
	/*******************************************************************************
	*  Файл генерирован автоматически с помощью либпроцессора Динрус               *
	*  Дата:28.1.2015                                           Время: 19 ч. 23 мин.

	*******************************************************************************/


	module lib.bzip2;

	import stdrus;

	проц грузи(Биб биб)
	{

	
		//вяжи(функция_1)("_BZ2_blockSort", биб);

		//вяжи(функция_2)("_BZ2_bsInitWrite", биб);

		//вяжи(функция_3)("_BZ2_bz__AssertH__fail", биб);

		//вяжи(функция_4)("_BZ2_bzBuffToBuffCompress", биб);

		//вяжи(функция_5)("_BZ2_bzBuffToBuffDecompress", биб);

		//вяжи(функция_6)("_BZ2_bzclose", биб);

		//вяжи(функция_7)("_BZ2_bzCompress", биб);

		//вяжи(функция_8)("_BZ2_bzCompressEnd", биб);

		//вяжи(функция_9)("_BZ2_bzCompressInit", биб);

		//вяжи(функция_10)("_BZ2_bzDecompress", биб);

		//вяжи(функция_11)("_BZ2_bzDecompressEnd", биб);

		//вяжи(функция_12)("_BZ2_bzDecompressInit", биб);

		//вяжи(функция_13)("_BZ2_bzdopen", биб);

		//вяжи(функция_14)("_BZ2_bzerror", биб);

		//вяжи(функция_15)("_BZ2_bzflush", биб);

		//вяжи(функция_16)("_BZ2_bzlibVersion", биб);

		//вяжи(функция_17)("_BZ2_bzopen", биб);

		//вяжи(функция_18)("_BZ2_bzread", биб);

		//вяжи(функция_19)("_BZ2_bzRead", биб);

		//вяжи(функция_20)("_BZ2_bzReadClose", биб);

		//вяжи(функция_21)("_BZ2_bzReadGetUnused", биб);

		//вяжи(функция_22)("_BZ2_bzReadOpen", биб);

		//вяжи(функция_23)("_BZ2_bzwrite", биб);

		//вяжи(функция_24)("_BZ2_bzWrite", биб);

		//вяжи(функция_25)("_BZ2_bzWriteClose", биб);

		//вяжи(функция_26)("_BZ2_bzWriteClose64", биб);

		//вяжи(функция_27)("_BZ2_bzWriteOpen", биб);

		//вяжи(функция_28)("_BZ2_compressBlock", биб);

		//вяжи(функция_29)("_BZ2_crc32Table", биб);

		//вяжи(функция_30)("_BZ2_decompress", биб);

		//вяжи(функция_31)("_BZ2_hbAssignCodes", биб);

		//вяжи(функция_32)("_BZ2_hbCreateDecodeTables", биб);

		//вяжи(функция_33)("_BZ2_hbMakeCodeLengths", биб);

		//вяжи(функция_34)("_BZ2_indexIntoF", биб);

		//вяжи(функция_35)("_BZ2_rNums", биб);

		//вяжи(функция_36)("_DllGetVersion", биб);

	}

ЖанБибгр BZIP2;

		static this()
		{
			BZIP2.заряжай("bzip2.dll", &грузи );
		}

	extern(C)
	{


		//проц function(   ) функция_1; 

		//проц function(   ) функция_2; 

		//проц function(   ) функция_3; 

		//проц function(   ) функция_4; 

		//проц function(   ) функция_5; 

		//проц function(   ) функция_6; 

		//проц function(   ) функция_7; 

		//проц function(   ) функция_8; 

		//проц function(   ) функция_9; 

		//проц function(   ) функция_10; 

		//проц function(   ) функция_11; 

		//проц function(   ) функция_12; 

		//проц function(   ) функция_13; 

		//проц function(   ) функция_14; 

		//проц function(   ) функция_15; 

		//проц function(   ) функция_16; 

		//проц function(   ) функция_17; 

		//проц function(   ) функция_18; 

		//проц function(   ) функция_19; 

		//проц function(   ) функция_20; 

		//проц function(   ) функция_21; 

		//проц function(   ) функция_22; 

		//проц function(   ) функция_23; 

		//проц function(   ) функция_24; 

		//проц function(   ) функция_25; 

		//проц function(   ) функция_26; 

		//проц function(   ) функция_27; 

		//проц function(   ) функция_28; 

		//проц function(   ) функция_29; 

		//проц function(   ) функция_30; 

		//проц function(   ) функция_31; 

		//проц function(   ) функция_32; 

		//проц function(   ) функция_33; 

		//проц function(   ) функция_34; 

		//проц function(   ) функция_35; 

		//проц function(   ) функция_36; 

	}

