/*******************************************************************************

        copyright:      Copyright (c) 2004 Kris Bell. все rights reserved

        license:        BSD стиль: $(LICENSE)
        
        version:        Initial release: December 2005      
        
        author:         Kris

*******************************************************************************/

module net.http.HttpTriplet;

/******************************************************************************

        Class в_ represent an HTTP ответ- or request-строка 

******************************************************************************/

class ТриплетППГТ 
{
        protected ткст        строка;
        protected ткст        неудачно;
        protected ткст[3]     семы;

        /**********************************************************************

                тест the validity of these семы

        **********************************************************************/

        abstract бул тест ();

        /**********************************************************************

                Parse the the given строка преобр_в its constituent components.

        **********************************************************************/

        бул разбор (ткст строка)
        {
                цел i;
                цел mark;

                this.строка = строка;
                foreach (цел индекс, сим c; строка)
                         if (c is ' ')
                             if (i < 2)
                                {
                                семы[i] = строка[mark .. индекс];
                                mark = индекс+1;
                                ++i;
                                }
                             else
                                break;

                семы[2] = строка [mark .. строка.length];
                return тест;
        }

        /**********************************************************************

                return a reference в_ the original ткст

        **********************************************************************/

        override ткст вТкст ()
        {
                return строка;
        }

        /**********************************************************************

                return ошибка ткст after a неудачно разбор()

        **********************************************************************/

        final ткст ошибка ()
        {
                return неудачно;
        }
}


