/*******************************************************************************

        copyright:      Copyright (c) 2004 Kris Bell. Все права защищены

        license:        BSD стиль: $(LICENSE)

        version:        Initial release: April 2004

        author:         Kris

*******************************************************************************/

module net.model.UriView;

/*******************************************************************************

       Реализует совместимую с RFC 2396 спецификацию URI. Смотрите
        <A HREF="http://ftp.ics.uci.edu/pub/ietf/уир/rfc2396.txt">эту страницу</A>
        для дополнительной информации.

        The implementation fails the spec on two counts: it doesn't insist
        on a схема being present in the ОбзорУИР, и it doesn't implement the
        "Relative References" support noted in section 5.2.

        Note that IRI support can be implied by assuming each of инфОПользователе, путь,
        запрос, и фрагмент are UTF-8 кодирован
        (see <A HREF="http://www.w3.org/2001/Talks/0912-IUC-IRI/paper.html">
        this страница</A> for further details).

        Use a Уир instead where you need в_ alter specific уир атрибуты.

*******************************************************************************/

abstract class ОбзорУИР
{
    public alias порт        дайПорт;
    public alias дефолтнПорт дайДефолтнПорт;
    public alias схема      дайСхему;
    public alias хост        дайХост;
    public alias valКСЕРort   дайВалидныйПорт;
    public alias инфОПользователе    дайИнфОПользователе;
    public alias путь        дайПуть;
    public alias запрос       дайЗапрос;
    public alias фрагмент    дайФрагмент;
    public alias порт        устПорт;
    public alias схема      устСхему;
    public alias хост        устХост;
    public alias инфОПользователе    устИнфОПользователе;
    public alias запрос       устЗапрос;
    public alias путь        установиПуть;
    public alias фрагмент    устФрагмент;

    public enum {InvalКСЕРort = -1}

    /***********************************************************************

            Return the default порт for the given схема. InvalКСЕРort
            is returned if the схема is неизвестное, or does not прими
            a порт.

    ***********************************************************************/

    abstract цел дефолтнПорт (ткст схема);

    /***********************************************************************

            Return the разобрано схема, or пусто if the схема was not
            specified

    ***********************************************************************/

    abstract ткст схема();

    /***********************************************************************

            Return the разобрано хост, or пусто if the хост was not
            specified

    ***********************************************************************/

    abstract ткст хост();

    /***********************************************************************

            Return the разобрано порт число, or InvalКСЕРort if the порт
            was not предоставленный.

    ***********************************************************************/

    abstract цел порт();

    /***********************************************************************

            Return a действителен порт число by performing a отыщи on the
            known schemes if the порт was not explicitly specified.

    ***********************************************************************/

    abstract цел valКСЕРort();

    /***********************************************************************

            Return the разобрано инфОПользователе, or пусто if инфОПользователе was not
            предоставленный.

    ***********************************************************************/

    abstract ткст инфОПользователе();

    /***********************************************************************

            Return the разобрано путь, or пусто if the путь was not
            предоставленный.

    ***********************************************************************/

    abstract ткст путь();

    /***********************************************************************

            Return the разобрано запрос, or пусто if a запрос was not
            предоставленный.

    ***********************************************************************/

    abstract ткст запрос();

    /***********************************************************************

            Return the разобрано фрагмент, or пусто if a фрагмент was not
            предоставленный.

    ***********************************************************************/

    abstract ткст фрагмент();

    /***********************************************************************

            Return whether or not the ОбзорУИР схема is consопрered генерный.

    ***********************************************************************/

    abstract бул isGeneric ();

    /***********************************************************************

            Emit the контент of this ОбзорУИР. Вывод is constructed per
            RFC 2396.

    ***********************************************************************/

    abstract ткст вТкст ();
}

