/*******************************************************************************

        copyright:      Copyright (c) 2004 Kris Bell. все rights reserved

        license:        BSD стиль: $(LICENSE)

        version:        Oct 2004: Initial release      
                        Dec 2006: Outback release
        
        author:         Kris 

*******************************************************************************/

module io.protocol.Writer;

private import  io.Buffer;

public  import  io.model.IFile,
                io.model.ИБуфер,
                io.model;

public  import  io.protocol.model;

private import  io.protocol.model;

/*******************************************************************************

        Писатель основа-class. Писательs provопрe the means в_ добавь formatted 
        данные в_ an ИБуфер, and expose a convenient метод of handling a
        variety of данные типы. In добавьition в_ writing исконный типы such
        as целое and ткст, writers also process any class which есть
        implemented the ИЗаписываемое interface (one метод).

        все writers support the full установи of исконный данные типы, plus their
        fundamental Массив variants. Operations may be chained back-в_-back.

        Писательs support a Java-esque помести() notation. However, the Dinrus стиль
        is в_ place IO elements within their own parenthesis, like so:

        ---
        пиши (счёт) (" green bottles");
        ---

        Note that each записано element is distict; this стиль is affectionately
        known as "whisper". The код below illustrates basic operation upon a
        память буфер:
        
        ---
        auto буф = new Буфер (256);

        // карта same буфер преобр_в Всё читатель and писатель
        auto читай = new Читатель (буф);
        auto пиши = new Писатель (буф);

        цел i = 10;
        дол j = 20;
        дво d = 3.14159;
        ткст c = "fred";

        // пиши данные типы out
        пиши (c) (i) (j) (d);

        // читай them back again
        читай (c) (i) (j) (d);


        // same thing again, but using помести() syntax instead
        пиши.помести(c).помести(i).помести(j).помести(d);
        читай.получи(c).получи(i).получи(j).получи(d);
        ---

        Писательs may also be used with any class implementing the ИЗаписываемое
        interface, along with any struct implementing an equivalent function.

*******************************************************************************/

class Писатель : ИПисатель
{     
        // the буфер associated with this писатель. Note that this
        // should not change over the lifetime of the читатель, since
        // it is assumed в_ be immutable elsewhere 
        package ИБуфер                 buffer_;
        
        package ИПротокол.ПисательМассива   массивы;
        package ИПротокол.Писатель        elements;

        // конец of строка sequence
        package ткст                  кс = ФайлКонст.НовСтрЗнак;

        /***********************************************************************
        
                Construct a Писатель on the provопрed Protocol

        ***********************************************************************/

        this (ИПротокол протокол)
        {
                buffer_ = протокол.буфер;
                elements = &протокол.пиши;
                массивы = &протокол.пишиМассив;
        }

        /***********************************************************************
        
                Construct a Писатель on the given ИПотокВывода. We do our own
                протокол handling, equivalent в_ the ПротоколНатив.

        ***********************************************************************/

        this (ИПотокВывода поток)
        {
                auto b = cast(ИБуферированный) поток;
                buffer_ = (b ? b.буфер : new Буфер (поток.провод));

                массивы = &пишиМассив;
                elements = &пишиЭлемент;
        }

        /***********************************************************************
        
                Return the associated буфер

        ***********************************************************************/

        final ИБуфер буфер ()
        {     
                return buffer_;
        }

        /***********************************************************************
        
                Emit a нс
                
        ***********************************************************************/

        ИПисатель нс ()
        {  
                return помести (кс);
        }

        /***********************************************************************
        
                установи the нс sequence
                
        ***********************************************************************/

        ИПисатель нс (ткст кс)
        {  
                this.кс = кс;
                return this;
        }

        /***********************************************************************
        
                Flush the вывод of this писатель and return a chaining ref

        ***********************************************************************/

        final ИПисатель слей ()
        {  
                buffer_.слей;
                return this;
        }

        /***********************************************************************
        
                Flush this писатель. This is a convenience метод used by
                the "whisper" syntax.
                
        ***********************************************************************/

        final ИПисатель помести () 
        {
                return слей;
        }

        /***********************************************************************
        
                Write via a delegate в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (ИПисатель.Клозура дг) 
        {
                дг (this);
                return this;
        }

        /***********************************************************************
        
                Write a class в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (ИЗаписываемое x) 
        {
                if (x is пусто)
                    buffer_.ошибка ("Писатель.помести :: attempt в_ пиши a пусто ИЗаписываемое объект");

                return помести (&x.пиши);
        }

        /***********************************************************************
        
                Write a булево значение в_ the current буфер-позиция    
                
        ***********************************************************************/

        final ИПисатель помести (бул x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.Bool);
                return this;
        }

        /***********************************************************************
        
                Write an unsigned байт значение в_ the current буфер-позиция     
                                
        ***********************************************************************/

        final ИПисатель помести (ббайт x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.UByte);
                return this;
        }

        /***********************************************************************
        
                Write a байт значение в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (байт x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.Byte);
                return this;
        }

        /***********************************************************************
        
                Write an unsigned крат значение в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (бкрат x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.UShort);
                return this;
        }

        /***********************************************************************
        
                Write a крат значение в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (крат x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.Short);
                return this;
        }

        /***********************************************************************
        
                Write a unsigned цел значение в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (бцел x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.UInt);
                return this;
        }

        /***********************************************************************
        
                Write an цел значение в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (цел x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.Int);
                return this;
        }

        /***********************************************************************
        
                Write an unsigned дол значение в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (бдол x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.ULong);
                return this;
        }

        /***********************************************************************
        
                Write a дол значение в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (дол x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.Long);
                return this;
        }

        /***********************************************************************
        
                Write a плав значение в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (плав x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.Float);
                return this;
        }

        /***********************************************************************
        
                Write a дво значение в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (дво x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.Double);
                return this;
        }

        /***********************************************************************
        
                Write a реал значение в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (реал x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.Real);
                return this;
        }

        /***********************************************************************
        
                Write a сим значение в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (сим x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.Utf8);
                return this;
        }

        /***********************************************************************
        
                Write a шим значение в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (шим x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.Utf16);
                return this;
        }

        /***********************************************************************
        
                Write a дим значение в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (дим x)
        {
                elements (&x, x.sizeof, ИПротокол.Тип.Utf32);
                return this;
        }

        /***********************************************************************
        
                Write a булево Массив в_ the current буфер-позиция     
                                
        ***********************************************************************/

        final ИПисатель помести (бул[] x)
        {
                массивы (x.ptr, x.length * бул.sizeof, ИПротокол.Тип.Bool);
                return this;
        }

        /***********************************************************************
        
                Write a байт Массив в_ the current буфер-позиция     
                                
        ***********************************************************************/

        final ИПисатель помести (байт[] x)
        {
                массивы (x.ptr, x.length * байт.sizeof, ИПротокол.Тип.Byte);
                return this;
        }

        /***********************************************************************
        
                Write an unsigned байт Массив в_ the current буфер-позиция     
                                
        ***********************************************************************/

        final ИПисатель помести (ббайт[] x)
        {
                массивы (x.ptr, x.length * ббайт.sizeof, ИПротокол.Тип.UByte);
                return this;
        }

        /***********************************************************************
        
                Write a крат Массив в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (крат[] x)
        {
                массивы (x.ptr, x.length * крат.sizeof, ИПротокол.Тип.Short);
                return this;
        }

        /***********************************************************************
        
                Write an unsigned крат Массив в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (бкрат[] x)
        {
                массивы (x.ptr, x.length * бкрат.sizeof, ИПротокол.Тип.UShort);
                return this;
        }

        /***********************************************************************
        
                Write an цел Массив в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (цел[] x)
        {
                массивы (x.ptr, x.length * цел.sizeof, ИПротокол.Тип.Int);
                return this;
        }

        /***********************************************************************
        
                Write an unsigned цел Массив в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (бцел[] x)
        {
                массивы (x.ptr, x.length * бцел.sizeof, ИПротокол.Тип.UInt);
                return this;
        }

        /***********************************************************************
        
                Write a дол Массив в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (дол[] x)
        {
                массивы (x.ptr, x.length * дол.sizeof, ИПротокол.Тип.Long);
                return this;
        }

        /***********************************************************************
         
                Write an unsigned дол Массив в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (бдол[] x)
        {
                массивы (x.ptr, x.length * бдол.sizeof, ИПротокол.Тип.ULong);
                return this;
        }

        /***********************************************************************
        
                Write a плав Массив в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (плав[] x)
        {
                массивы (x.ptr, x.length * плав.sizeof, ИПротокол.Тип.Float);
                return this;
        }

        /***********************************************************************
        
                Write a дво Массив в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (дво[] x)
        {
                массивы (x.ptr, x.length * дво.sizeof, ИПротокол.Тип.Double);
                return this;
        }

        /***********************************************************************
        
                Write a реал Массив в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (реал[] x)
        {
                массивы (x.ptr, x.length * реал.sizeof, ИПротокол.Тип.Real);
                return this;
        }

        /***********************************************************************
        
                Write a сим Массив в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (ткст x) 
        {
                массивы (x.ptr, x.length * сим.sizeof, ИПротокол.Тип.Utf8);
                return this;
        }

        /***********************************************************************
        
                Write a шим Массив в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (шим[] x) 
        {
                массивы (x.ptr, x.length * шим.sizeof, ИПротокол.Тип.Utf16);
                return this;
        }

        /***********************************************************************
        
                Write a дим Массив в_ the current буфер-позиция
                
        ***********************************************************************/

        final ИПисатель помести (дим[] x)
        {
                массивы (x.ptr, x.length * дим.sizeof, ИПротокол.Тип.Utf32);
                return this;
        }

        /***********************************************************************
        
                Dump Массив контент преобр_в the буфер. Note that the default
                behaviour is в_ префикс with the Массив байт счёт 

        ***********************************************************************/

        private проц пишиМассив (ук  ист, бцел байты, ИПротокол.Тип тип)
        {
                помести (байты);
                пишиЭлемент (ист, байты, тип);
        }

        /***********************************************************************
        
                Dump контент преобр_в the буфер

        ***********************************************************************/

        private проц пишиЭлемент (ук  ист, бцел байты, ИПротокол.Тип тип)
        {
                buffer_.добавь (ист [0 .. байты]);
        }
}
