/*******************************************************************************

        copyright:      Copyright (c) 2007 Kris Bell. Все права защищены

        license:        BSD стиль: $(LICENSE)

        version:        Initial release: Oct 2007

        author:         Kris

        Simple serialization for текст-based имя/значение pairs

*******************************************************************************/

module io.stream.Map;

private import io.stream.Lines,
               io.stream.Buffered;

private import Текст = text.Util;

private import io.device.Conduit;

/*******************************************************************************

        Provопрes загрузи facilities for a свойства поток. That is, a файл
        or другой medium containing lines of текст with a имя=значение выкладка

*******************************************************************************/

class КартВвод(T) : Строки!(T)
{
        /***********************************************************************

                Propagate ctor в_ superclass

        ***********************************************************************/

        this (ИПотокВвода поток)
        {
                super (поток);
        }

        /***********************************************************************

                Load свойства из_ the предоставленный поток, via a foreach.

                We use an iterator в_ смети текст lines, and extract lValue
                and rValue pairs из_ each one, The ожидалось файл форматируй is
                as follows:

                <pre>
                x = y
                abc = 123
                x.y.z = this is a single property

                # this is a коммент строка
                </pre>

                Note that the предоставленный имя and значение are actually slices
                and should be copied if you intend в_ retain them (using
                имя.dup and значение.dup where appropriate)

        ***********************************************************************/

        final цел opApply (цел delegate(ref T[] имя, ref T[] значение) дг)
        {
                цел возвр;

                foreach (строка; super)
                        {
                        auto текст = Текст.убери (строка);

                        // comments require '#' as the first non-пробел сим
                        if (текст.length && (текст[0] != '#'))
                           {
                           // найди the '=' сим
                           auto i = Текст.местоположение (текст, cast(T) '=');

                           // ignore if не найден ...
                           if (i < текст.length)
                              {
                              auto имя = Текст.убери (текст[0 .. i]);
                              auto значение = Текст.убери (текст[i+1 .. $]);
                              if ((возвр = дг (имя, значение)) != 0)
                                   break;
                              }
                           }
                        }
                return возвр;
        }

        /***********************************************************************

                Load the ввод поток преобр_в an AA

        ***********************************************************************/

        final КартВвод загрузи (ref T[][T[]] свойства)
        {
                foreach (имя, значение; this)
                         свойства[имя.dup] = значение.dup;  
                return this;
        }
}


/*******************************************************************************

        Provопрes пиши facilities on a свойства поток. That is, a файл
        or другой medium which will contain lines of текст with a имя=значение 
        выкладка

*******************************************************************************/

class КартВывод(T) : ФильтрВывода
{
        private T[] кс;

        private const T[] префикс = "# ";
        private const T[] равно = " = ";
        version (Win32)
                 private const T[] NL = "\r\n";
        version (Posix)
                 private const T[] NL = "\n";

        /***********************************************************************

                Propagate ctor в_ superclass

        ***********************************************************************/

        this (ИПотокВывода поток, T[] нс = NL)
        {
                super (Бвыв.создай (поток));
                кс = нс;
        }

        /***********************************************************************

                Append a нс в_ the предоставленный поток

        ***********************************************************************/

        final КартВывод нс ()
        {
                сток.пиши (кс);
                return this;
        }

        /***********************************************************************

                Append a коммент в_ the предоставленный поток

        ***********************************************************************/

        final КартВывод коммент (T[] текст)
        {
                сток.пиши (префикс);
                сток.пиши (текст);
                сток.пиши (кс);
                return this;
        }

        /***********************************************************************

                Append имя & значение в_ the предоставленный поток

        ***********************************************************************/

        final КартВывод добавь (T[] имя, T[] значение)
        {
                сток.пиши (имя);
                сток.пиши (равно);
                сток.пиши (значение);
                сток.пиши (кс);
                return this;
        }

        /***********************************************************************

                Append AA свойства в_ the предоставленный поток

        ***********************************************************************/

        final КартВывод добавь (T[][T[]] свойства)
        {
                foreach (ключ, значение; свойства)
                         добавь (ключ, значение);
                return this;
        }
}



/*******************************************************************************
        
*******************************************************************************/
        
debug (UnitTest)
{
        import io.Stdout;
        import io.device.Array;
        
        unittest
        {
                auto буф = new Массив(200);
                auto ввод = new КартВвод!(сим)(буф);
                auto вывод = new КартВывод!(сим)(буф);

                ткст[ткст] карта;
                карта["foo"] = "bar";
                карта["foo2"] = "bar2";
                вывод.добавь(карта).слей;

                карта = карта.init;
                ввод.загрузи (карта);
                assert (карта["foo"] == "bar");
                assert (карта["foo2"] == "bar2");
        }
}
