/*******************************************************************************

        copyright:      Copyright (c) 2004 Kris Bell. все rights reserved

        license:        BSD стиль: $(LICENSE)
      
        version:        Initial release: May 2004
        
        author:         Kris

*******************************************************************************/

module util.log.AppendConsole;

private import  io.Console;

private import  util.log.Log;

/*******************************************************************************

        Добавщик for Отправкаing formatted вывод в_ the console

*******************************************************************************/

public class ДобВКонсоль : ДобПоток
{
        /***********************************************************************
                
                Create with the given выкладка

        ***********************************************************************/

        this (Добавщик.Выкладка как = пусто)
        {
                super (Кош.поток, да, как);
        }

        /***********************************************************************
                
                Вернуть имя данного класса

        ***********************************************************************/

        override ткст имя ()
        {
                return this.classinfo.имя;
        }
}
