/*******************************************************************************

        copyright:      Copyright (c) 2004 Kris Bell. все rights reserved

        license:        BSD стиль: $(LICENSE)
      
        version:        Initial release: May 2004
        
        author:         Kris

*******************************************************************************/

module util.log.AppendFile;

private import  util.log.Log;

private import  io.device.File;

private import  io.stream.Buffered;

private import  io.model.IFile,
                io.model;

/*******************************************************************************

        Append лог messages в_ a файл. This basic version есть no rollover 
        support, so it just keeps on добавьing в_ the файл. There is also an
        ДобВФайлы that may suit your needs.

*******************************************************************************/

class ДобВФайл : Файлер
{
        private маска    mask_;

        /***********************************************************************
                
                Create a basic FileAppender в_ a файл with the specified 
                путь.

        ***********************************************************************/

        this (ткст fp, Добавщик.Выкладка как = пусто)
        {
                // Get a unique fingerprint for this экземпляр
                mask_ = регистрируй (fp);
        
                // сделай it shareable for читай
                auto стиль = Файл.ЧитДоб;
                стиль.совместно = Файл.Коммуна.Чтен;
                конфигурируй (new Файл (fp, стиль));
                выкладка (как);
        }

        /***********************************************************************
                
                Возвращает фингерпринт для данного класса

        ***********************************************************************/

        final Маска маска ()
        {
                return mask_;
        }

        /***********************************************************************
                
                Вернуть имя данного класса

        ***********************************************************************/

        final ткст имя ()
        {
                return this.classinfo.имя;
        }
                
        /***********************************************************************
                
                Append an событие в_ the вывод.
                 
        ***********************************************************************/

        final synchronized проц добавь (СобытиеЛога событие)
        {
                выкладка.форматируй (событие, &буфер.пиши);
                буфер.добавь (ФайлКонст.НовСтрЗнак)
                      .слей;
        }
}


/*******************************************************************************

        Base class for файл appenders

*******************************************************************************/

class Файлер : Добавщик
{
        package Бвыв            буфер;
        private ИПровод        conduit_;

        /***********************************************************************
                
                Return the провод

        ***********************************************************************/

        final ИПровод провод ()
        {
                return conduit_;
        }

        /***********************************************************************
                
                Close the файл associated with this Добавщик

        ***********************************************************************/

        final synchronized проц закрой ()
        {
                if (conduit_)
                   {
                   conduit_.открепи;
                   conduit_ = пусто;
                   }
        }

        /***********************************************************************
                
                Набор the провод

        ***********************************************************************/

        package final Бвыв конфигурируй (ИПровод провод)
        {
                // создай a new буфер upon this провод
                conduit_ = провод;
                return (буфер = new Бвыв(провод));
        }
}


