/*******************************************************************************

        copyright:      Copyright (c) 2004 Kris Bell. все rights reserved

        license:        BSD стиль: $(LICENSE)
      
        version:        Initial release: May 2004
        
        author:         Kris

*******************************************************************************/

module util.log.LayoutChainsaw;

private import  thread;

private import  util.log.Log;

/*******************************************************************************

        A выкладка with XML вывод conforming в_ Журнал4J specs.
       
*******************************************************************************/

public class ЦепьВыкладок : Добавщик.Выкладка
{
        /***********************************************************************
                
                Subclasses should implement this метод в_ perform the
                formatting of the actual сообщение контент.

        ***********************************************************************/

        проц форматируй (СобытиеЛога событие, т_мера delegate(проц[]) дг)
        {
                сим[20] врем;
                ткст   имяНити;
                
                имяНити = Нить.getThis.имя;
                if (имяНити.length is 0)
                    имяНити = "{неизвестное}";

                дг ("<log4j:event logger=\"");
                дг (событие.имя);
                дг ("\" timestamp=\"");
                дг (событие.вМилли (врем, событие.время.вринтервал));
                дг ("\" level=\"");
                дг (событие.имяУровня);
                дг ("\" thread=\"");
                дг (имяНити);
                дг ("\">\r\n<log4j:сообщение><![CDATA[");

                дг (событие.вТкст);

                дг ("]]></log4j:сообщение>\r\n<log4j:свойства><log4j:data name=\"application\" value=\"");
                дг (событие.хост.имя);
                дг ("\"/><log4j:data name=\"имя_хоста\" value=\"");
                дг (событие.хост.адрес);
                дг ("\"/></log4j:свойства></log4j:event>\r\n");
        }
}


