module std.string;

const char[16] hexdigits = "0123456789ABCDEF";			/// 0..9A..F
const char[10] digits    = "0123456789";			/// 0..9
const char[8]  octdigits = "01234567";				/// 0..7
const char[92] lowercase = "abcdefghijklmnopqrstuvwxyzабвгдеёжзийклмнопрстуфхцчшщъыьэюя";	/// a..z а..я
const char[92] uppercase = "ABCDEFGHIJKLMNOPQRSTUVWXYZАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";	/// A..Z А..Я
const char[184] letters   = "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
			   "abcdefghijklmnopqrstuvwxyz" "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ" "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";	/// A..Za..z

const char[6] whitespace = " \t\v\r\n\f";			/// ASCII whitespace

const dchar LS = '\u2028';	/// UTF line separator
const dchar PS = '\u2029';	/// UTF paragraph separator

/// Newline sequence for this system
version (Windows)
    const char[2] newline = "\r\n";
else version (Posix)
    const char[1] newline = "\n";


extern(D):


    бул вОбразце(дим с, ткст образец);
    бул вОбразце(дим с, ткст[] образец);
    
    ткст фм(...);
    alias фм форматируй;

    ткст форматируйс(ткст т, ...);
    бул пробел_ли(дим т);
    дол ткствцел(ткст т);
    реал ткствдробь(ткст т);
    цел сравни(ткст s1, ткст s2);
    цел сравнлюб(ткст s1, ткст s2);
    сим* вТкст0(ткст т);
    цел найди(ткст т, дим c);
    цел найдлюб(ткст т, дим c);
    цел найдрек(ткст т, дим c);
    цел найдлюбрек(ткст т, дим c);
    цел найди(ткст т, ткст тзам);
    цел найдлюб(ткст т, ткст тзам);
    цел найдрек(ткст т, ткст тзам);
    цел найдлюбрек(ткст т, ткст тзам);
    ткст впроп(ткст т);
    ткст взаг(ткст т);
    ткст озаг(ткст т);
    ткст озагслова(ткст т);
    ткст повтори(ткст т, т_мера м);
    ткст объедини(ткст[] слова, ткст разд);
    ткст[] разбей(ткст т);
    ткст[] разбейдоп(ткст т, ткст разделитель);
    ткст[] разбейнастр(ткст т);
    ткст уберислева(ткст т);
    ткст уберисправа(ткст т);
    ткст убери(ткст т);
    ткст убериразгр(ткст т);
    ткст уберигран(ткст т);
    ткст полев(ткст т, цел ширина);
    ткст поправ(ткст т, цел ширина);
    ткст вцентр(ткст т, цел ширина);
    ткст занули(ткст т, цел ширина);

    ткст замени(ткст т, ткст с, ткст на);
    ткст заменисрез(ткст т, ткст срез, ткст замена);
    ткст вставь(ткст т, т_мера индекс, ткст подст);
    т_мера счесть(ткст т, ткст подст);

    ткст заменитабнапбел(ткст стр, цел размтаб=8);
    ткст заменипбелнатаб(ткст стр, цел размтаб=8);
    ткст постройтранстаб(ткст из, ткст в);
    ткст транслируй(ткст т, ткст табтранс, ткст удсим);


    т_мера посчитайсимв(ткст т, ткст образец);
    ткст удалисимв(ткст т, ткст образец);
    ткст сквиз(ткст т, ткст образец= null);
    ткст следщ(ткст т);

    ткст тз(ткст ткт, ткст из, ткст в, ткст модифф = null);
    бул чис_ли(in ткст т, in бул раздВкл = false);
    т_мера колном(ткст ткт, цел размтаб=8);
    ткст параграф(ткст т, цел колонки = 80, ткст первотступ = null, ткст отступ = null, цел размтаб = 8);
    ткст эладр_ли(ткст т);
    ткст урл_ли(ткст т);
    ткст целВЮ8(ткст врем, бцел знач);
    ткст бдолВЮ8(ткст врем, бцел знач);

    ткст вТкст(бул с);
    ткст вТкст(сим с);
    ткст вТкст(ббайт с);
    ткст вТкст(бкрат с);
    ткст вТкст(бцел с);
    ткст вТкст(бдол с);
    ткст вТкст(байт с);
    ткст вТкст(крат с);
    ткст вТкст(цел с);
    ткст вТкст(дол с);
    ткст вТкст(плав с);
    ткст вТкст(дво с);
    ткст вТкст(реал с);
    ткст вТкст(вплав с);
    ткст вТкст(вдво с);
    ткст вТкст(вреал с);
    ткст вТкст(кплав с);
    ткст вТкст(кдво с);
    ткст вТкст(креал с);
    ткст вТкст(дол знач, бцел корень);
    ткст вТкст(бдол знач, бцел корень);
    ткст вТкст(сим *с);

	alias пробел_ли iswhite;
	alias ткствцел atoi;
	alias ткствдробь atof;
	alias сравни cmp;
	alias сравнлюб icmp;
	alias вТкст0 toStringz;
	alias найди find;
	alias найдлюб ifind;
	alias найдрек rfind;
	alias найдлюбрек irfind;
	alias впроп tolower;
	alias взаг toupper;
	alias озаг capitalize;
	alias озагслова capwords;	
	alias повтори repeat;
	alias объедини join;
	alias разбей split;
	alias разбейдоп split;
	alias разбейнастр splitlines;
	alias уберислева stripl;
	alias уберисправа stripr;
	alias убери strip;
	alias убериразгр chomp;
	alias уберигран chop;
	alias полев ljustify;
	alias поправ rjustify;
	alias вцентр center;
	alias занули zfill;
	alias замени replace;
	alias заменисрез replaceSlice;
	alias вставь insert;
	alias счесть count;
	alias заменитабнапбел expandtabs;
	alias заменипбелнатаб entab;
	alias постройтранстаб maketrans;
	alias транслируй translate;		
	alias посчитайсимв countchars;
	alias удалисимв removechars;
	alias сквиз squeeze;
	alias следщ succ;	
	alias тз tr;
	alias чис_ли isNumeric;
	alias колном column;
	alias параграф wrap;
	alias эладр_ли isEmail;
	alias урл_ли isURL;
	alias целВЮ8 intToUtf8;
	alias бдолВЮ8 ulongToUtf8;
	alias фм format;
	
