module std.utf;

extern(D)
{
	бул дим_ли(дим д);
	бцел байтЮ(ткст т, т_мера и);
	бцел байтЮ(шткст т, т_мера и);
	бцел байтЮ(юткст т, т_мера и);
	т_мера доИндексаУНС(ткст т, т_мера и);
	т_мера доИндексаУНС(шткст т, т_мера и);
	т_мера доИндексаУНС(юткст т, т_мера и);
	т_мера вИндексЮ(ткст т, т_мера и);
	т_мера вИндексЮ(шткст т, т_мера и);
	т_мера вИндексЮ(юткст т, т_мера и);
	дим раскодируйЮ(ткст т, inout т_мера инд);
	дим раскодируйЮ(шткст т, inout т_мера инд);
	дим раскодируйЮ(юткст т, inout т_мера инд);
	проц кодируйЮ(inout ткст т, дим с);
	проц кодируйЮ(inout шткст т, дим с);
	проц кодируйЮ(inout юткст т, дим с);
	проц оцениЮ(ткст т);
	проц оцениЮ(шткст т);
	проц оцениЮ(юткст т);
	ткст вЮ8(сим[4] буф, дим с);
	ткст вЮ8(ткст т);
	ткст вЮ8(шткст т);
	ткст вЮ8(юткст т);
	шткст вЮ16(шим[2] буф, дим с);
	шткст вЮ16(ткст т);
	шим* вЮ16н(ткст т);
	шткст вЮ16(шткст т);
	шткст вЮ16(юткст т);
	юткст вЮ32(ткст т);
	юткст вЮ32(шткст т);
	юткст вЮ32(юткст т);
}
