/*******************************************************************************

        copyright:      Copyright (c) 2007 Kris Bell. Все права защищены

        license:        BSD стиль: $(LICENSE)

        version:        Sep 2007: Initial release
        version:        Nov 2007: добавьed поток wrappers

        author:         Kris

*******************************************************************************/

module text.convert.Format;

private import text.convert.Layout;

/******************************************************************************

        Конструирует глобальный utf8 экземпляр Выкладки

******************************************************************************/

public Выкладка!(сим) Формат;

static this()
{
    Формат = Выкладка!(сим).экземпляр;
}

