/*******************************************************************************

        copyright:      Copyright (c) 2004 Kris Bell. все rights reserved

        license:        BSD стиль: $(LICENSE)
      
        version:        Initial release: May 2004
        
        author:         Kris

*******************************************************************************/

module util.log.AppendSocket;

private import  util.log.Log;

private import  io.Console;

private import  io.stream.Buffered;
                
private import  net.device.Socket,
                net.InternetAddress;

/*******************************************************************************

        Добавщик for Отправкаing formatted вывод в_ a Сокет.

*******************************************************************************/

public class ДобВСокет : Добавщик
{
        private ткст          кс;
        private Маска            маска_;
        private Бвыв            буфер;
        private Сокет          провод;
        private АдресИнтернета адрес;
        private бул            подключен;

        /***********************************************************************
                
                Созд with the given Выкладка и адрес. Specify an конец-
                of-строка ткст if you want that appended в_ each сообщение 

        ***********************************************************************/

        this (АдресИнтернета адрес, Добавщик.Выкладка как = пусто, ткст кс=пусто)
        {
                выкладка (как);

                this.кс     = кс;
                this.адрес = адрес;
                this.провод = new Сокет;
                this.буфер  = new Бвыв (провод);

                // Get a unique fingerprint for this class
                маска_ = регистрируй (адрес.вТкст);
        }

        /***********************************************************************
                
                Возвращает фингерпринт для данного класса

        ***********************************************************************/

        Маска маска ()
        {
                return маска_;
        }

        /***********************************************************************
                
                Вернуть имя данного класса

        ***********************************************************************/

        ткст имя ()
        {
                return this.classinfo.имя;
        }
                
        /***********************************************************************
                
                Доб an событие в_ the вывод. If the operations fails
                we have в_ revert в_ an alternative logging strategy, 
                which will probably require a backup Добавщик specified
                during construction. For сейчас we simply echo в_ Кош if
                the сокет имеется become unavailable.               
                 
        ***********************************************************************/

        проц добавь (СобытиеЛога событие)
        {
                auto выкладка = выкладка();

                if (буфер)
                   {
                   try {
                       if (! подключен)
                          {
                          провод.подключись (адрес);
                          подключен = да;
                          }

                       выкладка.форматируй (событие, &буфер.пиши);
                       if (кс.length)
                           буфер.пиши (кс);
                       буфер.слей;
                       return;
                       } catch (Исключение e)
                               {
                               подключен = нет;
                               Кош ("СОКЕТAppender.добавь :: "~e.вТкст).нс;
                               }
                   }

                Кош (событие.вТкст).нс;
        }

        /***********************************************************************
            
                Close the сокет associated with this Добавщик
                    
        ***********************************************************************/

        проц закрой ()
        {
                if (провод)
                    провод.открепи;
                провод = пусто;
        }
}
