/*******************************************************************************

        copyright:      Copyright (c) 2004 Kris Bell. все rights reserved

        license:        BSD стиль: $(LICENSE)

        version:        Jan 2007: начальное release
        
        author:         Kris 

*******************************************************************************/

module io.protocol.model;

private import io.model.ИБуфер;

/*******************************************************************************
        
*******************************************************************************/

abstract class ИПротокол
{
        enum Тип
        {
                Void = 0,
                Utf8, 
                Bool,
                Byte,
                UByte,
                Utf16,
                Short,
                UShort,
                Utf32,
                Int,
                UInt,
                Float,
                Long,
                ULong,
                Double,
                Real,
                Obj,
                Pointer,
        }
        
        /***********************************************************************

        ***********************************************************************/

        alias проц   delegate (ук  ист, бцел байты, Тип тип) Писатель;
        alias проц   delegate (ук  ист, бцел байты, Тип тип) ПисательМассива;

        alias проц[] delegate (ук  приёмн, бцел байты, Тип тип) Читатель;
        alias проц[] delegate (Читатель читатель, бцел байты, Тип тип) Разместитель;

        alias проц[] delegate (ук  приёмн, бцел байты, Тип тип, Разместитель) ЧитательМассива;
        
        /***********************************************************************

        ***********************************************************************/

        abstract ИБуфер буфер ();

        /***********************************************************************

        ***********************************************************************/

        abstract проц[] читай (ук  приёмн, бцел байты, Тип тип);

        /***********************************************************************

        ***********************************************************************/

        abstract проц пиши (ук  ист, бцел байты, Тип тип);

        /***********************************************************************

        ***********************************************************************/

        abstract проц[] читайМассив (ук  приёмн, бцел байты, Тип тип, Разместитель alloc);
        
        /***********************************************************************

        ***********************************************************************/

        abstract проц пишиМассив (ук  ист, бцел байты, Тип тип);
}


/*******************************************************************************

*******************************************************************************/

abstract class ИРазместитель
{
        /***********************************************************************
        
        ***********************************************************************/

        abstract проц сбрось ();
        
        /***********************************************************************

        ***********************************************************************/

        abstract ИПротокол протокол ();

        /***********************************************************************

        ***********************************************************************/

        abstract проц[] размести (ИПротокол.Читатель, бцел байты, ИПротокол.Тип);
}
