/*******************************************************************************

        copyright:      Copyright (c) 2007 Kris Bell. все rights reserved

        license:        BSD стиль: $(LICENSE)

        version:        Initial release: June 2007

        author:         Kris

*******************************************************************************/

module io.stream.Greedy;

private import io.device.Conduit;


/*******************************************************************************

        A провод фильтр that ensures its ввод is читай in full. There's
        also an optional читайРовно() for ещё explicit requests         

*******************************************************************************/

class ГридиВвод : ФильтрВвода
{
        /***********************************************************************

                Propagate ctor в_ superclass

        ***********************************************************************/

        this (ИПотокВвода поток)
        {
                super (поток);
        }

        /***********************************************************************

                Fill the provопрed Массив. Returns the число of байты
                actually читай, which will be less that приёмн.length when
                Кф есть been reached, and then Кф thereafter

        ***********************************************************************/

        final override т_мера читай (проц[] приёмн)
        {
                т_мера длин = 0;

                while (длин < приёмн.length)
                      {
                      auto i = источник.читай (приёмн [длин .. $]);
                      if (i is Кф)
                          return (длин ? длин : i);
                      длин += i;
                      } 
                return длин;
        }

        /***********************************************************************
        
                Чтен из_ a поток преобр_в a мишень Массив. The provопрed приёмн
                will be fully populated with контент из_ the ввод. 

                This differs из_ читай in that it will throw an исключение
                where an Кф condition is reached before ввод есть completed

        ***********************************************************************/

        final ГридиВвод читайРовно (проц[] приёмн)
        {
                while (приёмн.length)
                      {
                      auto i = читай (приёмн);
                      if (i is Кф)
                          провод.ошибка ("неожиданный Кф во время чтения: "~провод.вТкст);
                      приёмн = приёмн [i .. $];
                      }
                return this;
        }          
}



/*******************************************************************************

        A провод фильтр that ensures its вывод is записано in full. There's
        also an optional пишиРовно() for ещё explicit requests   

*******************************************************************************/

class ГридиВывод : ФильтрВывода
{
        /***********************************************************************

                Propagate ctor в_ superclass

        ***********************************************************************/

        this (ИПотокВывода поток)
        {
                super (поток);
        }

        /***********************************************************************

                Consume everything we were given. Returns the число of
                байты записано which will be less than ист.length only
                when an Кф condition is reached, and Кф из_ that точка 
                forward

        ***********************************************************************/

        final override т_мера пиши (проц[] ист)
        {
                т_мера длин = 0;

                while (длин < ист.length)
                      {
                      auto i = сток.пиши (ист [длин .. $]);
                      if (i is Кф)
                          return (длин ? длин : i);
                      длин += i;
                      } 
                return длин;
        }
                             
        /***********************************************************************
        
                Write в_ поток из_ a источник Массив. The provопрed ист контент 
                will be записано in full в_ the вывод.

                This differs из_ пиши in that it will throw an исключение
                where an Кф condition is reached before вывод есть completed

        ***********************************************************************/

        final ГридиВывод пишиРовно (проц[] ист)
        {
                while (ист.length)
                      {
                      auto i = пиши (ист);
                      if (i is Кф)
                          провод.ошибка ("неожиданный Кф во время записи: "~провод.вТкст);
                      ист = ист [i .. $];
                      }
                return this;
        }       
}


/*******************************************************************************

*******************************************************************************/

debug (Greedy)
{
        проц main()
        {       
                auto s = new ГридиВвод (пусто);
        }
}