/*******************************************************************************

        copyright:      Copyright (c) 2007 Kris Bell. все rights reserved

        license:        BSD стиль: $(LICENSE)

        version:        Initial release: Nov 2007

        author:         Kris

*******************************************************************************/

module io.stream.TextFile;

public  import io.device.File;

private import io.stream.Text;

/*******************************************************************************

        Composes a файл with строка-oriented ввод. The ввод is buffered

*******************************************************************************/

class ТекстФайлВвод : ТекстВвод
{
        /***********************************************************************

                compose a FileStream              

        ***********************************************************************/

        this (ткст путь, Файл.Стиль стиль = Файл.ЧитСущ)
        {
                this (new Файл (путь, стиль));
        }

        /***********************************************************************

                Wrap a FileConduit экземпляр

        ***********************************************************************/

        this (Файл файл)
        {
                super (файл);
        }
}


/*******************************************************************************
       
        Composes a файл with formatted текст вывод. Вывод is buffered

*******************************************************************************/

class ТекстФайлВывод : ТекстВывод
{
        /***********************************************************************

                compose a FileStream              

        ***********************************************************************/

        this (ткст путь, Файл.Стиль стиль = Файл.ЗапСозд)
        {
                this (new Файл (путь, стиль));
        }

        /***********************************************************************

                Wrap a Файл экземпляр

        ***********************************************************************/

        this (Файл файл)
        {
                super (файл);
        }
 }


/*******************************************************************************

*******************************************************************************/

debug (TextFile)
{
        import io.Console;

        проц main()
        {
                auto t = new ТекстФайлВвод ("TextFile.d");
                foreach (строка; t)
                         Квывод(строка).нс;                  
        }
}
