/*******************************************************************************

        copyright:      Copyright (c) 2007 Kris Bell. все rights reserved

        license:        BSD стиль: $(LICENSE)

        version:        Initial release: Nov 2007

        author:         Kris

        Потокs в_ expose simple исконный типы as discrete elements. I/O
        is buffered and should yield fair performance.

*******************************************************************************/

module io.stream.Typed;

private import io.device.Conduit;

private import io.stream.Buffered;

/*******************************************************************************

        Тип T is the мишень or destination тип

*******************************************************************************/

class ТипированныйВвод(T) : ФильтрВвода
{       
        /***********************************************************************

        ***********************************************************************/

        this (ИПотокВвода поток)
        {
                super (Бввод.создай (поток));
        }
        
        /***********************************************************************

                Overrопрe this в_ give back a useful chaining reference

        ***********************************************************************/

        final override ТипированныйВвод слей ()
        {
                super.слей;
                return this;
        }

        /***********************************************************************

                Чтен a значение из_ the поток. Returns нет when все 
                контент есть been consumed

        ***********************************************************************/

        final бул читай (ref T x)
        {
                return источник.читай((&x)[0..1]) is T.sizeof;
        }

        /***********************************************************************

                Iterate over все контент

        ***********************************************************************/

        final цел opApply (цел delegate(ref T x) дг)
        {
                T x;
                цел возвр;

                while ((источник.читай((&x)[0..1]) is T.sizeof))
                        if ((возвр = дг (x)) != 0)
                             break;
                return возвр;
        }
}



/*******************************************************************************
        
        Тип T is the мишень or destination тип.

*******************************************************************************/

class ТипированныйВывод(T) : ФильтрВывода
{       
        /***********************************************************************

        ***********************************************************************/

        this (ИПотокВывода поток)
        {
                super (Бвыв.создай (поток));
        }

        /***********************************************************************
        
                Append a значение в_ the вывод поток

        ***********************************************************************/

        final проц пиши (ref T x)
        {
                сток.пиши ((&x)[0..1]);
        }
}


/*******************************************************************************
        
*******************************************************************************/
        
debug (UnitTest)
{
        import io.Stdout;
        import io.stream.Utf;
        import io.device.Array;

        unittest
        {
                Массив вывод;

                auto inp = new ТипированныйВвод!(сим)(new Массив("hello world"));
                auto oot = new ТипированныйВывод!(сим)(вывод = new Массив(20));

                foreach (x; inp)
                         oot.пиши (x);
                assert (вывод.срез == "hello world");

                auto xx = new ТипированныйВвод!(сим)(new ЮВвод!(сим, дим)(new Массив("hello world"d)));
                ткст yy;
                foreach (x; xx)
                         yy ~= x;
                assert (yy == "hello world");
        }
}
