/*******************************************************************************

        Copyright: Copyright (C) 2008 Kris Bell.  все rights reserved.

        License:   BSD стиль: $(LICENSE)

        version:   Initial release: March 2008      

        Authors:   Kris

*******************************************************************************/

module text.xml.DocTester;

private import exception;

private import text.xml.Document;

private import text.convert.Format;

/*******************************************************************************

        Valопрate a document

        TODO: добавь various tests here, or in subclasses, as required

*******************************************************************************/

protected class DocTester(T)
{
        private alias Документ!(T) Док;         /// the typed document
        private alias Док.Узел     Узел;        /// generic document node

        /***********************************************************************
        
                Generate a текст representation of the document дерево

        ***********************************************************************/
        
        final проц оцени (Док doc)
        {     
                оцени (doc.elements);  
        }
        
        /***********************************************************************
        
                Generate a representation of the given node-subtree 

        ***********************************************************************/
        
        final проц оцени (Узел node)
        {
                switch (node.опр)
                       {
                       case ПТипУзлаРЯР.Документ:
                            foreach (n; node.ветви)
                                     оцени (n);
                            break;
        
                       case ПТипУзлаРЯР.Element:
                            element (node);

                            foreach (n; node.атрибуты)
                                     attribute (n);

                            foreach (n; node.ветви)
                                     оцени (n);
                            break;
        
                       case ПТипУзлаРЯР.Атрибут:
                            attribute (node);
                            break;
        
                       case ПТипУзлаРЯР.Данные:
                            данные (node);
                            break;
        
                       case ПТипУзлаРЯР.Комментарий:
                            коммент (node);
                            break;
        
                       case ПТипУзлаРЯР.PI:
                            pi (node);
                            break;
                
                       case ПТипУзлаРЯР.СиДанные:
                            cdata (node);
                            break;
                
                       case ПТипУзлаРЯР.Доктип:
                            doctype (node);
                            break;
                       }
        }

        /***********************************************************************
        
                оцени an element

        ***********************************************************************/
        
        проц element (Узел node)
        {
                uniqueAttrNames (node);
        }

        /***********************************************************************
        
                оцени an attribute

        ***********************************************************************/
        
        проц attribute (Узел node)
        {
        }

        /***********************************************************************
        
                оцени a данные node

        ***********************************************************************/
        
        проц данные (Узел node)
        {
        }

        /***********************************************************************
        
                оцени a коммент node

        ***********************************************************************/
        
        проц коммент (Узел node)
        {
        }

        /***********************************************************************
        
                оцени a pi node

        ***********************************************************************/
        
        проц pi (Узел node)
        {
        }

        /***********************************************************************
        
                оцени a cdata node

        ***********************************************************************/
        
        проц cdata (Узел node)
        {
        }

        /***********************************************************************
        
                оцени a doctype node

        ***********************************************************************/
        
        проц doctype (Узел node)
        {
        }

        /***********************************************************************
        
                Ensure attribute names are unique within the element 

        ***********************************************************************/
        
        static проц uniqueAttrNames (Узел node)
        {
                T[128]  name1 =void,
                        name2 =void;

                // non-optimal, but is it critical?
                foreach (attr; node.атрибуты)
                        {
                        auto имя = attr.имя (name1);
                        auto следщ = attr.nextSibling;
                        while (следщ !is пусто)
                              {
                              if (имя == следщ.имя(name2))
                                  ошибка ("duplicate attribute имя '{}' for element '{}'", 
                                          имя, node.имя(name2));
                              следщ = attr.nextSibling;
                              }
                        }
        }

        /***********************************************************************
        
                halt validation

        ***********************************************************************/
        
        static проц ошибка (ткст форматируй, ...)
        {
                throw new TextException (Формат.преобразуй(_arguments, _argptr, форматируй));
        }
}




/*******************************************************************************

*******************************************************************************/

debug (DocTester)
{
        проц main()
        {
                auto v = new DocTester!(сим);
        }
}
