/*******************************************************************************

        copyright:      Copyright (c) 2007 Kris Bell. все rights reserved

        license:        BSD стиль: $(LICENSE)

        version:        Jan 2007 : начальное release
        
        author:         Kris 

*******************************************************************************/

module io.protocol.NativeProtocol;

private import  io.Buffer;

private import  io.protocol.model;

/*******************************************************************************

*******************************************************************************/


class ПротоколНатив : ИПротокол
{


        protected бул          prefix_;
        protected ИБуфер       buffer_;

        /***********************************************************************

        ***********************************************************************/

        this (ИПровод провод, бул префикс=да)
        {
                this.prefix_ = префикс;

                auto b = cast(ИБуферированный) провод;
                buffer_ = b ? b.буфер() : объБуфер(провод);
        }

        /***********************************************************************

        ***********************************************************************/

        ИБуфер буфер ()
        {
                return  buffer_;
        }

        /***********************************************************************

        ***********************************************************************/

        проц[] читай (ук приёмн, бцел байты, Тип тип)
        {
                return buffer_.читайРовно (приёмн, байты);
        }
        
        /***********************************************************************

        ***********************************************************************/

        проц пиши (ук ист, бцел байты, Тип тип)
        {
                buffer_.добавь (ист, байты);
        }
        
        /***********************************************************************

        ***********************************************************************/

        проц[] читайМассив (ук приёмн, бцел байты, Тип тип, Разместитель размести)
        {
                if (prefix_)
                   {
                   читай (&байты, байты.sizeof, Тип.UInt);
                   return размести (&читай, байты, тип); 
                   }

                return читай (приёмн, байты, тип);
        }
        
        /***********************************************************************

        ***********************************************************************/

        проц пишиМассив (ук ист, бцел байты, Тип тип)
        {
                if (prefix_)
                    пиши (&байты, байты.sizeof, Тип.UInt);

                пиши (ист, байты, тип);
        }
}



/*******************************************************************************

*******************************************************************************/

debug (UnitTest)
{
        import io.Buffer;
        import io.protocol.Writer;
        import io.protocol.Reader;
        import io.protocol.NativeProtocol;
        
        unittest
        {
                auto протокол = new ПротоколНатив (new Буфер(32));
                auto ввод  = new Читатель (протокол);
                auto вывод = new Писатель (протокол);

                ткст foo;
                вывод ("testing testing 123"c);
                ввод (foo);
                assert (foo == "testing testing 123");
        }
}

   