/*******************************************************************************

        copyright:      Copyright (c) 2006 Dinrus. все rights reserved

        license:        BSD стиль: see doc/license.txt for details

        version:        Initial release: Feb 2006

        author:         Regan Heath, Oskar Linde

        This module реализует the SHA-0 Algorithm described by Secure 
        Хэш Standard, FИПS PUB 180

*******************************************************************************/

module util.digest.Sha0;

private import util.digest.Sha01;

public  import util.digest.Digest;

/*******************************************************************************

*******************************************************************************/

final class Sha0 : Sha01
{
        /***********************************************************************

                Construct an Sha0

        ***********************************************************************/

        this() { }

        /***********************************************************************

        ***********************************************************************/

        final protected override проц трансформируй(ббайт[] ввод)
        {
                бцел A,B,C,D,Е,TEMP;
                бцел[16] W;
                бцел s;

                bigEndian32(ввод,W);

                A = контекст[0];
                B = контекст[1];
                C = контекст[2];
                D = контекст[3];
                Е = контекст[4];

                for(бцел t = 0; t < 80; t++) {
                        s = t & маска;
                        if (t >= 16) расширь(W,s);
                        TEMP = вращайВлево(A,5) + f(t,B,C,D) + Е + W[s] + K[t/20];
                        Е = D; D = C; C = вращайВлево(B,30); B = A; A = TEMP;
                }

                контекст[0] += A;
                контекст[1] += B;
                контекст[2] += C;
                контекст[3] += D;
                контекст[4] += Е;
        }

        /***********************************************************************

        ***********************************************************************/

        final static protected проц расширь(бцел W[], бцел s)
        {
                W[s] = W[(s+13)&маска] ^ W[(s+8)&маска] ^ W[(s+2)&маска] ^ W[s];
        }


}


/*******************************************************************************

*******************************************************************************/

debug(UnitTest)
{
        unittest 
        {
        static ткст[] strings = 
        [
                "",
                "abc",
                "сообщение дайджест",
                "abcdefghijklmnopqrstuvwxyz",
                "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789",
                "12345678901234567890123456789012345678901234567890123456789012345678901234567890"
        ];

        static ткст[] results = 
        [
                "f96cea198ad1dd5617ac084a3d92c6107708c0ef",
                "0164b8a914cd2a5e74c4f7ff082c4d97f1edf880",
                "c1b0f222d150ebb9aa36a40cafdc8bcbed830b14",
                "b40ce07a430cfd3c033039b9fe9afec95dc1bdcd",
                "79e966f7a3a990df33e40e3d7f8f18d2caebadfa",
                "4aa29d14d171522ece47bee8957e35a41f3e9cff",
        ];

        Sha0 h = new Sha0();

        foreach (цел i, ткст s; strings) 
                {
                h.обнови(s);
                ткст d = h.гексДайджест();
                assert(d == results[i],":("~s~")("~d~")!=("~results[i]~")");
                }
        }
}
