import lib.mesa;
import cidrus: выход;

pragma(lib, "DinrusMesaDLL.lib");


enum
{
РАЗМРАМПЫ  = 16,
РАЗМП1СТАРТ = 32,
РАЗМП2СТАРТ = 48
}

static плав уголВращения = 0.;

/*  Initialize antialiasing for color index mode,
 *  including loading a green color ramp starting
 *  at РАЗМП1СТАРТ, and a blue color ramp starting
 *  at РАЗМП2СТАРТ. The ramps must be a multiple of 16.
 */
проц иниц()
{
   цел и;

   for (и = 0; и < РАЗМРАМПЫ; и++) {
      плав тень;
      тень = cast(плав) и/cast(плав) РАЗМРАМПЫ;
      глутУстановиЦвет(РАЗМП1СТАРТ+cast(цел)и, 0., тень, 0.);
      глутУстановиЦвет(РАЗМП2СТАРТ+cast(цел)и, 0., 0., тень);
   }

   глВключи (СМЯГЧЕНИЕ_ЛИНИИ);
   //глПодсказка (СМЯГЧЕНИЕ_ЛИНИИ_ПОДСКАЗКА, НЕ_ВАЖНО);
   глШиринаЛинии (1.5);

   глОчистиИндекс (cast(плав) РАЗМП1СТАРТ);
}

/*  Draw 2 diagonal lines to form an X
 */
extern (C) проц покажи()
{
   глОчисти(БИТ_БУФЕРА_ЦВЕТА);

   глИндекс(РАЗМП1СТАРТ);
   глСуньМатр();
   глВращай(-уголВращения, cast(плав) 0.0, cast(плав) 0.0, cast(плав) 0.1);
   глНачни (ЛИНИИ);
      глВершина (-0.5, 0.5);
      глВершина (0.5, -0.5);
   глСтоп ();
   глВыньМатр();

   глИндекс(РАЗМП2СТАРТ);
   глСуньМатр();
   глВращай(уголВращения, cast(плав) 0.0, cast(плав) 0.0, cast(плав) 0.1);
   глНачни (ЛИНИИ);
      глВершина (0.5, 0.5);
      глВершина (-0.5, -0.5);
   глСтоп ();
   глВыньМатр();

   глСлей();
}

extern (C) проц  перерисуй(цел w, цел h)
{
   глВьюпорт(0, 0, cast(Гцразм) w, cast(Гцразм) h);
   глРежимМатр(ПРОЕКЦИЯ);
   глЗагрузиИдент();
   if (w <= h) 
      глуОрто2М (-1.0, 1.0, 
         -1.0*cast(плав)h/cast(плав)w, 1.0*cast(плав)h/cast(плав)w);
   else 
      глуОрто2М (-1.0*cast(плав)w/cast(плав)h, 
         1.0*cast(плав)w/cast(плав)h, -1.0, 1.0);
   глРежимМатр(ОБЗОР_МОДЕЛИ);
   глЗагрузиИдент();
}

/* ARGSUSED1 */
extern (C) проц клавиатура(сим клава, цел x, цел y)
{
   switch (клава) {
      case 'r':
      case 'R':
         уголВращения += 20.;
         if (уголВращения >= 360.) уголВращения = 0.;
         глутПерепоказ();	
         break;
      case 27:  /*  Escape Key */
         выход(0);
         break;
      default:
         break;
    }
}

/*  Main Loop
 *  Open window with иницial window size, title bar, 
 *  color index покажи mode, and handle input events.
 */
цел main()
{
   //глутИниц(пусто, пусто);

   глутИницРежимПоказа (GLUT_SINGLE | GLUT_INDEX);
   глутИницРазмерОкна (200, 200);
   глутСоздайОкно ("aaindex");
   иниц();
   глутФункцПерерисовки (&перерисуй);
   глутФункцКлавиатуры (&клавиатура);
   глутФункцПоказа (&покажи);
   глутГлавныйЦикл();
   return 0;
}
