
	/*******************************************************************************
	*  Файл генерирован автоматически с помощью либпроцессора Динрус               *
	*  Дата:18.1.2015                                           Время: 19 ч. 26 мин.

	*******************************************************************************/


	module lib.Dinrus.Mesa;

	import stdrus;

	проц грузи(Биб биб)
	{

	
		//вяжи(функция_1)("_D3lib4mesa10глФасFkZv", биб);

		//вяжи(функция_2)("_D3lib4mesa12глОртоFddddddZv", биб);

		//вяжи(функция_3)("_D3lib4mesa12глСветFkkfZv", биб);

		//вяжи(функция_4)("_D3lib4mesa12глСветFkkiZv", биб);

		//вяжи(функция_5)("_D3lib4mesa12глСветFkkPfZv", биб);

		//вяжи(функция_6)("_D3lib4mesa12глСветFkkPiZv", биб);

		//вяжи(функция_7)("_D3lib4mesa12глСлейFZv", биб);

		//вяжи(функция_8)("_D3lib4mesa12глСтопFZv", биб);

		//вяжи(функция_9)("_D3lib4mesa12глЦветFffffZv", биб);

		//вяжи(функция_10)("_D3lib4mesa12глЦветFfffZv", биб);

		//вяжи(функция_11)("_D3lib4mesa12глЦветFggggZv", биб);

		//вяжи(функция_12)("_D3lib4mesa12глЦветFgggZv", биб);

		//вяжи(функция_13)("_D3lib4mesa12глЦветFhhhhZv", биб);

		//вяжи(функция_14)("_D3lib4mesa12глЦветFhhhZv", биб);

		//вяжи(функция_15)("_D3lib4mesa12глЦветFiiiiZv", биб);

		//вяжи(функция_16)("_D3lib4mesa12глЦветFiiiZv", биб);

		//вяжи(функция_17)("_D3lib4mesa12глЦветFkkkkZv", биб);

		//вяжи(функция_18)("_D3lib4mesa12глЦветFkkkZv", биб);

		//вяжи(функция_19)("_D3lib4mesa12глЦветFssssZv", биб);

		//вяжи(функция_20)("_D3lib4mesa12глЦветFsssZv", биб);

		//вяжи(функция_21)("_D3lib4mesa12глЦветFttttZv", биб);

		//вяжи(функция_22)("_D3lib4mesa12глЦветFtttZv", биб);

		//вяжи(функция_23)("_D3lib4mesa12глуШарFPS3lib4mesa10GLUquadricdiiZv", биб);

		//вяжи(функция_24)("_D3lib4mesa13глЦвет3FPdZv", биб);

		//вяжи(функция_25)("_D3lib4mesa13глЦвет3FPfZv", биб);

		//вяжи(функция_26)("_D3lib4mesa13глЦвет3FPgZv", биб);

		//вяжи(функция_27)("_D3lib4mesa13глЦвет3FPhZv", биб);

		//вяжи(функция_28)("_D3lib4mesa13глЦвет3FPiZv", биб);

		//вяжи(функция_29)("_D3lib4mesa13глЦвет3FPkZv", биб);

		//вяжи(функция_30)("_D3lib4mesa13глЦвет3FPsZv", биб);

		//вяжи(функция_31)("_D3lib4mesa13глЦвет3FPtZv", биб);

		//вяжи(функция_32)("_D3lib4mesa13глЦвет4FPdZv", биб);

		//вяжи(функция_33)("_D3lib4mesa13глЦвет4FPfZv", биб);

		//вяжи(функция_34)("_D3lib4mesa13глЦвет4FPgZv", биб);

		//вяжи(функция_35)("_D3lib4mesa13глЦвет4FPhZv", биб);

		//вяжи(функция_36)("_D3lib4mesa13глЦвет4FPiZv", биб);

		//вяжи(функция_37)("_D3lib4mesa13глЦвет4FPkZv", биб);

		//вяжи(функция_38)("_D3lib4mesa13глЦвет4FPsZv", биб);

		//вяжи(функция_39)("_D3lib4mesa13глЦвет4FPtZv", биб);

		//вяжи(функция_40)("_D3lib4mesa14глАккумFkfZv", биб);

		//вяжи(функция_41)("_D3lib4mesa14глДайУкFkPPvZv", биб);

		//вяжи(функция_42)("_D3lib4mesa14глНачниFkZv", биб);

		//вяжи(функция_43)("_D3lib4mesa14глТуманFkfZv", биб);

		//вяжи(функция_44)("_D3lib4mesa14глТуманFkiZv", биб);

		//вяжи(функция_45)("_D3lib4mesa14глТуманFkPfZv", биб);

		//вяжи(функция_46)("_D3lib4mesa14глТуманFkPiZv", биб);

		//вяжи(функция_47)("_D3lib4mesa14глФинишFZv", биб);

		//вяжи(функция_48)("_D3lib4mesa14глЦветдFddddZv", биб);

		//вяжи(функция_49)("_D3lib4mesa14глЦветдFdddZv", биб);

		//вяжи(функция_50)("_D3lib4mesa14глуДискFPS3lib4mesa10GLUquadricddiiZv", биб);

		//вяжи(функция_51)("_D3lib4mesa14глутДайFkZi", биб);

		//вяжи(функция_52)("_D3lib4mesa15глКарта1FkddiiPdZv", биб);

		//вяжи(функция_53)("_D3lib4mesa15глКарта1FkffiiPfZv", биб);

		//вяжи(функция_54)("_D3lib4mesa15глКарта2FkddiiddiiPdZv", биб);

		//вяжи(функция_55)("_D3lib4mesa15глКарта2FkffiiffiiPfZv", биб);

		//вяжи(функция_56)("_D3lib4mesa16глБитмапFiiffffPhZv", биб);

		//вяжи(функция_57)("_D3lib4mesa16глБуфРисFkZv", биб);

		//вяжи(функция_58)("_D3lib4mesa16глВключиFkZv", биб);

		//вяжи(функция_59)("_D3lib4mesa16глВращайFffffZv", биб);

		//вяжи(функция_60)("_D3lib4mesa16глДайБулFkPhZv", биб);

		//вяжи(функция_61)("_D3lib4mesa16глДайДвоFkPdZv", биб);

		//вяжи(функция_62)("_D3lib4mesa16глДайЦелFkPiZv", биб);

		//вяжи(функция_63)("_D3lib4mesa16глИндексFfZv", биб);

		//вяжи(функция_64)("_D3lib4mesa16глИндексFhZv", биб);

		//вяжи(функция_65)("_D3lib4mesa16глИндексFiZv", биб);

		//вяжи(функция_66)("_D3lib4mesa16глИндексFPdZv", биб);

		//вяжи(функция_67)("_D3lib4mesa16глИндексFPfZv", биб);

		//вяжи(функция_68)("_D3lib4mesa16глИндексFPhZv", биб);

		//вяжи(функция_69)("_D3lib4mesa16глИндексFPiZv", биб);

		//вяжи(функция_70)("_D3lib4mesa16глИндексFPsZv", биб);

		//вяжи(функция_71)("_D3lib4mesa16глИндексFsZv", биб);

		//вяжи(функция_72)("_D3lib4mesa16глОчистиFkZv", биб);

		//вяжи(функция_73)("_D3lib4mesa16глуВидНаFdddddddddZv", биб);

		//вяжи(функция_74)("_D3lib4mesa16глутИницFPiPPaZv", биб);

		//вяжи(функция_75)("_D3lib4mesa17глуОрто2МFddddZv", биб);

		//вяжи(функция_76)("_D3lib4mesa18глВершинаFffffZv", биб);

		//вяжи(функция_77)("_D3lib4mesa18глВершинаFfffZv", биб);

		//вяжи(функция_78)("_D3lib4mesa18глВершинаFffZv", биб);

		//вяжи(функция_79)("_D3lib4mesa18глВершинаFiiiiZv", биб);

		//вяжи(функция_80)("_D3lib4mesa18глВершинаFiiiZv", биб);

		//вяжи(функция_81)("_D3lib4mesa18глВершинаFiiZv", биб);

		//вяжи(функция_82)("_D3lib4mesa18глВершинаFssssZv", биб);

		//вяжи(функция_83)("_D3lib4mesa18глВершинаFsssZv", биб);

		//вяжи(функция_84)("_D3lib4mesa18глВершинаFssZv", биб);

		//вяжи(функция_85)("_D3lib4mesa18глВращайдFddddZv", биб);

		//вяжи(функция_86)("_D3lib4mesa18глВыньИмяFZv", биб);

		//вяжи(функция_87)("_D3lib4mesa18глВьюпортFiiiiZv", биб);

		//вяжи(функция_88)("_D3lib4mesa18глГенТексFkkdZv", биб);

		//вяжи(функция_89)("_D3lib4mesa18глГенТексFkkfZv", биб);

		//вяжи(функция_90)("_D3lib4mesa18глГенТексFkkiZv", биб);

		//вяжи(функция_91)("_D3lib4mesa18глГенТексFkkPdZv", биб);

		//вяжи(функция_92)("_D3lib4mesa18глГенТексFkkPfZv", биб);

		//вяжи(функция_93)("_D3lib4mesa18глГенТексFkkPiZv", биб);

		//вяжи(функция_94)("_D3lib4mesa18глДайПлавFkPfZv", биб);

		//вяжи(функция_95)("_D3lib4mesa18глДайСветFkkPfZv", биб);

		//вяжи(функция_96)("_D3lib4mesa18глДайСветFkkPiZv", биб);

		//вяжи(функция_97)("_D3lib4mesa18глИндексдFdZv", биб);

		//вяжи(функция_98)("_D3lib4mesa18глНожницыFiiiiZv", биб);

		//вяжи(функция_99)("_D3lib4mesa18глНормальFfffZv", биб);

		//вяжи(функция_100)("_D3lib4mesa18глНормальFgggZv", биб);

		//вяжи(функция_101)("_D3lib4mesa18глНормальFiiiZv", биб);

		//вяжи(функция_102)("_D3lib4mesa18глНормальFPdZv", биб);

		//вяжи(функция_103)("_D3lib4mesa18глНормальFPfZv", биб);

		//вяжи(функция_104)("_D3lib4mesa18глНормальFPgZv", биб);

		//вяжи(функция_105)("_D3lib4mesa18глНормальFPiZv", биб);

		//вяжи(функция_106)("_D3lib4mesa18глНормальFPsZv", биб);

		//вяжи(функция_107)("_D3lib4mesa18глНормальFsssZv", биб);

		//вяжи(функция_108)("_D3lib4mesa18глОтключиFkZv", биб);

		//вяжи(функция_109)("_D3lib4mesa18глПропускFfZv", биб);

		//вяжи(функция_110)("_D3lib4mesa18глПрофильFkZv", биб);

		//вяжи(функция_111)("_D3lib4mesa18глПрямоугFffffZv", биб);

		//вяжи(функция_112)("_D3lib4mesa18глПрямоугFiiiiZv", биб);

		//вяжи(функция_113)("_D3lib4mesa18глПрямоугFPdPdZv", биб);

		//вяжи(функция_114)("_D3lib4mesa18глПрямоугFPfPfZv", биб);

		//вяжи(функция_115)("_D3lib4mesa18глПрямоугFPiPiZv", биб);

		//вяжи(функция_116)("_D3lib4mesa18глПрямоугFPsPsZv", биб);

		//вяжи(функция_117)("_D3lib4mesa18глПрямоугFssssZv", биб);

		//вяжи(функция_118)("_D3lib4mesa18глСуньИмяFkZv", биб);

		//вяжи(функция_119)("_D3lib4mesa18глуТкстОшFkZPa", биб);

		//вяжи(функция_120)("_D3lib4mesa19глВершина2FPdZv", биб);

		//вяжи(функция_121)("_D3lib4mesa19глВершина2FPfZv", биб);

		//вяжи(функция_122)("_D3lib4mesa19глВершина2FPiZv", биб);

		//вяжи(функция_123)("_D3lib4mesa19глВершина2FPsZv", биб);

		//вяжи(функция_124)("_D3lib4mesa19глВершина3FPdZv", биб);

		//вяжи(функция_125)("_D3lib4mesa19глВершина3FPfZv", биб);

		//вяжи(функция_126)("_D3lib4mesa19глВершина3FPiZv", биб);

		//вяжи(функция_127)("_D3lib4mesa19глВершина3FPsZv", биб);

		//вяжи(функция_128)("_D3lib4mesa19глВершина4FPdZv", биб);

		//вяжи(функция_129)("_D3lib4mesa19глВершина4FPfZv", биб);

		//вяжи(функция_130)("_D3lib4mesa19глВершина4FPiZv", биб);

		//вяжи(функция_131)("_D3lib4mesa19глВершина4FPsZv", биб);

		//вяжи(функция_132)("_D3lib4mesa20глВершинадFddddZv", биб);

		//вяжи(функция_133)("_D3lib4mesa20глВершинадFdddZv", биб);

		//вяжи(функция_134)("_D3lib4mesa20глВершинадFddZv", биб);

		//вяжи(функция_135)("_D3lib4mesa20глВыньМатрFZv", биб);

		//вяжи(функция_136)("_D3lib4mesa20глДайКартуFkkPdZv", биб);

		//вяжи(функция_137)("_D3lib4mesa20глДайКартуFkkPfZv", биб);

		//вяжи(функция_138)("_D3lib4mesa20глДайКартуFkkPiZv", биб);

		//вяжи(функция_139)("_D3lib4mesa20глДайТекстFkZPa", биб);

		//вяжи(функция_140)("_D3lib4mesa20глМатериалFkkfZv", биб);

		//вяжи(функция_141)("_D3lib4mesa20глМатериалFkkiZv", биб);

		//вяжи(функция_142)("_D3lib4mesa20глМатериалFkkPfZv", биб);

		//вяжи(функция_143)("_D3lib4mesa20глМатериалFkkPiZv", биб);

		//вяжи(функция_144)("_D3lib4mesa20глНормальдFdddZv", биб);

		//вяжи(функция_145)("_D3lib4mesa20глПеренесиFfffZv", биб);

		//вяжи(функция_146)("_D3lib4mesa20глПрямоугдFddddZv", биб);

		//вяжи(функция_147)("_D3lib4mesa20глСуньМатрFZv", биб);

		//вяжи(функция_148)("_D3lib4mesa20глУкНаЦветFikiPvZv", биб);

		//вяжи(функция_149)("_D3lib4mesa20глФлагКраяFhZv", биб);

		//вяжи(функция_150)("_D3lib4mesa20глФлагКраяFPhZv", биб);

		//вяжи(функция_151)("_D3lib4mesa20глФруструмFddddddZv", биб);

		//вяжи(функция_152)("_D3lib4mesa20глуДайТкстFkZPa", биб);

		//вяжи(функция_153)("_D3lib4mesa20глуКонКривFPS3lib4mesa8GLUnurbsZv", биб);

		//вяжи(функция_154)("_D3lib4mesa20глуЦилиндрFPS3lib4mesa10GLUquadricdddiiZv", биб);

		//вяжи(функция_155)("_D3lib4mesa21глОцениМеш1FkiiZv", биб);

		//вяжи(функция_156)("_D3lib4mesa21глОцениМеш2FkiiiiZv", биб);

		//вяжи(функция_157)("_D3lib4mesa21глСписок_лиFkZh", биб);

		//вяжи(функция_158)("_D3lib4mesa22глБуфЧтенияFkZv", биб);

		//вяжи(функция_159)("_D3lib4mesa22глВыньАтрибFZv", биб);

		//вяжи(функция_160)("_D3lib4mesa22глГенСпискиFiZk", биб);

		//вяжи(функция_161)("_D3lib4mesa22глДайОшибкуFZk", биб);

		//вяжи(функция_162)("_D3lib4mesa22глИницИменаFZv", биб);

		//вяжи(функция_163)("_D3lib4mesa22глКоордТексFffffZv", биб);

		//вяжи(функция_164)("_D3lib4mesa22глКоордТексFfffZv", биб);

		//вяжи(функция_165)("_D3lib4mesa22глКоордТексFffZv", биб);

		//вяжи(функция_166)("_D3lib4mesa22глКоордТексFfZv", биб);

		//вяжи(функция_167)("_D3lib4mesa22глКоордТексFiiiiZv", биб);

		//вяжи(функция_168)("_D3lib4mesa22глКоордТексFiiiZv", биб);

		//вяжи(функция_169)("_D3lib4mesa22глКоордТексFiiZv", биб);

		//вяжи(функция_170)("_D3lib4mesa22глКоордТексFiZv", биб);

		//вяжи(функция_171)("_D3lib4mesa22глКоордТексFssssZv", биб);

		//вяжи(функция_172)("_D3lib4mesa22глКоордТексFsssZv", биб);

		//вяжи(функция_173)("_D3lib4mesa22глКоордТексFssZv", биб);

		//вяжи(функция_174)("_D3lib4mesa22глКоордТексFsZv", биб);

		//вяжи(функция_175)("_D3lib4mesa22глМаскаДалиFhZv", биб);

		//вяжи(функция_176)("_D3lib4mesa22глНовСписокFkkZv", биб);

		//вяжи(функция_177)("_D3lib4mesa22глОваСпискаFkZv", биб);

		//вяжи(функция_178)("_D3lib4mesa22глОпШаблонаFkkkZv", биб);

		//вяжи(функция_179)("_D3lib4mesa22глПеренесидFdddZv", биб);

		//вяжи(функция_180)("_D3lib4mesa22глПодсказкаFkkZv", биб);

		//вяжи(функция_181)("_D3lib4mesa22глПозРастраFffffZv", биб);

		//вяжи(функция_182)("_D3lib4mesa22глПозРастраFfffZv", биб);

		//вяжи(функция_183)("_D3lib4mesa22глПозРастраFffZv", биб);

		//вяжи(функция_184)("_D3lib4mesa22глПозРастраFiiiiZv", биб);

		//вяжи(функция_185)("_D3lib4mesa22глПозРастраFiiiZv", биб);

		//вяжи(функция_186)("_D3lib4mesa22глПозРастраFiiZv", биб);

		//вяжи(функция_187)("_D3lib4mesa22глПозРастраFssssZv", биб);

		//вяжи(функция_188)("_D3lib4mesa22глПозРастраFsssZv", биб);

		//вяжи(функция_189)("_D3lib4mesa22глПозРастраFssZv", биб);

		//вяжи(функция_190)("_D3lib4mesa22глРежимМатрFkZv", биб);

		//вяжи(функция_191)("_D3lib4mesa22глСредаТексFkkfZv", биб);

		//вяжи(функция_192)("_D3lib4mesa22глСредаТексFkkiZv", биб);

		//вяжи(функция_193)("_D3lib4mesa22глСредаТексFkkPfZv", биб);

		//вяжи(функция_194)("_D3lib4mesa22глСредаТексFkkPiZv", биб);

		//вяжи(функция_195)("_D3lib4mesa22глСуньАтрибFkZv", биб);

		//вяжи(функция_196)("_D3lib4mesa22глФункцДалиFkZv", биб);

		//вяжи(функция_197)("_D3lib4mesa22глуКонОбрезFPS3lib4mesa8GLUnurbsZv", биб);

		//вяжи(функция_198)("_D3lib4mesa22глуПолуДискFPS3lib4mesa10GLUquadricddiiddZv", биб);

		//вяжи(функция_199)("_D3lib4mesa22глуПроекцияFdddPdPdPiPdPdPdZi", биб);

		//вяжи(функция_200)("_D3lib4mesa22глутДайМенюFZi", биб);

		//вяжи(функция_201)("_D3lib4mesa22глутДайОкноFZi", биб);

		//вяжи(функция_202)("_D3lib4mesa22глутДайСлойFkZi", биб);

		//вяжи(функция_203)("_D3lib4mesa22глутДайЦветFiiZf", биб);

		//вяжи(функция_204)("_D3lib4mesa23глВключен_лиFkZh", биб);

		//вяжи(функция_205)("_D3lib4mesa23глКоордТекс1FPdZv", биб);

		//вяжи(функция_206)("_D3lib4mesa23глКоордТекс1FPfZv", биб);

		//вяжи(функция_207)("_D3lib4mesa23глКоордТекс1FPiZv", биб);

		//вяжи(функция_208)("_D3lib4mesa23глКоордТекс1FPsZv", биб);

		//вяжи(функция_209)("_D3lib4mesa23глКоордТекс2FPdZv", биб);

		//вяжи(функция_210)("_D3lib4mesa23глКоордТекс2FPfZv", биб);

		//вяжи(функция_211)("_D3lib4mesa23глКоордТекс2FPiZv", биб);

		//вяжи(функция_212)("_D3lib4mesa23глКоордТекс2FPsZv", биб);

		//вяжи(функция_213)("_D3lib4mesa23глКоордТекс3FPdZv", биб);

		//вяжи(функция_214)("_D3lib4mesa23глКоордТекс3FPfZv", биб);

		//вяжи(функция_215)("_D3lib4mesa23глКоордТекс3FPiZv", биб);

		//вяжи(функция_216)("_D3lib4mesa23глКоордТекс3FPsZv", биб);

		//вяжи(функция_217)("_D3lib4mesa23глКоордТекс4FPdZv", биб);

		//вяжи(функция_218)("_D3lib4mesa23глКоордТекс4FPfZv", биб);

		//вяжи(функция_219)("_D3lib4mesa23глКоордТекс4FPiZv", биб);

		//вяжи(функция_220)("_D3lib4mesa23глКоордТекс4FPsZv", биб);

		//вяжи(функция_221)("_D3lib4mesa23глПозРастра2FPdZv", биб);

		//вяжи(функция_222)("_D3lib4mesa23глПозРастра2FPfZv", биб);

		//вяжи(функция_223)("_D3lib4mesa23глПозРастра2FPiZv", биб);

		//вяжи(функция_224)("_D3lib4mesa23глПозРастра2FPsZv", биб);

		//вяжи(функция_225)("_D3lib4mesa23глПозРастра3FPdZv", биб);

		//вяжи(функция_226)("_D3lib4mesa23глПозРастра3FPfZv", биб);

		//вяжи(функция_227)("_D3lib4mesa23глПозРастра3FPiZv", биб);

		//вяжи(функция_228)("_D3lib4mesa23глПозРастра3FPsZv", биб);

		//вяжи(функция_229)("_D3lib4mesa23глПозРастра4FPdZv", биб);

		//вяжи(функция_230)("_D3lib4mesa23глПозРастра4FPfZv", биб);

		//вяжи(функция_231)("_D3lib4mesa23глПозРастра4FPiZv", биб);

		//вяжи(функция_232)("_D3lib4mesa23глПозРастра4FPsZv", биб);

		//вяжи(функция_233)("_D3lib4mesa24глДайГенТексFkkPdZv", биб);

		//вяжи(функция_234)("_D3lib4mesa24глДайГенТексFkkPfZv", биб);

		//вяжи(функция_235)("_D3lib4mesa24глДайГенТексFkkPiZv", биб);

		//вяжи(функция_236)("_D3lib4mesa24глЗагрузиИмяFkZv", биб);

		//вяжи(функция_237)("_D3lib4mesa24глЗумПикселяFffZv", биб);

		//вяжи(функция_238)("_D3lib4mesa24глКоордТексдFddddZv", биб);

		//вяжи(функция_239)("_D3lib4mesa24глКоордТексдFdddZv", биб);

		//вяжи(функция_240)("_D3lib4mesa24глКоордТексдFddZv", биб);

		//вяжи(функция_241)("_D3lib4mesa24глКоордТексдFdZv", биб);

		//вяжи(функция_242)("_D3lib4mesa24глМаскаЦветаFhhhhZv", биб);

		//вяжи(функция_243)("_D3lib4mesa24глМодельТениFkZv", биб);

		//вяжи(функция_244)("_D3lib4mesa24глОчистиДальFdZv", биб);

		//вяжи(функция_245)("_D3lib4mesa24глПозРастрадFddddZv", биб);

		//вяжи(функция_246)("_D3lib4mesa24глПозРастрадFdddZv", биб);

		//вяжи(функция_247)("_D3lib4mesa24глПозРастрадFddZv", биб);

		//вяжи(функция_248)("_D3lib4mesa24глУкНаИндексFkiPvZv", биб);

		//вяжи(функция_249)("_D3lib4mesa24глУмножьМатрFPdZv", биб);

		//вяжи(функция_250)("_D3lib4mesa24глУмножьМатрFPfZv", биб);

		//вяжи(функция_251)("_D3lib4mesa24глФункцАльфыFkfZv", биб);

		//вяжи(функция_252)("_D3lib4mesa24глФункцСмесиFkkZv", биб);

		//вяжи(функция_253)("_D3lib4mesa24глуНовыйТессFZPS3lib4mesa13GLUtesselator", биб);

		//вяжи(функция_254)("_D3lib4mesa24глуУдалиТессFPS3lib4mesa13GLUtesselatorZv", биб);

		//вяжи(функция_255)("_D3lib4mesa24глутВыньОкноFZv", биб);

		//вяжи(функция_256)("_D3lib4mesa24глутСуньОкноFZv", биб);

		//вяжи(функция_257)("_D3lib4mesa24глутУкНаВарпFiiZv", биб);

		//вяжи(функция_258)("_D3lib4mesa25глОбразТекс2МFkiiiiikkPvZv", биб);

		//вяжи(функция_259)("_D3lib4mesa25глОцениКоорд1FdZv", биб);

		//вяжи(функция_260)("_D3lib4mesa25глОцениКоорд1FfZv", биб);

		//вяжи(функция_261)("_D3lib4mesa25глОцениКоорд1FPdZv", биб);

		//вяжи(функция_262)("_D3lib4mesa25глОцениКоорд1FPfZv", биб);

		//вяжи(функция_263)("_D3lib4mesa25глОцениКоорд2FddZv", биб);

		//вяжи(функция_264)("_D3lib4mesa25глОцениКоорд2FffZv", биб);

		//вяжи(функция_265)("_D3lib4mesa25глОцениКоорд2FPdZv", биб);

		//вяжи(функция_266)("_D3lib4mesa25глОцениКоорд2FPfZv", биб);

		//вяжи(функция_267)("_D3lib4mesa25глОцениТочку1FiZv", биб);

		//вяжи(функция_268)("_D3lib4mesa25глОцениТочку2FiiZv", биб);

		//вяжи(функция_269)("_D3lib4mesa25глСеткаКарты1FiddZv", биб);

		//вяжи(функция_270)("_D3lib4mesa25глСеткаКарты1FiffZv", биб);

		//вяжи(функция_271)("_D3lib4mesa25глСеткаКарты2FiddiddZv", биб);

		//вяжи(функция_272)("_D3lib4mesa25глСеткаКарты2FiffiffZv", биб);

		//вяжи(функция_273)("_D3lib4mesa25глТекстура_лиFkZh", биб);

		//вяжи(функция_274)("_D3lib4mesa26глВыбериБуферFiPkZv", биб);

		//вяжи(функция_275)("_D3lib4mesa26глГенТекстурыFiPkZv", биб);

		//вяжи(функция_276)("_D3lib4mesa26глДайМатериалFkkPfZv", биб);

		//вяжи(функция_277)("_D3lib4mesa26глДайМатериалFkkPiZv", биб);

		//вяжи(функция_278)("_D3lib4mesa26глЗагрузиМатрFPdZv", биб);

		//вяжи(функция_279)("_D3lib4mesa26глЗагрузиМатрFPfZv", биб);

		//вяжи(функция_280)("_D3lib4mesa26глКонецСпискаFZv", биб);

		//вяжи(функция_281)("_D3lib4mesa26глМасштабируйFfffZv", биб);

		//вяжи(функция_282)("_D3lib4mesa26глМодельСветаFkfZv", биб);

		//вяжи(функция_283)("_D3lib4mesa26глМодельСветаFkiZv", биб);

		//вяжи(функция_284)("_D3lib4mesa26глМодельСветаFkPfZv", биб);

		//вяжи(функция_285)("_D3lib4mesa26глМодельСветаFkPiZv", биб);

		//вяжи(функция_286)("_D3lib4mesa26глОчистиАккумFffffZv", биб);

		//вяжи(функция_287)("_D3lib4mesa26глРазмерТочкиFfZv", биб);

		//вяжи(функция_288)("_D3lib4mesa26глУдалиСпискиFkiZv", биб);

		//вяжи(функция_289)("_D3lib4mesa26глУкНаВершинуFikiPvZv", биб);

		//вяжи(функция_290)("_D3lib4mesa26глУкНаНормальFkiPvZv", биб);

		//вяжи(функция_291)("_D3lib4mesa26глЦветОчисткиFffffZv", биб);

		//вяжи(функция_292)("_D3lib4mesa26глШиринаЛинииFfZv", биб);

		//вяжи(функция_293)("_D3lib4mesa26глуКонМногоугFPS3lib4mesa13GLUtesselatorZv", биб);

		//вяжи(функция_294)("_D3lib4mesa26глуКонПоверхнFPS3lib4mesa8GLUnurbsZv", биб);

		//вяжи(функция_295)("_D3lib4mesa26глуКриваяНурбFPS3lib4mesa8GLUnurbsiPfiPfikZv", биб);

		//вяжи(функция_296)("_D3lib4mesa26глуНачниОбрезFPS3lib4mesa8GLUnurbsZv", биб);

		//вяжи(функция_297)("_D3lib4mesa26глуУдалиКвадрFPS3lib4mesa10GLUquadricZv", биб);

		//вяжи(функция_298)("_D3lib4mesa26глутПерепоказFZv", биб);

		//вяжи(функция_299)("_D3lib4mesa26глутФункцМышиFPUiiiiZvZv", биб);

		//вяжи(функция_300)("_D3lib4mesa27глОбразТекст1МFkiiiikkPvZv", биб);

		//вяжи(функция_301)("_D3lib4mesa28глБуферФидбэкаFikPfZv", биб);

		//вяжи(функция_302)("_D3lib4mesa28глВызовиСпискиFikPvZv", биб);

		//вяжи(функция_303)("_D3lib4mesa28глВызовиСписокFkZv", биб);

		//вяжи(функция_304)("_D3lib4mesa28глДайОбразТексFkikkPvZv", биб);

		//вяжи(функция_305)("_D3lib4mesa28глДайСредуТексFkkPfZv", биб);

		//вяжи(функция_306)("_D3lib4mesa28глДайСредуТексFkkPiZv", биб);

		//вяжи(функция_307)("_D3lib4mesa28глДиапазонДалиFddZv", биб);

		//вяжи(функция_308)("_D3lib4mesa28глЗагрузиИдентFZv", биб);

		//вяжи(функция_309)("_D3lib4mesa28глЛогическаяОпFkZv", биб);

		//вяжи(функция_310)("_D3lib4mesa28глМаскаИндексаFkZv", биб);

		//вяжи(функция_311)("_D3lib4mesa28глМаскаШаблонаFkZv", биб);

		//вяжи(функция_312)("_D3lib4mesa28глМасштабируйдFdddZv", биб);

		//вяжи(функция_313)("_D3lib4mesa28глОчистиИндексFfZv", биб);

		//вяжи(функция_314)("_D3lib4mesa28глОчистиШаблонFiZv", биб);

		//вяжи(функция_315)("_D3lib4mesa28глПараметрТексFkkfZv", биб);

		//вяжи(функция_316)("_D3lib4mesa28глПараметрТексFkkiZv", биб);

		//вяжи(функция_317)("_D3lib4mesa28глПараметрТексFkkPfZv", биб);

		//вяжи(функция_318)("_D3lib4mesa28глПараметрТексFkkPiZv", биб);

		//вяжи(функция_319)("_D3lib4mesa28глПолоскаЛинийFitZv", биб);

		//вяжи(функция_320)("_D3lib4mesa28глРежимМногоугFkkZv", биб);

		//вяжи(функция_321)("_D3lib4mesa28глРисуйМассивыFkiiZv", биб);

		//вяжи(функция_322)("_D3lib4mesa28глРисуйПикселиFiikkPvZv", биб);

		//вяжи(функция_323)("_D3lib4mesa28глУкНаФлагКраяFiPvZv", биб);

		//вяжи(функция_324)("_D3lib4mesa28глФункцШаблонаFkikZv", биб);

		//вяжи(функция_325)("_D3lib4mesa28глЧитайПикселиFiiiikkPvZv", биб);

		//вяжи(функция_326)("_D3lib4mesa28глуНачниКривуюFPS3lib4mesa8GLUnurbsZv", биб);

		//вяжи(функция_327)("_D3lib4mesa28глуПерспективаFddddZv", биб);

		//вяжи(функция_328)("_D3lib4mesa28глуСледщКонтурFPS3lib4mesa13GLUtesselatorkZv", биб);

		//вяжи(функция_329)("_D3lib4mesa28глуТессВершинаFPS3lib4mesa13GLUtesselatorPdPvZv", биб);

		//вяжи(функция_330)("_D3lib4mesa28глуТессНормальFPS3lib4mesa13GLUtesselatordddZv", биб);

		//вяжи(функция_331)("_D3lib4mesa28глутПлотныйКубFdZv", биб);

		//вяжи(функция_332)("_D3lib4mesa28глутПлотныйТорFddiiZv", биб);

		//вяжи(функция_333)("_D3lib4mesa28глутПокажиОкноFZv", биб);

		//вяжи(функция_334)("_D3lib4mesa28глутСверниОкноFZv", биб);

		//вяжи(функция_335)("_D3lib4mesa28глутСоздайМенюFPUiZvZi", биб);

		//вяжи(функция_336)("_D3lib4mesa28глутСоздайОкноFPaZi", биб);

		//вяжи(функция_337)("_D3lib4mesa28глутСпрячьОкноFZv", биб);

		//вяжи(функция_338)("_D3lib4mesa30глМатериалЦветаFkkZv", биб);

		//вяжи(функция_339)("_D3lib4mesa30глРисуйЭлементыFkikPvZv", биб);

		//вяжи(функция_340)("_D3lib4mesa30глУдалиТекстурыFiPkZv", биб);

		//вяжи(функция_341)("_D3lib4mesa30глУкНаКоордТексFikiPvZv", биб);

		//вяжи(функция_342)("_D3lib4mesa30глуКвадрНормалиFPS3lib4mesa10GLUquadrickZv", биб);

		//вяжи(функция_343)("_D3lib4mesa30глуНачниМногоугFPS3lib4mesa13GLUtesselatorZv", биб);

		//вяжи(функция_344)("_D3lib4mesa30глуНовыйКвадрикFZPS3lib4mesa10GLUquadric", биб);

		//вяжи(функция_345)("_D3lib4mesa30глуОбрвызовТессFPS3lib4mesa13GLUtesselatorkPUZvZv", биб);

		//вяжи(функция_346)("_D3lib4mesa30глуСвойствоНурбFPS3lib4mesa8GLUnurbskfZv", биб);

		//вяжи(функция_347)("_D3lib4mesa30глуТессСвойствоFPS3lib4mesa13GLUtesselatorkdZv", биб);

		//вяжи(функция_348)("_D3lib4mesa30глутГлавныйЦиклFZv", биб);

		//вяжи(функция_349)("_D3lib4mesa30глутДлинаБитмапFPvPaZi", биб);

		//вяжи(функция_350)("_D3lib4mesa30глутДлинаШтрихаFPvPaZi", биб);

		//вяжи(функция_351)("_D3lib4mesa30глутИницПозОкнаFiiZv", биб);

		//вяжи(функция_352)("_D3lib4mesa30глутОткрепиМенюFiZv", биб);

		//вяжи(функция_353)("_D3lib4mesa30глутПолныйЭкранFZv", биб);

		//вяжи(функция_354)("_D3lib4mesa30глутПоместиОкноFiiZv", биб);

		//вяжи(функция_355)("_D3lib4mesa30глутРазрушьМенюFiZv", биб);

		//вяжи(функция_356)("_D3lib4mesa30глутРазрушьОкноFiZv", биб);

		//вяжи(функция_357)("_D3lib4mesa30глутФункцПоказаFPUZvZv", биб);

		//вяжи(функция_358)("_D3lib4mesa31глПодобразТекс2МFkiiiiikkPvZv", биб);

		//вяжи(функция_359)("_D3lib4mesa32глКопируйПикселиFiiiikZv", биб);

		//вяжи(функция_360)("_D3lib4mesa32глПолоскаМногоугFPhZv", биб);

		//вяжи(функция_361)("_D3lib4mesa32глСохраниПиксельFkfZv", биб);

		//вяжи(функция_362)("_D3lib4mesa32глСохраниПиксельFkiZv", биб);

		//вяжи(функция_363)("_D3lib4mesa32глЭлементМассиваFiZv", биб);

		//вяжи(функция_364)("_D3lib4mesa32глуКвадрТекстураFPS3lib4mesa10GLUquadricbZv", биб);

		//вяжи(функция_365)("_D3lib4mesa32глуОбрвызовНурбсFPS3lib4mesa8GLUnurbskPUZvZv", биб);

		//вяжи(функция_366)("_D3lib4mesa32глутДайРежимИгрыFkZi", биб);

		//вяжи(функция_367)("_D3lib4mesa32глутКаркасныйКубFdZv", биб);

		//вяжи(функция_368)("_D3lib4mesa32глутКаркасныйТорFddiiZv", биб);

		//вяжи(функция_369)("_D3lib4mesa32глутОбменБуферовFZv", биб);

		//вяжи(функция_370)("_D3lib4mesa32глутПанируйВидеоFiiiiZv", биб);

		//вяжи(функция_371)("_D3lib4mesa32глутПлотнаяСфераFdiiZv", биб);

		//вяжи(функция_372)("_D3lib4mesa32глутПлотныйКонусFddiiZv", биб);

		//вяжи(функция_373)("_D3lib4mesa32глутПрикрепиМенюFiZv", биб);

		//вяжи(функция_374)("_D3lib4mesa32глутСимволБитмапFPviZv", биб);

		//вяжи(функция_375)("_D3lib4mesa32глутСимволШтрихаFPviZv", биб);

		//вяжи(функция_376)("_D3lib4mesa32глутУстановиМенюFiZv", биб);

		//вяжи(функция_377)("_D3lib4mesa32глутУстановиОкноFiZv", биб);

		//вяжи(функция_378)("_D3lib4mesa32глутУстановиЦветFifffZv", биб);

		//вяжи(функция_379)("_D3lib4mesa32глутФункцТаймераFiPUiZviZv", биб);

		//вяжи(функция_380)("_D3lib4mesa32глутФункцияВводаFPUiZvZv", биб);

		//вяжи(функция_381)("_D3lib4mesa32глутШиринаБитмапFPviZi", биб);

		//вяжи(функция_382)("_D3lib4mesa32глутШиринаШтрихаFPviZi", биб);

		//вяжи(функция_383)("_D3lib4mesa33глПодобразТекст1МFkiiikkPvZv", биб);

		//вяжи(функция_384)("_D3lib4mesa34глДайКартуПикселяFkPfZv", биб);

		//вяжи(функция_385)("_D3lib4mesa34глДайКартуПикселяFkPkZv", биб);

		//вяжи(функция_386)("_D3lib4mesa34глДайКартуПикселяFkPtZv", биб);

		//вяжи(функция_387)("_D3lib4mesa34глДайПараметрТексFkkPfZv", биб);

		//вяжи(функция_388)("_D3lib4mesa34глДайПараметрТексFkkPiZv", биб);

		//вяжи(функция_389)("_D3lib4mesa34глКартируйПиксельFkiPfZv", биб);

		//вяжи(функция_390)("_D3lib4mesa34глКартируйПиксельFkiPkZv", биб);

		//вяжи(функция_391)("_D3lib4mesa34глКартируйПиксельFkiPtZv", биб);

		//вяжи(функция_392)("_D3lib4mesa34глПривяжиТекстуруFkkZv", биб);

		//вяжи(функция_393)("_D3lib4mesa34глСмещениеМногоугFffZv", биб);

		//вяжи(функция_394)("_D3lib4mesa34глуОбрвызовКвадраFPS3lib4mesa10GLUquadrickPUZvZv", биб);

		//вяжи(функция_395)("_D3lib4mesa34глуПодбериМатрицуFddddPiZv", биб);

		//вяжи(функция_396)("_D3lib4mesa34глутДайУстройствоFkZi", биб);

		//вяжи(функция_397)("_D3lib4mesa34глутДобавьПодменюFPaiZv", биб);

		//вяжи(функция_398)("_D3lib4mesa34глутИницТекстОкнаFPaZv", биб);

		//вяжи(функция_399)("_D3lib4mesa34глутИспользуйСлойFkZv", биб);

		//вяжи(функция_400)("_D3lib4mesa34глутОсобаяФункцияFPUiiiZvZv", биб);

		//вяжи(функция_401)("_D3lib4mesa34глутПеремерьВидеоFiiiiZv", биб);

		//вяжи(функция_402)("_D3lib4mesa34глутПерепоказОкнаFiZv", биб);

		//вяжи(функция_403)("_D3lib4mesa34глутПерерисуйОкноFiiZv", биб);

		//вяжи(функция_404)("_D3lib4mesa34глутПлотныйЧайникFdZv", биб);

		//вяжи(функция_405)("_D3lib4mesa34глутСкройНакладкуFZv", биб);

		//вяжи(функция_406)("_D3lib4mesa34глутСоздайПодокноFiiiiiZi", биб);

		//вяжи(функция_407)("_D3lib4mesa34глутУдалиНакладкуFZv", биб);

		//вяжи(функция_408)("_D3lib4mesa34глутФункцДвиженияFPUiiZvZv", биб);

		//вяжи(функция_409)("_D3lib4mesa36глВыньАтрибКлиентаFZv", биб);

		//вяжи(функция_410)("_D3lib4mesa36глПереместиПиксельFkfZv", биб);

		//вяжи(функция_411)("_D3lib4mesa36глПереместиПиксельFkiZv", биб);

		//вяжи(функция_412)("_D3lib4mesa36глРежимОтображенияFkZi", биб);

		//вяжи(функция_413)("_D3lib4mesa36глСуньАтрибКлиентаFkZv", биб);

		//вяжи(функция_414)("_D3lib4mesa36глуДайСвойствоНурбFPS3lib4mesa8GLUnurbskPfZv", биб);

		//вяжи(функция_415)("_D3lib4mesa36глуДайСвойствоТессFPS3lib4mesa13GLUtesselatorkPdZv", биб);

		//вяжи(функция_416)("_D3lib4mesa36глуКвадрОриентацияFPS3lib4mesa10GLUquadrickZv", биб);

		//вяжи(функция_417)("_D3lib4mesa36глуПоверхностьНурбFPS3lib4mesa8GLUnurbsiPfiPfiiPfiikZv", биб);

		//вяжи(функция_418)("_D3lib4mesa36глуТессНачниКонтурFPS3lib4mesa13GLUtesselatorZv", биб);

		//вяжи(функция_419)("_D3lib4mesa36глутИницРазмерОкнаFiiZv", биб);

		//вяжи(функция_420)("_D3lib4mesa36глутКаркаснаяСфераFdiiZv", биб);

		//вяжи(функция_421)("_D3lib4mesa36глутКаркасныйКонусFddiiZv", биб);

		//вяжи(функция_422)("_D3lib4mesa36глутОтчётОбОшибкахFZv", биб);

		//вяжи(функция_423)("_D3lib4mesa36глутПлотныйОктаэдрFZv", биб);

		//вяжи(функция_424)("_D3lib4mesa36глутПокажиНакладкуFZv", биб);

		//вяжи(функция_425)("_D3lib4mesa36глутУстановиКурсорFiZv", биб);

		//вяжи(функция_426)("_D3lib4mesa36глутФункцАбонентовFPUiiZvZv", биб);

		//вяжи(функция_427)("_D3lib4mesa36глутФункцВидимостиFPUiZvZv", биб);

		//вяжи(функция_428)("_D3lib4mesa36глутФункцДжойстикаFPUkiiiZviZv", биб);

		//вяжи(функция_429)("_D3lib4mesa37глуПострой1ММипмапыFkiikkPvZi", биб);

		//вяжи(функция_430)("_D3lib4mesa37глуПострой2ММипмапыFiiiikkPvZi", биб);

		//вяжи(функция_431)("_D3lib4mesa37глуПострой3ММипмапыFkiiiikkPvZi", биб);

		//вяжи(функция_432)("_D3lib4mesa38глДайПолоскуМногоугFPhZv", биб);

		//вяжи(функция_433)("_D3lib4mesa38глОПлоскостьОбрезкиFkPdZv", биб);

		//вяжи(функция_434)("_D3lib4mesa38глСовместныеМассивыFkiPvZv", биб);

		//вяжи(функция_435)("_D3lib4mesa38глуНачниПоверхностьFPS3lib4mesa8GLUnurbsZv", биб);

		//вяжи(функция_436)("_D3lib4mesa38глутВойдиВРежимИгрыFZi", биб);

		//вяжи(функция_437)("_D3lib4mesa38глутДайМодификаторыFZi", биб);

		//вяжи(функция_438)("_D3lib4mesa38глутДайПеремерВидеоFkZi", биб);

		//вяжи(функция_439)("_D3lib4mesa38глутИницРежимПоказаFkZv", биб);

		//вяжи(функция_440)("_D3lib4mesa38глутКаркасныйЧайникFdZv", биб);

		//вяжи(функция_441)("_D3lib4mesa38глутПерейдиВПодменюFiPaiZv", биб);

		//вяжи(функция_442)("_D3lib4mesa38глутПлотныйИкосаэдрFZv", биб);

		//вяжи(функция_443)("_D3lib4mesa38глутПлотныйТетраэдрFZv", биб);

		//вяжи(функция_444)("_D3lib4mesa38глутПокиньРежимИгрыFZv", биб);

		//вяжи(функция_445)("_D3lib4mesa38глутТекстРежимаИгрыFPaZv", биб);

		//вяжи(функция_446)("_D3lib4mesa38глутУстановиЗагОкнаFPaZv", биб);

		//вяжи(функция_447)("_D3lib4mesa38глутУстановиЗагПиктFPaZv", биб);

		//вяжи(функция_448)("_D3lib4mesa38глутФункцКлавиатурыFPUaiiZvZv", биб);

		//вяжи(функция_449)("_D3lib4mesa38глутФункцОкнаКнопкиFPUiiZvZv", биб);

		//вяжи(функция_450)("_D3lib4mesa39глКопируйОбразТекс1МFkikiiiiZv", биб);

		//вяжи(функция_451)("_D3lib4mesa40глПриоритетТекстурамFiPkPfZv", биб);

		//вяжи(функция_452)("_D3lib4mesa40глуПроверьРасширениеFPaPaZh", биб);

		//вяжи(функция_453)("_D3lib4mesa40глуТессЗавершиКонтурFPS3lib4mesa13GLUtesselatorZv", биб);

		//вяжи(функция_454)("_D3lib4mesa40глутДобавьЗаписьМенюFPaiZv", биб);

		//вяжи(функция_455)("_D3lib4mesa40глутКаркасныйОктаэдрFZv", биб);

		//вяжи(функция_456)("_D3lib4mesa40глутПлотныйДодекаэдрFZv", биб);

		//вяжи(функция_457)("_D3lib4mesa40глутУдалиЭлементМенюFiZv", биб);

		//вяжи(функция_458)("_D3lib4mesa40глутУстановиНакладкуFZv", биб);

		//вяжи(функция_459)("_D3lib4mesa40глутФункцБездействияFPUZvZv", биб);

		//вяжи(функция_460)("_D3lib4mesa40глутФункцПерерисовкиFPUiiZvZv", биб);

		//вяжи(функция_461)("_D3lib4mesa40глутФункцСтатусаМенюFPUiiiZvZv", биб);

		//вяжи(функция_462)("_D3lib4mesa40глутФункцСтатусаОкнаFPUiZvZv", биб);

		//вяжи(функция_463)("_D3lib4mesa41глКопируйОбразТекст2МFkikiiiiiZv", биб);

		//вяжи(функция_464)("_D3lib4mesa42глДайПлоскостьОбрезкиFkPdZv", биб);

		//вяжи(функция_465)("_D3lib4mesa42глуТессНачниМногогранFPS3lib4mesa13GLUtesselatorPvZv", биб);

		//вяжи(функция_466)("_D3lib4mesa42глутКаркасныйИкосаэдрFZv", биб);

		//вяжи(функция_467)("_D3lib4mesa42глутКаркасныйТетраэдрFZv", биб);

		//вяжи(функция_468)("_D3lib4mesa42глутКопируйЦветокартуFiZv", биб);

		//вяжи(функция_469)("_D3lib4mesa42глутПерепоказНакладкиFZv", биб);

		//вяжи(функция_470)("_D3lib4mesa42глутФункцКнопкиТаблетFPUiiiiZvZv", биб);

		//вяжи(функция_471)("_D3lib4mesa44глуДанныеОбрвызоваНурбFPS3lib4mesa8GLUnurbsPvZv", биб);

		//вяжи(функция_472)("_D3lib4mesa44глуКвадрСтильРисованияFPS3lib4mesa10GLUquadrickZv", биб);

		//вяжи(функция_473)("_D3lib4mesa44глутКаркасныйДодекаэдрFZv", биб);

		//вяжи(функция_474)("_D3lib4mesa44глутОсобаяФункцОтжатияFPUiiiZvZv", биб);

		//вяжи(функция_475)("_D3lib4mesa44глутПерейдиВЗаписьМенюFiPaiZv", биб);

		//вяжи(функция_476)("_D3lib4mesa44глутФункцСостоянияМенюFPUiZvZv", биб);

		//вяжи(функция_477)("_D3lib4mesa45глКопируйПодобразТекс1МFkiiiiiZv", биб);

		//вяжи(функция_478)("_D3lib4mesa45глКопируйПодобразТекс2МFkiiiiiiiZv", биб);

		//вяжи(функция_479)("_D3lib4mesa45глРезидентныТекстуры_лиFiPkPhZh", биб);

		//вяжи(функция_480)("_D3lib4mesa46глДайПараметрУровняТексFkikPfZv", биб);

		//вяжи(функция_481)("_D3lib4mesa46глДайПараметрУровняТексFkikPiZv", биб);

		//вяжи(функция_482)("_D3lib4mesa46глуТессЗавершиМногогранFPS3lib4mesa13GLUtesselatorZv", биб);

		//вяжи(функция_483)("_D3lib4mesa46глутФункцДвиженияТаблетFPUiiZvZv", биб);

		//вяжи(функция_484)("_D3lib4mesa46глутФункцОтжатияКлавишиFPUaiiZvZv", биб);

		//вяжи(функция_485)("_D3lib4mesa46глутФункцПоказаНакладкиFPUZvZv", биб);

		//вяжи(функция_486)("_D3lib4mesa47глуПострой1МУровниМипмапFkiikkiiiPvZi", биб);

		//вяжи(функция_487)("_D3lib4mesa47глуПострой3МУровниМипмапFkiiiikkiiiPvZi", биб);

		//вяжи(функция_488)("_D3lib4mesa48глВключиСостояниеКлиентаFkZv", биб);

		//вяжи(функция_489)("_D3lib4mesa48глуНовыйОтобразительНурбFZPS3lib4mesa8GLUnurbs", биб);

		//вяжи(функция_490)("_D3lib4mesa48глуУдалиОтобразительНурбFPS3lib4mesa8GLUnurbsZv", биб);

		//вяжи(функция_491)("_D3lib4mesa48глутОстановиПеремерВидеоFZv", биб);

		//вяжи(функция_492)("_D3lib4mesa48глутУстановиПеремерВидеоFZv", биб);

		//вяжи(функция_493)("_D3lib4mesa49глуПострой2МУровениМипмапFiiiikkiiiPvZi", биб);

		//вяжи(функция_494)("_D3lib4mesa50глОтключиСостояниеКлиентаFkZv", биб);

		//вяжи(функция_495)("_D3lib4mesa50глуДанныеОбрвызоваНурбДОПFPS3lib4mesa8GLUnurbsPvZv", биб);

		//вяжи(функция_496)("_D3lib4mesa50глутПерепоказНакладкиОкнаFiZv", биб);

		//вяжи(функция_497)("_D3lib4mesa50глутУстановиПовторКлавишиFiZv", биб);

		//вяжи(функция_498)("_D3lib4mesa52глуЗагрузиМатрицыСемплингаFPS3lib4mesa8GLUnurbsPfPfPiZv", биб);

		//вяжи(функция_499)("_D3lib4mesa52глутИгнорируйПовторКлавишиFiZv", биб);

		//вяжи(функция_500)("_D3lib4mesa52глутФорсируйФункцДжойстикаFZv", биб);

		//вяжи(функция_501)("_D3lib4mesa56глутПоддерживаемыеРасширенияFPaZi", биб);

		//вяжи(функция_502)("_D3lib4mesa56глутФункцКнопкаНебесногоТелаFPUiiZvZv", биб);

		//вяжи(функция_503)("_D3lib4mesa58глутФункцияПассивногоДвиженияFPUiiZvZv", биб);

		//вяжи(функция_504)("_D3lib4mesa60глутФункцВращенияНебесногоТелаFPUiiiZvZv", биб);

		//вяжи(функция_505)("_D3lib4mesa60глутФункцДвиженияНебесногоТелаFPUiiiZvZv", биб);

		//вяжи(функция_506)("_D3lib4mesa12глОртоFddddddZv", биб);

		//вяжи(функция_507)("_D3lib4mesa12глСветFkkfZv", биб);

		//вяжи(функция_508)("_D3lib4mesa12глСветFkkiZv", биб);

		//вяжи(функция_509)("_D3lib4mesa12глСветFkkPfZv", биб);

		//вяжи(функция_510)("_D3lib4mesa12глСветFkkPiZv", биб);

		//вяжи(функция_511)("_D3lib4mesa12глСлейFZv", биб);

		//вяжи(функция_512)("_D3lib4mesa12глСтопFZv", биб);

		//вяжи(функция_513)("_D3lib4mesa12глЦветFffffZv", биб);

		//вяжи(функция_514)("_D3lib4mesa12глЦветFfffZv", биб);

		//вяжи(функция_515)("_D3lib4mesa12глЦветFggggZv", биб);

		//вяжи(функция_516)("_D3lib4mesa12глЦветFgggZv", биб);

		//вяжи(функция_517)("_D3lib4mesa12глЦветFhhhhZv", биб);

		//вяжи(функция_518)("_D3lib4mesa12глЦветFhhhZv", биб);

		//вяжи(функция_519)("_D3lib4mesa12глЦветFiiiiZv", биб);

		//вяжи(функция_520)("_D3lib4mesa12глЦветFiiiZv", биб);

		//вяжи(функция_521)("_D3lib4mesa12глЦветFkkkkZv", биб);

		//вяжи(функция_522)("_D3lib4mesa12глЦветFkkkZv", биб);

		//вяжи(функция_523)("_D3lib4mesa12глЦветFssssZv", биб);

		//вяжи(функция_524)("_D3lib4mesa12глЦветFsssZv", биб);

		//вяжи(функция_525)("_D3lib4mesa12глЦветFttttZv", биб);

		//вяжи(функция_526)("_D3lib4mesa12глЦветFtttZv", биб);

		//вяжи(функция_527)("_D3lib4mesa12глуШарFPS3lib4mesa10GLUquadricdiiZv", биб);

		//вяжи(функция_528)("_D3lib4mesa13глЦвет3FPdZv", биб);

		//вяжи(функция_529)("_D3lib4mesa13глЦвет3FPfZv", биб);

		//вяжи(функция_530)("_D3lib4mesa13глЦвет3FPgZv", биб);

		//вяжи(функция_531)("_D3lib4mesa13глЦвет3FPhZv", биб);

		//вяжи(функция_532)("_D3lib4mesa13глЦвет3FPiZv", биб);

		//вяжи(функция_533)("_D3lib4mesa13глЦвет3FPkZv", биб);

		//вяжи(функция_534)("_D3lib4mesa13глЦвет3FPsZv", биб);

		//вяжи(функция_535)("_D3lib4mesa13глЦвет3FPtZv", биб);

		//вяжи(функция_536)("_D3lib4mesa13глЦвет4FPdZv", биб);

		//вяжи(функция_537)("_D3lib4mesa13глЦвет4FPfZv", биб);

		//вяжи(функция_538)("_D3lib4mesa13глЦвет4FPgZv", биб);

		//вяжи(функция_539)("_D3lib4mesa13глЦвет4FPhZv", биб);

		//вяжи(функция_540)("_D3lib4mesa13глЦвет4FPiZv", биб);

		//вяжи(функция_541)("_D3lib4mesa13глЦвет4FPkZv", биб);

		//вяжи(функция_542)("_D3lib4mesa13глЦвет4FPsZv", биб);

		//вяжи(функция_543)("_D3lib4mesa13глЦвет4FPtZv", биб);

		//вяжи(функция_544)("_D3lib4mesa14глАккумFkfZv", биб);

		//вяжи(функция_545)("_D3lib4mesa14глДайУкFkPPvZv", биб);

		//вяжи(функция_546)("_D3lib4mesa14глНачниFkZv", биб);

		//вяжи(функция_547)("_D3lib4mesa14глТуманFkfZv", биб);

		//вяжи(функция_548)("_D3lib4mesa14глТуманFkiZv", биб);

		//вяжи(функция_549)("_D3lib4mesa14глТуманFkPfZv", биб);

		//вяжи(функция_550)("_D3lib4mesa14глТуманFkPiZv", биб);

		//вяжи(функция_551)("_D3lib4mesa14глФинишFZv", биб);

		//вяжи(функция_552)("_D3lib4mesa14глЦветдFddddZv", биб);

		//вяжи(функция_553)("_D3lib4mesa14глЦветдFdddZv", биб);

		//вяжи(функция_554)("_D3lib4mesa14глуДискFPS3lib4mesa10GLUquadricddiiZv", биб);

		//вяжи(функция_555)("_D3lib4mesa14глутДайFkZi", биб);

		//вяжи(функция_556)("_D3lib4mesa15глКарта1FkddiiPdZv", биб);

		//вяжи(функция_557)("_D3lib4mesa15глКарта1FkffiiPfZv", биб);

		//вяжи(функция_558)("_D3lib4mesa15глКарта2FkddiiddiiPdZv", биб);

		//вяжи(функция_559)("_D3lib4mesa15глКарта2FkffiiffiiPfZv", биб);

		//вяжи(функция_560)("_D3lib4mesa16глБитмапFiiffffPhZv", биб);

		//вяжи(функция_561)("_D3lib4mesa16глБуфРисFkZv", биб);

		//вяжи(функция_562)("_D3lib4mesa16глВключиFkZv", биб);

		//вяжи(функция_563)("_D3lib4mesa16глВращайFffffZv", биб);

		//вяжи(функция_564)("_D3lib4mesa16глДайБулFkPhZv", биб);

		//вяжи(функция_565)("_D3lib4mesa16глДайДвоFkPdZv", биб);

		//вяжи(функция_566)("_D3lib4mesa16глДайЦелFkPiZv", биб);

		//вяжи(функция_567)("_D3lib4mesa16глИндексFfZv", биб);

		//вяжи(функция_568)("_D3lib4mesa16глИндексFhZv", биб);

		//вяжи(функция_569)("_D3lib4mesa16глИндексFiZv", биб);

		//вяжи(функция_570)("_D3lib4mesa16глИндексFPdZv", биб);

		//вяжи(функция_571)("_D3lib4mesa16глИндексFPfZv", биб);

		//вяжи(функция_572)("_D3lib4mesa16глИндексFPhZv", биб);

		//вяжи(функция_573)("_D3lib4mesa16глИндексFPiZv", биб);

		//вяжи(функция_574)("_D3lib4mesa16глИндексFPsZv", биб);

		//вяжи(функция_575)("_D3lib4mesa16глИндексFsZv", биб);

		//вяжи(функция_576)("_D3lib4mesa16глОчистиFkZv", биб);

		//вяжи(функция_577)("_D3lib4mesa16глуВидНаFdddddddddZv", биб);

		//вяжи(функция_578)("_D3lib4mesa16глутИницFPiPPaZv", биб);

		//вяжи(функция_579)("_D3lib4mesa17глуОрто2МFddddZv", биб);

		//вяжи(функция_580)("_D3lib4mesa18глВершинаFffffZv", биб);

		//вяжи(функция_581)("_D3lib4mesa18глВершинаFfffZv", биб);

		//вяжи(функция_582)("_D3lib4mesa18глВершинаFffZv", биб);

		//вяжи(функция_583)("_D3lib4mesa18глВершинаFiiiiZv", биб);

		//вяжи(функция_584)("_D3lib4mesa18глВершинаFiiiZv", биб);

		//вяжи(функция_585)("_D3lib4mesa18глВершинаFiiZv", биб);

		//вяжи(функция_586)("_D3lib4mesa18глВершинаFssssZv", биб);

		//вяжи(функция_587)("_D3lib4mesa18глВершинаFsssZv", биб);

		//вяжи(функция_588)("_D3lib4mesa18глВершинаFssZv", биб);

		//вяжи(функция_589)("_D3lib4mesa18глВращайдFddddZv", биб);

		//вяжи(функция_590)("_D3lib4mesa18глВыньИмяFZv", биб);

		//вяжи(функция_591)("_D3lib4mesa18глВьюпортFiiiiZv", биб);

		//вяжи(функция_592)("_D3lib4mesa18глГенТексFkkdZv", биб);

		//вяжи(функция_593)("_D3lib4mesa18глГенТексFkkfZv", биб);

		//вяжи(функция_594)("_D3lib4mesa18глГенТексFkkiZv", биб);

		//вяжи(функция_595)("_D3lib4mesa18глГенТексFkkPdZv", биб);

		//вяжи(функция_596)("_D3lib4mesa18глГенТексFkkPfZv", биб);

		//вяжи(функция_597)("_D3lib4mesa18глГенТексFkkPiZv", биб);

		//вяжи(функция_598)("_D3lib4mesa18глДайПлавFkPfZv", биб);

		//вяжи(функция_599)("_D3lib4mesa18глДайСветFkkPfZv", биб);

		//вяжи(функция_600)("_D3lib4mesa18глДайСветFkkPiZv", биб);

		//вяжи(функция_601)("_D3lib4mesa18глИндексдFdZv", биб);

		//вяжи(функция_602)("_D3lib4mesa18глНожницыFiiiiZv", биб);

		//вяжи(функция_603)("_D3lib4mesa18глНормальFfffZv", биб);

		//вяжи(функция_604)("_D3lib4mesa18глНормальFgggZv", биб);

		//вяжи(функция_605)("_D3lib4mesa18глНормальFiiiZv", биб);

		//вяжи(функция_606)("_D3lib4mesa18глНормальFPdZv", биб);

		//вяжи(функция_607)("_D3lib4mesa18глНормальFPfZv", биб);

		//вяжи(функция_608)("_D3lib4mesa18глНормальFPgZv", биб);

		//вяжи(функция_609)("_D3lib4mesa18глНормальFPiZv", биб);

		//вяжи(функция_610)("_D3lib4mesa18глНормальFPsZv", биб);

		//вяжи(функция_611)("_D3lib4mesa18глНормальFsssZv", биб);

		//вяжи(функция_612)("_D3lib4mesa18глОтключиFkZv", биб);

		//вяжи(функция_613)("_D3lib4mesa18глПропускFfZv", биб);

		//вяжи(функция_614)("_D3lib4mesa18глПрофильFkZv", биб);

		//вяжи(функция_615)("_D3lib4mesa18глПрямоугFffffZv", биб);

		//вяжи(функция_616)("_D3lib4mesa18глПрямоугFiiiiZv", биб);

		//вяжи(функция_617)("_D3lib4mesa18глПрямоугFPdPdZv", биб);

		//вяжи(функция_618)("_D3lib4mesa18глПрямоугFPfPfZv", биб);

		//вяжи(функция_619)("_D3lib4mesa18глПрямоугFPiPiZv", биб);

		//вяжи(функция_620)("_D3lib4mesa18глПрямоугFPsPsZv", биб);

		//вяжи(функция_621)("_D3lib4mesa18глПрямоугFssssZv", биб);

		//вяжи(функция_622)("_D3lib4mesa18глСуньИмяFkZv", биб);

		//вяжи(функция_623)("_D3lib4mesa18глуТкстОшFkZPa", биб);

		//вяжи(функция_624)("_D3lib4mesa19глВершина2FPdZv", биб);

		//вяжи(функция_625)("_D3lib4mesa19глВершина2FPfZv", биб);

		//вяжи(функция_626)("_D3lib4mesa19глВершина2FPiZv", биб);

		//вяжи(функция_627)("_D3lib4mesa19глВершина2FPsZv", биб);

		//вяжи(функция_628)("_D3lib4mesa19глВершина3FPdZv", биб);

		//вяжи(функция_629)("_D3lib4mesa19глВершина3FPfZv", биб);

		//вяжи(функция_630)("_D3lib4mesa19глВершина3FPiZv", биб);

		//вяжи(функция_631)("_D3lib4mesa19глВершина3FPsZv", биб);

		//вяжи(функция_632)("_D3lib4mesa19глВершина4FPdZv", биб);

		//вяжи(функция_633)("_D3lib4mesa19глВершина4FPfZv", биб);

		//вяжи(функция_634)("_D3lib4mesa19глВершина4FPiZv", биб);

		//вяжи(функция_635)("_D3lib4mesa19глВершина4FPsZv", биб);

		//вяжи(функция_636)("_D3lib4mesa20глВершинадFddddZv", биб);

		//вяжи(функция_637)("_D3lib4mesa20глВершинадFdddZv", биб);

		//вяжи(функция_638)("_D3lib4mesa20глВершинадFddZv", биб);

		//вяжи(функция_639)("_D3lib4mesa20глВыньМатрFZv", биб);

		//вяжи(функция_640)("_D3lib4mesa20глДайКартуFkkPdZv", биб);

		//вяжи(функция_641)("_D3lib4mesa20глДайКартуFkkPfZv", биб);

		//вяжи(функция_642)("_D3lib4mesa20глДайКартуFkkPiZv", биб);

		//вяжи(функция_643)("_D3lib4mesa20глДайТекстFkZPa", биб);

		//вяжи(функция_644)("_D3lib4mesa20глМатериалFkkfZv", биб);

		//вяжи(функция_645)("_D3lib4mesa20глМатериалFkkiZv", биб);

		//вяжи(функция_646)("_D3lib4mesa20глМатериалFkkPfZv", биб);

		//вяжи(функция_647)("_D3lib4mesa20глМатериалFkkPiZv", биб);

		//вяжи(функция_648)("_D3lib4mesa20глНормальдFdddZv", биб);

		//вяжи(функция_649)("_D3lib4mesa20глПеренесиFfffZv", биб);

		//вяжи(функция_650)("_D3lib4mesa20глПрямоугдFddddZv", биб);

		//вяжи(функция_651)("_D3lib4mesa20глСуньМатрFZv", биб);

		//вяжи(функция_652)("_D3lib4mesa20глУкНаЦветFikiPvZv", биб);

		//вяжи(функция_653)("_D3lib4mesa20глФлагКраяFhZv", биб);

		//вяжи(функция_654)("_D3lib4mesa20глФлагКраяFPhZv", биб);

		//вяжи(функция_655)("_D3lib4mesa20глФруструмFddddddZv", биб);

		//вяжи(функция_656)("_D3lib4mesa20глуДайТкстFkZPa", биб);

		//вяжи(функция_657)("_D3lib4mesa20глуКонКривFPS3lib4mesa8GLUnurbsZv", биб);

		//вяжи(функция_658)("_D3lib4mesa20глуЦилиндрFPS3lib4mesa10GLUquadricdddiiZv", биб);

		//вяжи(функция_659)("_D3lib4mesa21глОцениМеш1FkiiZv", биб);

		//вяжи(функция_660)("_D3lib4mesa21глОцениМеш2FkiiiiZv", биб);

		//вяжи(функция_661)("_D3lib4mesa21глСписок_лиFkZh", биб);

		//вяжи(функция_662)("_D3lib4mesa22глБуфЧтенияFkZv", биб);

		//вяжи(функция_663)("_D3lib4mesa22глВыньАтрибFZv", биб);

		//вяжи(функция_664)("_D3lib4mesa22глГенСпискиFiZk", биб);

		//вяжи(функция_665)("_D3lib4mesa22глДайОшибкуFZk", биб);

		//вяжи(функция_666)("_D3lib4mesa22глИницИменаFZv", биб);

		//вяжи(функция_667)("_D3lib4mesa22глКоордТексFffffZv", биб);

		//вяжи(функция_668)("_D3lib4mesa22глКоордТексFfffZv", биб);

		//вяжи(функция_669)("_D3lib4mesa22глКоордТексFffZv", биб);

		//вяжи(функция_670)("_D3lib4mesa22глКоордТексFfZv", биб);

		//вяжи(функция_671)("_D3lib4mesa22глКоордТексFiiiiZv", биб);

		//вяжи(функция_672)("_D3lib4mesa22глКоордТексFiiiZv", биб);

		//вяжи(функция_673)("_D3lib4mesa22глКоордТексFiiZv", биб);

		//вяжи(функция_674)("_D3lib4mesa22глКоордТексFiZv", биб);

		//вяжи(функция_675)("_D3lib4mesa22глКоордТексFssssZv", биб);

		//вяжи(функция_676)("_D3lib4mesa22глКоордТексFsssZv", биб);

		//вяжи(функция_677)("_D3lib4mesa22глКоордТексFssZv", биб);

		//вяжи(функция_678)("_D3lib4mesa22глКоордТексFsZv", биб);

		//вяжи(функция_679)("_D3lib4mesa22глМаскаДалиFhZv", биб);

		//вяжи(функция_680)("_D3lib4mesa22глНовСписокFkkZv", биб);

		//вяжи(функция_681)("_D3lib4mesa22глОваСпискаFkZv", биб);

		//вяжи(функция_682)("_D3lib4mesa22глОпШаблонаFkkkZv", биб);

		//вяжи(функция_683)("_D3lib4mesa22глПеренесидFdddZv", биб);

		//вяжи(функция_684)("_D3lib4mesa22глПодсказкаFkkZv", биб);

		//вяжи(функция_685)("_D3lib4mesa22глПозРастраFffffZv", биб);

		//вяжи(функция_686)("_D3lib4mesa22глПозРастраFfffZv", биб);

		//вяжи(функция_687)("_D3lib4mesa22глПозРастраFffZv", биб);

		//вяжи(функция_688)("_D3lib4mesa22глПозРастраFiiiiZv", биб);

		//вяжи(функция_689)("_D3lib4mesa22глПозРастраFiiiZv", биб);

		//вяжи(функция_690)("_D3lib4mesa22глПозРастраFiiZv", биб);

		//вяжи(функция_691)("_D3lib4mesa22глПозРастраFssssZv", биб);

		//вяжи(функция_692)("_D3lib4mesa22глПозРастраFsssZv", биб);

		//вяжи(функция_693)("_D3lib4mesa22глПозРастраFssZv", биб);

		//вяжи(функция_694)("_D3lib4mesa22глРежимМатрFkZv", биб);

		//вяжи(функция_695)("_D3lib4mesa22глСредаТексFkkfZv", биб);

		//вяжи(функция_696)("_D3lib4mesa22глСредаТексFkkiZv", биб);

		//вяжи(функция_697)("_D3lib4mesa22глСредаТексFkkPfZv", биб);

		//вяжи(функция_698)("_D3lib4mesa22глСредаТексFkkPiZv", биб);

		//вяжи(функция_699)("_D3lib4mesa22глСуньАтрибFkZv", биб);

		//вяжи(функция_700)("_D3lib4mesa22глФункцДалиFkZv", биб);

		//вяжи(функция_701)("_D3lib4mesa22глуКонОбрезFPS3lib4mesa8GLUnurbsZv", биб);

		//вяжи(функция_702)("_D3lib4mesa22глуПолуДискFPS3lib4mesa10GLUquadricddiiddZv", биб);

		//вяжи(функция_703)("_D3lib4mesa22глуПроекцияFdddPdPdPiPdPdPdZi", биб);

		//вяжи(функция_704)("_D3lib4mesa22глутДайМенюFZi", биб);

		//вяжи(функция_705)("_D3lib4mesa22глутДайОкноFZi", биб);

		//вяжи(функция_706)("_D3lib4mesa22глутДайСлойFkZi", биб);

		//вяжи(функция_707)("_D3lib4mesa22глутДайЦветFiiZf", биб);

		//вяжи(функция_708)("_D3lib4mesa23глВключен_лиFkZh", биб);

		//вяжи(функция_709)("_D3lib4mesa23глКоордТекс1FPdZv", биб);

		//вяжи(функция_710)("_D3lib4mesa23глКоордТекс1FPfZv", биб);

		//вяжи(функция_711)("_D3lib4mesa23глКоордТекс1FPiZv", биб);

		//вяжи(функция_712)("_D3lib4mesa23глКоордТекс1FPsZv", биб);

		//вяжи(функция_713)("_D3lib4mesa23глКоордТекс2FPdZv", биб);

		//вяжи(функция_714)("_D3lib4mesa23глКоордТекс2FPfZv", биб);

		//вяжи(функция_715)("_D3lib4mesa23глКоордТекс2FPiZv", биб);

		//вяжи(функция_716)("_D3lib4mesa23глКоордТекс2FPsZv", биб);

		//вяжи(функция_717)("_D3lib4mesa23глКоордТекс3FPdZv", биб);

		//вяжи(функция_718)("_D3lib4mesa23глКоордТекс3FPfZv", биб);

		//вяжи(функция_719)("_D3lib4mesa23глКоордТекс3FPiZv", биб);

		//вяжи(функция_720)("_D3lib4mesa23глКоордТекс3FPsZv", биб);

		//вяжи(функция_721)("_D3lib4mesa23глКоордТекс4FPdZv", биб);

		//вяжи(функция_722)("_D3lib4mesa23глКоордТекс4FPfZv", биб);

		//вяжи(функция_723)("_D3lib4mesa23глКоордТекс4FPiZv", биб);

		//вяжи(функция_724)("_D3lib4mesa23глКоордТекс4FPsZv", биб);

		//вяжи(функция_725)("_D3lib4mesa23глПозРастра2FPdZv", биб);

		//вяжи(функция_726)("_D3lib4mesa23глПозРастра2FPfZv", биб);

		//вяжи(функция_727)("_D3lib4mesa23глПозРастра2FPiZv", биб);

		//вяжи(функция_728)("_D3lib4mesa23глПозРастра2FPsZv", биб);

		//вяжи(функция_729)("_D3lib4mesa23глПозРастра3FPdZv", биб);

		//вяжи(функция_730)("_D3lib4mesa23глПозРастра3FPfZv", биб);

		//вяжи(функция_731)("_D3lib4mesa23глПозРастра3FPiZv", биб);

		//вяжи(функция_732)("_D3lib4mesa23глПозРастра3FPsZv", биб);

		//вяжи(функция_733)("_D3lib4mesa23глПозРастра4FPdZv", биб);

		//вяжи(функция_734)("_D3lib4mesa23глПозРастра4FPfZv", биб);

		//вяжи(функция_735)("_D3lib4mesa23глПозРастра4FPiZv", биб);

		//вяжи(функция_736)("_D3lib4mesa23глПозРастра4FPsZv", биб);

		//вяжи(функция_737)("_D3lib4mesa24глДайГенТексFkkPdZv", биб);

		//вяжи(функция_738)("_D3lib4mesa24глДайГенТексFkkPfZv", биб);

		//вяжи(функция_739)("_D3lib4mesa24глДайГенТексFkkPiZv", биб);

		//вяжи(функция_740)("_D3lib4mesa24глЗагрузиИмяFkZv", биб);

		//вяжи(функция_741)("_D3lib4mesa24глЗумПикселяFffZv", биб);

		//вяжи(функция_742)("_D3lib4mesa24глКоордТексдFddddZv", биб);

		//вяжи(функция_743)("_D3lib4mesa24глКоордТексдFdddZv", биб);

		//вяжи(функция_744)("_D3lib4mesa24глКоордТексдFddZv", биб);

		//вяжи(функция_745)("_D3lib4mesa24глКоордТексдFdZv", биб);

		//вяжи(функция_746)("_D3lib4mesa24глМаскаЦветаFhhhhZv", биб);

		//вяжи(функция_747)("_D3lib4mesa24глМодельТениFkZv", биб);

		//вяжи(функция_748)("_D3lib4mesa24глОчистиДальFdZv", биб);

		//вяжи(функция_749)("_D3lib4mesa24глПозРастрадFddddZv", биб);

		//вяжи(функция_750)("_D3lib4mesa24глПозРастрадFdddZv", биб);

		//вяжи(функция_751)("_D3lib4mesa24глПозРастрадFddZv", биб);

		//вяжи(функция_752)("_D3lib4mesa24глУкНаИндексFkiPvZv", биб);

		//вяжи(функция_753)("_D3lib4mesa24глУмножьМатрFPdZv", биб);

		//вяжи(функция_754)("_D3lib4mesa24глУмножьМатрFPfZv", биб);

		//вяжи(функция_755)("_D3lib4mesa24глФункцАльфыFkfZv", биб);

		//вяжи(функция_756)("_D3lib4mesa24глФункцСмесиFkkZv", биб);

		//вяжи(функция_757)("_D3lib4mesa24глуНовыйТессFZPS3lib4mesa13GLUtesselator", биб);

		//вяжи(функция_758)("_D3lib4mesa24глуУдалиТессFPS3lib4mesa13GLUtesselatorZv", биб);

		//вяжи(функция_759)("_D3lib4mesa24глутВыньОкноFZv", биб);

		//вяжи(функция_760)("_D3lib4mesa24глутСуньОкноFZv", биб);

		//вяжи(функция_761)("_D3lib4mesa24глутУкНаВарпFiiZv", биб);

		//вяжи(функция_762)("_D3lib4mesa25глОбразТекс2МFkiiiiikkPvZv", биб);

		//вяжи(функция_763)("_D3lib4mesa25глОцениКоорд1FdZv", биб);

		//вяжи(функция_764)("_D3lib4mesa25глОцениКоорд1FfZv", биб);

		//вяжи(функция_765)("_D3lib4mesa25глОцениКоорд1FPdZv", биб);

		//вяжи(функция_766)("_D3lib4mesa25глОцениКоорд1FPfZv", биб);

		//вяжи(функция_767)("_D3lib4mesa25глОцениКоорд2FddZv", биб);

		//вяжи(функция_768)("_D3lib4mesa25глОцениКоорд2FffZv", биб);

		//вяжи(функция_769)("_D3lib4mesa25глОцениКоорд2FPdZv", биб);

		//вяжи(функция_770)("_D3lib4mesa25глОцениКоорд2FPfZv", биб);

		//вяжи(функция_771)("_D3lib4mesa25глОцениТочку1FiZv", биб);

		//вяжи(функция_772)("_D3lib4mesa25глОцениТочку2FiiZv", биб);

		//вяжи(функция_773)("_D3lib4mesa25глСеткаКарты1FiddZv", биб);

		//вяжи(функция_774)("_D3lib4mesa25глСеткаКарты1FiffZv", биб);

		//вяжи(функция_775)("_D3lib4mesa25глСеткаКарты2FiddiddZv", биб);

		//вяжи(функция_776)("_D3lib4mesa25глСеткаКарты2FiffiffZv", биб);

		//вяжи(функция_777)("_D3lib4mesa25глТекстура_лиFkZh", биб);

		//вяжи(функция_778)("_D3lib4mesa26глВыбериБуферFiPkZv", биб);

		//вяжи(функция_779)("_D3lib4mesa26глГенТекстурыFiPkZv", биб);

		//вяжи(функция_780)("_D3lib4mesa26глДайМатериалFkkPfZv", биб);

		//вяжи(функция_781)("_D3lib4mesa26глДайМатериалFkkPiZv", биб);

		//вяжи(функция_782)("_D3lib4mesa26глЗагрузиМатрFPdZv", биб);

		//вяжи(функция_783)("_D3lib4mesa26глЗагрузиМатрFPfZv", биб);

		//вяжи(функция_784)("_D3lib4mesa26глКонецСпискаFZv", биб);

		//вяжи(функция_785)("_D3lib4mesa26глМасштабируйFfffZv", биб);

		//вяжи(функция_786)("_D3lib4mesa26глМодельСветаFkfZv", биб);

		//вяжи(функция_787)("_D3lib4mesa26глМодельСветаFkiZv", биб);

		//вяжи(функция_788)("_D3lib4mesa26глМодельСветаFkPfZv", биб);

		//вяжи(функция_789)("_D3lib4mesa26глМодельСветаFkPiZv", биб);

		//вяжи(функция_790)("_D3lib4mesa26глОчистиАккумFffffZv", биб);

		//вяжи(функция_791)("_D3lib4mesa26глРазмерТочкиFfZv", биб);

		//вяжи(функция_792)("_D3lib4mesa26глУдалиСпискиFkiZv", биб);

		//вяжи(функция_793)("_D3lib4mesa26глУкНаВершинуFikiPvZv", биб);

		//вяжи(функция_794)("_D3lib4mesa26глУкНаНормальFkiPvZv", биб);

		//вяжи(функция_795)("_D3lib4mesa26глЦветОчисткиFffffZv", биб);

		//вяжи(функция_796)("_D3lib4mesa26глШиринаЛинииFfZv", биб);

		//вяжи(функция_797)("_D3lib4mesa26глуКонМногоугFPS3lib4mesa13GLUtesselatorZv", биб);

		//вяжи(функция_798)("_D3lib4mesa26глуКонПоверхнFPS3lib4mesa8GLUnurbsZv", биб);

		//вяжи(функция_799)("_D3lib4mesa26глуКриваяНурбFPS3lib4mesa8GLUnurbsiPfiPfikZv", биб);

		//вяжи(функция_800)("_D3lib4mesa26глуНачниОбрезFPS3lib4mesa8GLUnurbsZv", биб);

		//вяжи(функция_801)("_D3lib4mesa26глуУдалиКвадрFPS3lib4mesa10GLUquadricZv", биб);

		//вяжи(функция_802)("_D3lib4mesa26глутПерепоказFZv", биб);

		//вяжи(функция_803)("_D3lib4mesa26глутФункцМышиFPUiiiiZvZv", биб);

		//вяжи(функция_804)("_D3lib4mesa27глОбразТекст1МFkiiiikkPvZv", биб);

		//вяжи(функция_805)("_D3lib4mesa28глБуферФидбэкаFikPfZv", биб);

		//вяжи(функция_806)("_D3lib4mesa28глВызовиСпискиFikPvZv", биб);

		//вяжи(функция_807)("_D3lib4mesa28глВызовиСписокFkZv", биб);

		//вяжи(функция_808)("_D3lib4mesa28глДайОбразТексFkikkPvZv", биб);

		//вяжи(функция_809)("_D3lib4mesa28глДайСредуТексFkkPfZv", биб);

		//вяжи(функция_810)("_D3lib4mesa28глДайСредуТексFkkPiZv", биб);

		//вяжи(функция_811)("_D3lib4mesa28глДиапазонДалиFddZv", биб);

		//вяжи(функция_812)("_D3lib4mesa28глЗагрузиИдентFZv", биб);

		//вяжи(функция_813)("_D3lib4mesa28глЛогическаяОпFkZv", биб);

		//вяжи(функция_814)("_D3lib4mesa28глМаскаИндексаFkZv", биб);

		//вяжи(функция_815)("_D3lib4mesa28глМаскаШаблонаFkZv", биб);

		//вяжи(функция_816)("_D3lib4mesa28глМасштабируйдFdddZv", биб);

		//вяжи(функция_817)("_D3lib4mesa28глОчистиИндексFfZv", биб);

		//вяжи(функция_818)("_D3lib4mesa28глОчистиШаблонFiZv", биб);

		//вяжи(функция_819)("_D3lib4mesa28глПараметрТексFkkfZv", биб);

		//вяжи(функция_820)("_D3lib4mesa28глПараметрТексFkkiZv", биб);

		//вяжи(функция_821)("_D3lib4mesa28глПараметрТексFkkPfZv", биб);

		//вяжи(функция_822)("_D3lib4mesa28глПараметрТексFkkPiZv", биб);

		//вяжи(функция_823)("_D3lib4mesa28глПолоскаЛинийFitZv", биб);

		//вяжи(функция_824)("_D3lib4mesa28глРежимМногоугFkkZv", биб);

		//вяжи(функция_825)("_D3lib4mesa28глРисуйМассивыFkiiZv", биб);

		//вяжи(функция_826)("_D3lib4mesa28глРисуйПикселиFiikkPvZv", биб);

		//вяжи(функция_827)("_D3lib4mesa28глУкНаФлагКраяFiPvZv", биб);

		//вяжи(функция_828)("_D3lib4mesa28глФункцШаблонаFkikZv", биб);

		//вяжи(функция_829)("_D3lib4mesa28глЧитайПикселиFiiiikkPvZv", биб);

		//вяжи(функция_830)("_D3lib4mesa28глуНачниКривуюFPS3lib4mesa8GLUnurbsZv", биб);

		//вяжи(функция_831)("_D3lib4mesa28глуПерспективаFddddZv", биб);

		//вяжи(функция_832)("_D3lib4mesa28глуСледщКонтурFPS3lib4mesa13GLUtesselatorkZv", биб);

		//вяжи(функция_833)("_D3lib4mesa28глуТессВершинаFPS3lib4mesa13GLUtesselatorPdPvZv", биб);

		//вяжи(функция_834)("_D3lib4mesa28глуТессНормальFPS3lib4mesa13GLUtesselatordddZv", биб);

		//вяжи(функция_835)("_D3lib4mesa28глутПлотныйКубFdZv", биб);

		//вяжи(функция_836)("_D3lib4mesa28глутПлотныйТорFddiiZv", биб);

		//вяжи(функция_837)("_D3lib4mesa28глутПокажиОкноFZv", биб);

		//вяжи(функция_838)("_D3lib4mesa28глутСверниОкноFZv", биб);

		//вяжи(функция_839)("_D3lib4mesa28глутСоздайМенюFPUiZvZi", биб);

		//вяжи(функция_840)("_D3lib4mesa28глутСоздайОкноFPaZi", биб);

		//вяжи(функция_841)("_D3lib4mesa28глутСпрячьОкноFZv", биб);

		//вяжи(функция_842)("_D3lib4mesa30глМатериалЦветаFkkZv", биб);

		//вяжи(функция_843)("_D3lib4mesa30глРисуйЭлементыFkikPvZv", биб);

		//вяжи(функция_844)("_D3lib4mesa30глУдалиТекстурыFiPkZv", биб);

		//вяжи(функция_845)("_D3lib4mesa30глУкНаКоордТексFikiPvZv", биб);

		//вяжи(функция_846)("_D3lib4mesa30глуКвадрНормалиFPS3lib4mesa10GLUquadrickZv", биб);

		//вяжи(функция_847)("_D3lib4mesa30глуНачниМногоугFPS3lib4mesa13GLUtesselatorZv", биб);

		//вяжи(функция_848)("_D3lib4mesa30глуНовыйКвадрикFZPS3lib4mesa10GLUquadric", биб);

		//вяжи(функция_849)("_D3lib4mesa30глуОбрвызовТессFPS3lib4mesa13GLUtesselatorkPUZvZv", биб);

		//вяжи(функция_850)("_D3lib4mesa30глуСвойствоНурбFPS3lib4mesa8GLUnurbskfZv", биб);

		//вяжи(функция_851)("_D3lib4mesa30глуТессСвойствоFPS3lib4mesa13GLUtesselatorkdZv", биб);

		//вяжи(функция_852)("_D3lib4mesa30глутГлавныйЦиклFZv", биб);

		//вяжи(функция_853)("_D3lib4mesa30глутДлинаБитмапFPvPaZi", биб);

		//вяжи(функция_854)("_D3lib4mesa30глутДлинаШтрихаFPvPaZi", биб);

		//вяжи(функция_855)("_D3lib4mesa30глутИницПозОкнаFiiZv", биб);

		//вяжи(функция_856)("_D3lib4mesa30глутОткрепиМенюFiZv", биб);

		//вяжи(функция_857)("_D3lib4mesa30глутПолныйЭкранFZv", биб);

		//вяжи(функция_858)("_D3lib4mesa30глутПоместиОкноFiiZv", биб);

		//вяжи(функция_859)("_D3lib4mesa30глутРазрушьМенюFiZv", биб);

		//вяжи(функция_860)("_D3lib4mesa30глутРазрушьОкноFiZv", биб);

		//вяжи(функция_861)("_D3lib4mesa30глутФункцПоказаFPUZvZv", биб);

		//вяжи(функция_862)("_D3lib4mesa31глПодобразТекс2МFkiiiiikkPvZv", биб);

		//вяжи(функция_863)("_D3lib4mesa32глКопируйПикселиFiiiikZv", биб);

		//вяжи(функция_864)("_D3lib4mesa32глПолоскаМногоугFPhZv", биб);

		//вяжи(функция_865)("_D3lib4mesa32глСохраниПиксельFkfZv", биб);

		//вяжи(функция_866)("_D3lib4mesa32глСохраниПиксельFkiZv", биб);

		//вяжи(функция_867)("_D3lib4mesa32глЭлементМассиваFiZv", биб);

		//вяжи(функция_868)("_D3lib4mesa32глуКвадрТекстураFPS3lib4mesa10GLUquadricbZv", биб);

		//вяжи(функция_869)("_D3lib4mesa32глуОбрвызовНурбсFPS3lib4mesa8GLUnurbskPUZvZv", биб);

		//вяжи(функция_870)("_D3lib4mesa32глутДайРежимИгрыFkZi", биб);

		//вяжи(функция_871)("_D3lib4mesa32глутКаркасныйКубFdZv", биб);

		//вяжи(функция_872)("_D3lib4mesa32глутКаркасныйТорFddiiZv", биб);

		//вяжи(функция_873)("_D3lib4mesa32глутОбменБуферовFZv", биб);

		//вяжи(функция_874)("_D3lib4mesa32глутПанируйВидеоFiiiiZv", биб);

		//вяжи(функция_875)("_D3lib4mesa32глутПлотнаяСфераFdiiZv", биб);

		//вяжи(функция_876)("_D3lib4mesa32глутПлотныйКонусFddiiZv", биб);

		//вяжи(функция_877)("_D3lib4mesa32глутПрикрепиМенюFiZv", биб);

		//вяжи(функция_878)("_D3lib4mesa32глутСимволБитмапFPviZv", биб);

		//вяжи(функция_879)("_D3lib4mesa32глутСимволШтрихаFPviZv", биб);

		//вяжи(функция_880)("_D3lib4mesa32глутУстановиМенюFiZv", биб);

		//вяжи(функция_881)("_D3lib4mesa32глутУстановиОкноFiZv", биб);

		//вяжи(функция_882)("_D3lib4mesa32глутУстановиЦветFifffZv", биб);

		//вяжи(функция_883)("_D3lib4mesa32глутФункцТаймераFiPUiZviZv", биб);

		//вяжи(функция_884)("_D3lib4mesa32глутФункцияВводаFPUiZvZv", биб);

		//вяжи(функция_885)("_D3lib4mesa32глутШиринаБитмапFPviZi", биб);

		//вяжи(функция_886)("_D3lib4mesa32глутШиринаШтрихаFPviZi", биб);

		//вяжи(функция_887)("_D3lib4mesa33глПодобразТекст1МFkiiikkPvZv", биб);

		//вяжи(функция_888)("_D3lib4mesa34глДайКартуПикселяFkPfZv", биб);

		//вяжи(функция_889)("_D3lib4mesa34глДайКартуПикселяFkPkZv", биб);

		//вяжи(функция_890)("_D3lib4mesa34глДайКартуПикселяFkPtZv", биб);

		//вяжи(функция_891)("_D3lib4mesa34глДайПараметрТексFkkPfZv", биб);

		//вяжи(функция_892)("_D3lib4mesa34глДайПараметрТексFkkPiZv", биб);

		//вяжи(функция_893)("_D3lib4mesa34глКартируйПиксельFkiPfZv", биб);

		//вяжи(функция_894)("_D3lib4mesa34глКартируйПиксельFkiPkZv", биб);

		//вяжи(функция_895)("_D3lib4mesa34глКартируйПиксельFkiPtZv", биб);

		//вяжи(функция_896)("_D3lib4mesa34глПривяжиТекстуруFkkZv", биб);

		//вяжи(функция_897)("_D3lib4mesa34глСмещениеМногоугFffZv", биб);

		//вяжи(функция_898)("_D3lib4mesa34глуОбрвызовКвадраFPS3lib4mesa10GLUquadrickPUZvZv", биб);

		//вяжи(функция_899)("_D3lib4mesa34глуПодбериМатрицуFddddPiZv", биб);

		//вяжи(функция_900)("_D3lib4mesa34глутДайУстройствоFkZi", биб);

		//вяжи(функция_901)("_D3lib4mesa34глутДобавьПодменюFPaiZv", биб);

		//вяжи(функция_902)("_D3lib4mesa34глутИницТекстОкнаFPaZv", биб);

		//вяжи(функция_903)("_D3lib4mesa34глутИспользуйСлойFkZv", биб);

		//вяжи(функция_904)("_D3lib4mesa34глутОсобаяФункцияFPUiiiZvZv", биб);

		//вяжи(функция_905)("_D3lib4mesa34глутПеремерьВидеоFiiiiZv", биб);

		//вяжи(функция_906)("_D3lib4mesa34глутПерепоказОкнаFiZv", биб);

		//вяжи(функция_907)("_D3lib4mesa34глутПерерисуйОкноFiiZv", биб);

		//вяжи(функция_908)("_D3lib4mesa34глутПлотныйЧайникFdZv", биб);

		//вяжи(функция_909)("_D3lib4mesa34глутСкройНакладкуFZv", биб);

		//вяжи(функция_910)("_D3lib4mesa34глутСоздайПодокноFiiiiiZi", биб);

		//вяжи(функция_911)("_D3lib4mesa34глутУдалиНакладкуFZv", биб);

		//вяжи(функция_912)("_D3lib4mesa34глутФункцДвиженияFPUiiZvZv", биб);

		//вяжи(функция_913)("_D3lib4mesa36глВыньАтрибКлиентаFZv", биб);

		//вяжи(функция_914)("_D3lib4mesa36глПереместиПиксельFkfZv", биб);

		//вяжи(функция_915)("_D3lib4mesa36глПереместиПиксельFkiZv", биб);

		//вяжи(функция_916)("_D3lib4mesa36глРежимОтображенияFkZi", биб);

		//вяжи(функция_917)("_D3lib4mesa36глСуньАтрибКлиентаFkZv", биб);

		//вяжи(функция_918)("_D3lib4mesa36глуДайСвойствоНурбFPS3lib4mesa8GLUnurbskPfZv", биб);

		//вяжи(функция_919)("_D3lib4mesa36глуДайСвойствоТессFPS3lib4mesa13GLUtesselatorkPdZv", биб);

		//вяжи(функция_920)("_D3lib4mesa36глуКвадрОриентацияFPS3lib4mesa10GLUquadrickZv", биб);

		//вяжи(функция_921)("_D3lib4mesa36глуПоверхностьНурбFPS3lib4mesa8GLUnurbsiPfiPfiiPfiikZv", биб);

		//вяжи(функция_922)("_D3lib4mesa36глуТессНачниКонтурFPS3lib4mesa13GLUtesselatorZv", биб);

		//вяжи(функция_923)("_D3lib4mesa36глутИницРазмерОкнаFiiZv", биб);

		//вяжи(функция_924)("_D3lib4mesa36глутКаркаснаяСфераFdiiZv", биб);

		//вяжи(функция_925)("_D3lib4mesa36глутКаркасныйКонусFddiiZv", биб);

		//вяжи(функция_926)("_D3lib4mesa36глутОтчётОбОшибкахFZv", биб);

		//вяжи(функция_927)("_D3lib4mesa36глутПлотныйОктаэдрFZv", биб);

		//вяжи(функция_928)("_D3lib4mesa36глутПокажиНакладкуFZv", биб);

		//вяжи(функция_929)("_D3lib4mesa36глутУстановиКурсорFiZv", биб);

		//вяжи(функция_930)("_D3lib4mesa36глутФункцАбонентовFPUiiZvZv", биб);

		//вяжи(функция_931)("_D3lib4mesa36глутФункцВидимостиFPUiZvZv", биб);

		//вяжи(функция_932)("_D3lib4mesa36глутФункцДжойстикаFPUkiiiZviZv", биб);

		//вяжи(функция_933)("_D3lib4mesa37глуПострой1ММипмапыFkiikkPvZi", биб);

		//вяжи(функция_934)("_D3lib4mesa37глуПострой2ММипмапыFiiiikkPvZi", биб);

		//вяжи(функция_935)("_D3lib4mesa37глуПострой3ММипмапыFkiiiikkPvZi", биб);

		//вяжи(функция_936)("_D3lib4mesa38глДайПолоскуМногоугFPhZv", биб);

		//вяжи(функция_937)("_D3lib4mesa38глОПлоскостьОбрезкиFkPdZv", биб);

		//вяжи(функция_938)("_D3lib4mesa38глСовместныеМассивыFkiPvZv", биб);

		//вяжи(функция_939)("_D3lib4mesa38глуНачниПоверхностьFPS3lib4mesa8GLUnurbsZv", биб);

		//вяжи(функция_940)("_D3lib4mesa38глутВойдиВРежимИгрыFZi", биб);

		//вяжи(функция_941)("_D3lib4mesa38глутДайМодификаторыFZi", биб);

		//вяжи(функция_942)("_D3lib4mesa38глутДайПеремерВидеоFkZi", биб);

		//вяжи(функция_943)("_D3lib4mesa38глутИницРежимПоказаFkZv", биб);

		//вяжи(функция_944)("_D3lib4mesa38глутКаркасныйЧайникFdZv", биб);

		//вяжи(функция_945)("_D3lib4mesa38глутПерейдиВПодменюFiPaiZv", биб);

		//вяжи(функция_946)("_D3lib4mesa38глутПлотныйИкосаэдрFZv", биб);

		//вяжи(функция_947)("_D3lib4mesa38глутПлотныйТетраэдрFZv", биб);

		//вяжи(функция_948)("_D3lib4mesa38глутПокиньРежимИгрыFZv", биб);

		//вяжи(функция_949)("_D3lib4mesa38глутТекстРежимаИгрыFPaZv", биб);

		//вяжи(функция_950)("_D3lib4mesa38глутУстановиЗагОкнаFPaZv", биб);

		//вяжи(функция_951)("_D3lib4mesa38глутУстановиЗагПиктFPaZv", биб);

		//вяжи(функция_952)("_D3lib4mesa38глутФункцКлавиатурыFPUaiiZvZv", биб);

		//вяжи(функция_953)("_D3lib4mesa38глутФункцОкнаКнопкиFPUiiZvZv", биб);

		//вяжи(функция_954)("_D3lib4mesa39глКопируйОбразТекс1МFkikiiiiZv", биб);

		//вяжи(функция_955)("_D3lib4mesa40глПриоритетТекстурамFiPkPfZv", биб);

		//вяжи(функция_956)("_D3lib4mesa40глуПроверьРасширениеFPaPaZh", биб);

		//вяжи(функция_957)("_D3lib4mesa40глуТессЗавершиКонтурFPS3lib4mesa13GLUtesselatorZv", биб);

		//вяжи(функция_958)("_D3lib4mesa40глутДобавьЗаписьМенюFPaiZv", биб);

		//вяжи(функция_959)("_D3lib4mesa40глутКаркасныйОктаэдрFZv", биб);

		//вяжи(функция_960)("_D3lib4mesa40глутПлотныйДодекаэдрFZv", биб);

		//вяжи(функция_961)("_D3lib4mesa40глутУдалиЭлементМенюFiZv", биб);

		//вяжи(функция_962)("_D3lib4mesa40глутУстановиНакладкуFZv", биб);

		//вяжи(функция_963)("_D3lib4mesa40глутФункцБездействияFPUZvZv", биб);

		//вяжи(функция_964)("_D3lib4mesa40глутФункцПерерисовкиFPUiiZvZv", биб);

		//вяжи(функция_965)("_D3lib4mesa40глутФункцСтатусаМенюFPUiiiZvZv", биб);

		//вяжи(функция_966)("_D3lib4mesa40глутФункцСтатусаОкнаFPUiZvZv", биб);

		//вяжи(функция_967)("_D3lib4mesa41глКопируйОбразТекст2МFkikiiiiiZv", биб);

		//вяжи(функция_968)("_D3lib4mesa42глДайПлоскостьОбрезкиFkPdZv", биб);

		//вяжи(функция_969)("_D3lib4mesa42глуТессНачниМногогранFPS3lib4mesa13GLUtesselatorPvZv", биб);

		//вяжи(функция_970)("_D3lib4mesa42глутКаркасныйИкосаэдрFZv", биб);

		//вяжи(функция_971)("_D3lib4mesa42глутКаркасныйТетраэдрFZv", биб);

		//вяжи(функция_972)("_D3lib4mesa42глутКопируйЦветокартуFiZv", биб);

		//вяжи(функция_973)("_D3lib4mesa42глутПерепоказНакладкиFZv", биб);

		//вяжи(функция_974)("_D3lib4mesa42глутФункцКнопкиТаблетFPUiiiiZvZv", биб);

		//вяжи(функция_975)("_D3lib4mesa44глуДанныеОбрвызоваНурбFPS3lib4mesa8GLUnurbsPvZv", биб);

		//вяжи(функция_976)("_D3lib4mesa44глуКвадрСтильРисованияFPS3lib4mesa10GLUquadrickZv", биб);

		//вяжи(функция_977)("_D3lib4mesa44глутКаркасныйДодекаэдрFZv", биб);

		//вяжи(функция_978)("_D3lib4mesa44глутОсобаяФункцОтжатияFPUiiiZvZv", биб);

		//вяжи(функция_979)("_D3lib4mesa44глутПерейдиВЗаписьМенюFiPaiZv", биб);

		//вяжи(функция_980)("_D3lib4mesa44глутФункцСостоянияМенюFPUiZvZv", биб);

		//вяжи(функция_981)("_D3lib4mesa45глКопируйПодобразТекс1МFkiiiiiZv", биб);

		//вяжи(функция_982)("_D3lib4mesa45глКопируйПодобразТекс2МFkiiiiiiiZv", биб);

		//вяжи(функция_983)("_D3lib4mesa45глРезидентныТекстуры_лиFiPkPhZh", биб);

		//вяжи(функция_984)("_D3lib4mesa46глДайПараметрУровняТексFkikPfZv", биб);

		//вяжи(функция_985)("_D3lib4mesa46глДайПараметрУровняТексFkikPiZv", биб);

		//вяжи(функция_986)("_D3lib4mesa46глуТессЗавершиМногогранFPS3lib4mesa13GLUtesselatorZv", биб);

		//вяжи(функция_987)("_D3lib4mesa46глутФункцДвиженияТаблетFPUiiZvZv", биб);

		//вяжи(функция_988)("_D3lib4mesa46глутФункцОтжатияКлавишиFPUaiiZvZv", биб);

		//вяжи(функция_989)("_D3lib4mesa46глутФункцПоказаНакладкиFPUZvZv", биб);

		//вяжи(функция_990)("_D3lib4mesa47глуПострой1МУровниМипмапFkiikkiiiPvZi", биб);

		//вяжи(функция_991)("_D3lib4mesa47глуПострой3МУровниМипмапFkiiiikkiiiPvZi", биб);

		//вяжи(функция_992)("_D3lib4mesa48глВключиСостояниеКлиентаFkZv", биб);

		//вяжи(функция_993)("_D3lib4mesa48глуНовыйОтобразительНурбFZPS3lib4mesa8GLUnurbs", биб);

		//вяжи(функция_994)("_D3lib4mesa48глуУдалиОтобразительНурбFPS3lib4mesa8GLUnurbsZv", биб);

		//вяжи(функция_995)("_D3lib4mesa48глутОстановиПеремерВидеоFZv", биб);

		//вяжи(функция_996)("_D3lib4mesa48глутУстановиПеремерВидеоFZv", биб);

		//вяжи(функция_997)("_D3lib4mesa49глуПострой2МУровениМипмапFiiiikkiiiPvZi", биб);

		//вяжи(функция_998)("_D3lib4mesa50глОтключиСостояниеКлиентаFkZv", биб);

		//вяжи(функция_999)("_D3lib4mesa50глуДанныеОбрвызоваНурбДОПFPS3lib4mesa8GLUnurbsPvZv", биб);

		//вяжи(функция_1000)("_D3lib4mesa50глутПерепоказНакладкиОкнаFiZv", биб);

		//вяжи(функция_1001)("_D3lib4mesa50глутУстановиПовторКлавишиFiZv", биб);

		//вяжи(функция_1002)("_D3lib4mesa52глуЗагрузиМатрицыСемплингаFPS3lib4mesa8GLUnurbsPfPfPiZv", биб);

		//вяжи(функция_1003)("_D3lib4mesa52глутИгнорируйПовторКлавишиFiZv", биб);

		//вяжи(функция_1004)("_D3lib4mesa52глутФорсируйФункцДжойстикаFZv", биб);

		//вяжи(функция_1005)("_D3lib4mesa56глутПоддерживаемыеРасширенияFPaZi", биб);

		//вяжи(функция_1006)("_D3lib4mesa56глутФункцКнопкаНебесногоТелаFPUiiZvZv", биб);

		//вяжи(функция_1007)("_D3lib4mesa58глутФункцияПассивногоДвиженияFPUiiZvZv", биб);

		//вяжи(функция_1008)("_D3lib4mesa60глутФункцВращенияНебесногоТелаFPUiiiZvZv", биб);

	}

ЖанБибгр DINRUS_MESA;

		static this()
		{
			DINRUS_MESA.заряжай("Dinrus.Mesa.dll", &грузи );
		}

	extern(C)
	{


		//проц function(   ) функция_1; 

		//проц function(   ) функция_2; 

		//проц function(   ) функция_3; 

		//проц function(   ) функция_4; 

		//проц function(   ) функция_5; 

		//проц function(   ) функция_6; 

		//проц function(   ) функция_7; 

		//проц function(   ) функция_8; 

		//проц function(   ) функция_9; 

		//проц function(   ) функция_10; 

		//проц function(   ) функция_11; 

		//проц function(   ) функция_12; 

		//проц function(   ) функция_13; 

		//проц function(   ) функция_14; 

		//проц function(   ) функция_15; 

		//проц function(   ) функция_16; 

		//проц function(   ) функция_17; 

		//проц function(   ) функция_18; 

		//проц function(   ) функция_19; 

		//проц function(   ) функция_20; 

		//проц function(   ) функция_21; 

		//проц function(   ) функция_22; 

		//проц function(   ) функция_23; 

		//проц function(   ) функция_24; 

		//проц function(   ) функция_25; 

		//проц function(   ) функция_26; 

		//проц function(   ) функция_27; 

		//проц function(   ) функция_28; 

		//проц function(   ) функция_29; 

		//проц function(   ) функция_30; 

		//проц function(   ) функция_31; 

		//проц function(   ) функция_32; 

		//проц function(   ) функция_33; 

		//проц function(   ) функция_34; 

		//проц function(   ) функция_35; 

		//проц function(   ) функция_36; 

		//проц function(   ) функция_37; 

		//проц function(   ) функция_38; 

		//проц function(   ) функция_39; 

		//проц function(   ) функция_40; 

		//проц function(   ) функция_41; 

		//проц function(   ) функция_42; 

		//проц function(   ) функция_43; 

		//проц function(   ) функция_44; 

		//проц function(   ) функция_45; 

		//проц function(   ) функция_46; 

		//проц function(   ) функция_47; 

		//проц function(   ) функция_48; 

		//проц function(   ) функция_49; 

		//проц function(   ) функция_50; 

		//проц function(   ) функция_51; 

		//проц function(   ) функция_52; 

		//проц function(   ) функция_53; 

		//проц function(   ) функция_54; 

		//проц function(   ) функция_55; 

		//проц function(   ) функция_56; 

		//проц function(   ) функция_57; 

		//проц function(   ) функция_58; 

		//проц function(   ) функция_59; 

		//проц function(   ) функция_60; 

		//проц function(   ) функция_61; 

		//проц function(   ) функция_62; 

		//проц function(   ) функция_63; 

		//проц function(   ) функция_64; 

		//проц function(   ) функция_65; 

		//проц function(   ) функция_66; 

		//проц function(   ) функция_67; 

		//проц function(   ) функция_68; 

		//проц function(   ) функция_69; 

		//проц function(   ) функция_70; 

		//проц function(   ) функция_71; 

		//проц function(   ) функция_72; 

		//проц function(   ) функция_73; 

		//проц function(   ) функция_74; 

		//проц function(   ) функция_75; 

		//проц function(   ) функция_76; 

		//проц function(   ) функция_77; 

		//проц function(   ) функция_78; 

		//проц function(   ) функция_79; 

		//проц function(   ) функция_80; 

		//проц function(   ) функция_81; 

		//проц function(   ) функция_82; 

		//проц function(   ) функция_83; 

		//проц function(   ) функция_84; 

		//проц function(   ) функция_85; 

		//проц function(   ) функция_86; 

		//проц function(   ) функция_87; 

		//проц function(   ) функция_88; 

		//проц function(   ) функция_89; 

		//проц function(   ) функция_90; 

		//проц function(   ) функция_91; 

		//проц function(   ) функция_92; 

		//проц function(   ) функция_93; 

		//проц function(   ) функция_94; 

		//проц function(   ) функция_95; 

		//проц function(   ) функция_96; 

		//проц function(   ) функция_97; 

		//проц function(   ) функция_98; 

		//проц function(   ) функция_99; 

		//проц function(   ) функция_100; 

		//проц function(   ) функция_101; 

		//проц function(   ) функция_102; 

		//проц function(   ) функция_103; 

		//проц function(   ) функция_104; 

		//проц function(   ) функция_105; 

		//проц function(   ) функция_106; 

		//проц function(   ) функция_107; 

		//проц function(   ) функция_108; 

		//проц function(   ) функция_109; 

		//проц function(   ) функция_110; 

		//проц function(   ) функция_111; 

		//проц function(   ) функция_112; 

		//проц function(   ) функция_113; 

		//проц function(   ) функция_114; 

		//проц function(   ) функция_115; 

		//проц function(   ) функция_116; 

		//проц function(   ) функция_117; 

		//проц function(   ) функция_118; 

		//проц function(   ) функция_119; 

		//проц function(   ) функция_120; 

		//проц function(   ) функция_121; 

		//проц function(   ) функция_122; 

		//проц function(   ) функция_123; 

		//проц function(   ) функция_124; 

		//проц function(   ) функция_125; 

		//проц function(   ) функция_126; 

		//проц function(   ) функция_127; 

		//проц function(   ) функция_128; 

		//проц function(   ) функция_129; 

		//проц function(   ) функция_130; 

		//проц function(   ) функция_131; 

		//проц function(   ) функция_132; 

		//проц function(   ) функция_133; 

		//проц function(   ) функция_134; 

		//проц function(   ) функция_135; 

		//проц function(   ) функция_136; 

		//проц function(   ) функция_137; 

		//проц function(   ) функция_138; 

		//проц function(   ) функция_139; 

		//проц function(   ) функция_140; 

		//проц function(   ) функция_141; 

		//проц function(   ) функция_142; 

		//проц function(   ) функция_143; 

		//проц function(   ) функция_144; 

		//проц function(   ) функция_145; 

		//проц function(   ) функция_146; 

		//проц function(   ) функция_147; 

		//проц function(   ) функция_148; 

		//проц function(   ) функция_149; 

		//проц function(   ) функция_150; 

		//проц function(   ) функция_151; 

		//проц function(   ) функция_152; 

		//проц function(   ) функция_153; 

		//проц function(   ) функция_154; 

		//проц function(   ) функция_155; 

		//проц function(   ) функция_156; 

		//проц function(   ) функция_157; 

		//проц function(   ) функция_158; 

		//проц function(   ) функция_159; 

		//проц function(   ) функция_160; 

		//проц function(   ) функция_161; 

		//проц function(   ) функция_162; 

		//проц function(   ) функция_163; 

		//проц function(   ) функция_164; 

		//проц function(   ) функция_165; 

		//проц function(   ) функция_166; 

		//проц function(   ) функция_167; 

		//проц function(   ) функция_168; 

		//проц function(   ) функция_169; 

		//проц function(   ) функция_170; 

		//проц function(   ) функция_171; 

		//проц function(   ) функция_172; 

		//проц function(   ) функция_173; 

		//проц function(   ) функция_174; 

		//проц function(   ) функция_175; 

		//проц function(   ) функция_176; 

		//проц function(   ) функция_177; 

		//проц function(   ) функция_178; 

		//проц function(   ) функция_179; 

		//проц function(   ) функция_180; 

		//проц function(   ) функция_181; 

		//проц function(   ) функция_182; 

		//проц function(   ) функция_183; 

		//проц function(   ) функция_184; 

		//проц function(   ) функция_185; 

		//проц function(   ) функция_186; 

		//проц function(   ) функция_187; 

		//проц function(   ) функция_188; 

		//проц function(   ) функция_189; 

		//проц function(   ) функция_190; 

		//проц function(   ) функция_191; 

		//проц function(   ) функция_192; 

		//проц function(   ) функция_193; 

		//проц function(   ) функция_194; 

		//проц function(   ) функция_195; 

		//проц function(   ) функция_196; 

		//проц function(   ) функция_197; 

		//проц function(   ) функция_198; 

		//проц function(   ) функция_199; 

		//проц function(   ) функция_200; 

		//проц function(   ) функция_201; 

		//проц function(   ) функция_202; 

		//проц function(   ) функция_203; 

		//проц function(   ) функция_204; 

		//проц function(   ) функция_205; 

		//проц function(   ) функция_206; 

		//проц function(   ) функция_207; 

		//проц function(   ) функция_208; 

		//проц function(   ) функция_209; 

		//проц function(   ) функция_210; 

		//проц function(   ) функция_211; 

		//проц function(   ) функция_212; 

		//проц function(   ) функция_213; 

		//проц function(   ) функция_214; 

		//проц function(   ) функция_215; 

		//проц function(   ) функция_216; 

		//проц function(   ) функция_217; 

		//проц function(   ) функция_218; 

		//проц function(   ) функция_219; 

		//проц function(   ) функция_220; 

		//проц function(   ) функция_221; 

		//проц function(   ) функция_222; 

		//проц function(   ) функция_223; 

		//проц function(   ) функция_224; 

		//проц function(   ) функция_225; 

		//проц function(   ) функция_226; 

		//проц function(   ) функция_227; 

		//проц function(   ) функция_228; 

		//проц function(   ) функция_229; 

		//проц function(   ) функция_230; 

		//проц function(   ) функция_231; 

		//проц function(   ) функция_232; 

		//проц function(   ) функция_233; 

		//проц function(   ) функция_234; 

		//проц function(   ) функция_235; 

		//проц function(   ) функция_236; 

		//проц function(   ) функция_237; 

		//проц function(   ) функция_238; 

		//проц function(   ) функция_239; 

		//проц function(   ) функция_240; 

		//проц function(   ) функция_241; 

		//проц function(   ) функция_242; 

		//проц function(   ) функция_243; 

		//проц function(   ) функция_244; 

		//проц function(   ) функция_245; 

		//проц function(   ) функция_246; 

		//проц function(   ) функция_247; 

		//проц function(   ) функция_248; 

		//проц function(   ) функция_249; 

		//проц function(   ) функция_250; 

		//проц function(   ) функция_251; 

		//проц function(   ) функция_252; 

		//проц function(   ) функция_253; 

		//проц function(   ) функция_254; 

		//проц function(   ) функция_255; 

		//проц function(   ) функция_256; 

		//проц function(   ) функция_257; 

		//проц function(   ) функция_258; 

		//проц function(   ) функция_259; 

		//проц function(   ) функция_260; 

		//проц function(   ) функция_261; 

		//проц function(   ) функция_262; 

		//проц function(   ) функция_263; 

		//проц function(   ) функция_264; 

		//проц function(   ) функция_265; 

		//проц function(   ) функция_266; 

		//проц function(   ) функция_267; 

		//проц function(   ) функция_268; 

		//проц function(   ) функция_269; 

		//проц function(   ) функция_270; 

		//проц function(   ) функция_271; 

		//проц function(   ) функция_272; 

		//проц function(   ) функция_273; 

		//проц function(   ) функция_274; 

		//проц function(   ) функция_275; 

		//проц function(   ) функция_276; 

		//проц function(   ) функция_277; 

		//проц function(   ) функция_278; 

		//проц function(   ) функция_279; 

		//проц function(   ) функция_280; 

		//проц function(   ) функция_281; 

		//проц function(   ) функция_282; 

		//проц function(   ) функция_283; 

		//проц function(   ) функция_284; 

		//проц function(   ) функция_285; 

		//проц function(   ) функция_286; 

		//проц function(   ) функция_287; 

		//проц function(   ) функция_288; 

		//проц function(   ) функция_289; 

		//проц function(   ) функция_290; 

		//проц function(   ) функция_291; 

		//проц function(   ) функция_292; 

		//проц function(   ) функция_293; 

		//проц function(   ) функция_294; 

		//проц function(   ) функция_295; 

		//проц function(   ) функция_296; 

		//проц function(   ) функция_297; 

		//проц function(   ) функция_298; 

		//проц function(   ) функция_299; 

		//проц function(   ) функция_300; 

		//проц function(   ) функция_301; 

		//проц function(   ) функция_302; 

		//проц function(   ) функция_303; 

		//проц function(   ) функция_304; 

		//проц function(   ) функция_305; 

		//проц function(   ) функция_306; 

		//проц function(   ) функция_307; 

		//проц function(   ) функция_308; 

		//проц function(   ) функция_309; 

		//проц function(   ) функция_310; 

		//проц function(   ) функция_311; 

		//проц function(   ) функция_312; 

		//проц function(   ) функция_313; 

		//проц function(   ) функция_314; 

		//проц function(   ) функция_315; 

		//проц function(   ) функция_316; 

		//проц function(   ) функция_317; 

		//проц function(   ) функция_318; 

		//проц function(   ) функция_319; 

		//проц function(   ) функция_320; 

		//проц function(   ) функция_321; 

		//проц function(   ) функция_322; 

		//проц function(   ) функция_323; 

		//проц function(   ) функция_324; 

		//проц function(   ) функция_325; 

		//проц function(   ) функция_326; 

		//проц function(   ) функция_327; 

		//проц function(   ) функция_328; 

		//проц function(   ) функция_329; 

		//проц function(   ) функция_330; 

		//проц function(   ) функция_331; 

		//проц function(   ) функция_332; 

		//проц function(   ) функция_333; 

		//проц function(   ) функция_334; 

		//проц function(   ) функция_335; 

		//проц function(   ) функция_336; 

		//проц function(   ) функция_337; 

		//проц function(   ) функция_338; 

		//проц function(   ) функция_339; 

		//проц function(   ) функция_340; 

		//проц function(   ) функция_341; 

		//проц function(   ) функция_342; 

		//проц function(   ) функция_343; 

		//проц function(   ) функция_344; 

		//проц function(   ) функция_345; 

		//проц function(   ) функция_346; 

		//проц function(   ) функция_347; 

		//проц function(   ) функция_348; 

		//проц function(   ) функция_349; 

		//проц function(   ) функция_350; 

		//проц function(   ) функция_351; 

		//проц function(   ) функция_352; 

		//проц function(   ) функция_353; 

		//проц function(   ) функция_354; 

		//проц function(   ) функция_355; 

		//проц function(   ) функция_356; 

		//проц function(   ) функция_357; 

		//проц function(   ) функция_358; 

		//проц function(   ) функция_359; 

		//проц function(   ) функция_360; 

		//проц function(   ) функция_361; 

		//проц function(   ) функция_362; 

		//проц function(   ) функция_363; 

		//проц function(   ) функция_364; 

		//проц function(   ) функция_365; 

		//проц function(   ) функция_366; 

		//проц function(   ) функция_367; 

		//проц function(   ) функция_368; 

		//проц function(   ) функция_369; 

		//проц function(   ) функция_370; 

		//проц function(   ) функция_371; 

		//проц function(   ) функция_372; 

		//проц function(   ) функция_373; 

		//проц function(   ) функция_374; 

		//проц function(   ) функция_375; 

		//проц function(   ) функция_376; 

		//проц function(   ) функция_377; 

		//проц function(   ) функция_378; 

		//проц function(   ) функция_379; 

		//проц function(   ) функция_380; 

		//проц function(   ) функция_381; 

		//проц function(   ) функция_382; 

		//проц function(   ) функция_383; 

		//проц function(   ) функция_384; 

		//проц function(   ) функция_385; 

		//проц function(   ) функция_386; 

		//проц function(   ) функция_387; 

		//проц function(   ) функция_388; 

		//проц function(   ) функция_389; 

		//проц function(   ) функция_390; 

		//проц function(   ) функция_391; 

		//проц function(   ) функция_392; 

		//проц function(   ) функция_393; 

		//проц function(   ) функция_394; 

		//проц function(   ) функция_395; 

		//проц function(   ) функция_396; 

		//проц function(   ) функция_397; 

		//проц function(   ) функция_398; 

		//проц function(   ) функция_399; 

		//проц function(   ) функция_400; 

		//проц function(   ) функция_401; 

		//проц function(   ) функция_402; 

		//проц function(   ) функция_403; 

		//проц function(   ) функция_404; 

		//проц function(   ) функция_405; 

		//проц function(   ) функция_406; 

		//проц function(   ) функция_407; 

		//проц function(   ) функция_408; 

		//проц function(   ) функция_409; 

		//проц function(   ) функция_410; 

		//проц function(   ) функция_411; 

		//проц function(   ) функция_412; 

		//проц function(   ) функция_413; 

		//проц function(   ) функция_414; 

		//проц function(   ) функция_415; 

		//проц function(   ) функция_416; 

		//проц function(   ) функция_417; 

		//проц function(   ) функция_418; 

		//проц function(   ) функция_419; 

		//проц function(   ) функция_420; 

		//проц function(   ) функция_421; 

		//проц function(   ) функция_422; 

		//проц function(   ) функция_423; 

		//проц function(   ) функция_424; 

		//проц function(   ) функция_425; 

		//проц function(   ) функция_426; 

		//проц function(   ) функция_427; 

		//проц function(   ) функция_428; 

		//проц function(   ) функция_429; 

		//проц function(   ) функция_430; 

		//проц function(   ) функция_431; 

		//проц function(   ) функция_432; 

		//проц function(   ) функция_433; 

		//проц function(   ) функция_434; 

		//проц function(   ) функция_435; 

		//проц function(   ) функция_436; 

		//проц function(   ) функция_437; 

		//проц function(   ) функция_438; 

		//проц function(   ) функция_439; 

		//проц function(   ) функция_440; 

		//проц function(   ) функция_441; 

		//проц function(   ) функция_442; 

		//проц function(   ) функция_443; 

		//проц function(   ) функция_444; 

		//проц function(   ) функция_445; 

		//проц function(   ) функция_446; 

		//проц function(   ) функция_447; 

		//проц function(   ) функция_448; 

		//проц function(   ) функция_449; 

		//проц function(   ) функция_450; 

		//проц function(   ) функция_451; 

		//проц function(   ) функция_452; 

		//проц function(   ) функция_453; 

		//проц function(   ) функция_454; 

		//проц function(   ) функция_455; 

		//проц function(   ) функция_456; 

		//проц function(   ) функция_457; 

		//проц function(   ) функция_458; 

		//проц function(   ) функция_459; 

		//проц function(   ) функция_460; 

		//проц function(   ) функция_461; 

		//проц function(   ) функция_462; 

		//проц function(   ) функция_463; 

		//проц function(   ) функция_464; 

		//проц function(   ) функция_465; 

		//проц function(   ) функция_466; 

		//проц function(   ) функция_467; 

		//проц function(   ) функция_468; 

		//проц function(   ) функция_469; 

		//проц function(   ) функция_470; 

		//проц function(   ) функция_471; 

		//проц function(   ) функция_472; 

		//проц function(   ) функция_473; 

		//проц function(   ) функция_474; 

		//проц function(   ) функция_475; 

		//проц function(   ) функция_476; 

		//проц function(   ) функция_477; 

		//проц function(   ) функция_478; 

		//проц function(   ) функция_479; 

		//проц function(   ) функция_480; 

		//проц function(   ) функция_481; 

		//проц function(   ) функция_482; 

		//проц function(   ) функция_483; 

		//проц function(   ) функция_484; 

		//проц function(   ) функция_485; 

		//проц function(   ) функция_486; 

		//проц function(   ) функция_487; 

		//проц function(   ) функция_488; 

		//проц function(   ) функция_489; 

		//проц function(   ) функция_490; 

		//проц function(   ) функция_491; 

		//проц function(   ) функция_492; 

		//проц function(   ) функция_493; 

		//проц function(   ) функция_494; 

		//проц function(   ) функция_495; 

		//проц function(   ) функция_496; 

		//проц function(   ) функция_497; 

		//проц function(   ) функция_498; 

		//проц function(   ) функция_499; 

		//проц function(   ) функция_500; 

		//проц function(   ) функция_501; 

		//проц function(   ) функция_502; 

		//проц function(   ) функция_503; 

		//проц function(   ) функция_504; 

		//проц function(   ) функция_505; 

		//проц function(   ) функция_506; 

		//проц function(   ) функция_507; 

		//проц function(   ) функция_508; 

		//проц function(   ) функция_509; 

		//проц function(   ) функция_510; 

		//проц function(   ) функция_511; 

		//проц function(   ) функция_512; 

		//проц function(   ) функция_513; 

		//проц function(   ) функция_514; 

		//проц function(   ) функция_515; 

		//проц function(   ) функция_516; 

		//проц function(   ) функция_517; 

		//проц function(   ) функция_518; 

		//проц function(   ) функция_519; 

		//проц function(   ) функция_520; 

		//проц function(   ) функция_521; 

		//проц function(   ) функция_522; 

		//проц function(   ) функция_523; 

		//проц function(   ) функция_524; 

		//проц function(   ) функция_525; 

		//проц function(   ) функция_526; 

		//проц function(   ) функция_527; 

		//проц function(   ) функция_528; 

		//проц function(   ) функция_529; 

		//проц function(   ) функция_530; 

		//проц function(   ) функция_531; 

		//проц function(   ) функция_532; 

		//проц function(   ) функция_533; 

		//проц function(   ) функция_534; 

		//проц function(   ) функция_535; 

		//проц function(   ) функция_536; 

		//проц function(   ) функция_537; 

		//проц function(   ) функция_538; 

		//проц function(   ) функция_539; 

		//проц function(   ) функция_540; 

		//проц function(   ) функция_541; 

		//проц function(   ) функция_542; 

		//проц function(   ) функция_543; 

		//проц function(   ) функция_544; 

		//проц function(   ) функция_545; 

		//проц function(   ) функция_546; 

		//проц function(   ) функция_547; 

		//проц function(   ) функция_548; 

		//проц function(   ) функция_549; 

		//проц function(   ) функция_550; 

		//проц function(   ) функция_551; 

		//проц function(   ) функция_552; 

		//проц function(   ) функция_553; 

		//проц function(   ) функция_554; 

		//проц function(   ) функция_555; 

		//проц function(   ) функция_556; 

		//проц function(   ) функция_557; 

		//проц function(   ) функция_558; 

		//проц function(   ) функция_559; 

		//проц function(   ) функция_560; 

		//проц function(   ) функция_561; 

		//проц function(   ) функция_562; 

		//проц function(   ) функция_563; 

		//проц function(   ) функция_564; 

		//проц function(   ) функция_565; 

		//проц function(   ) функция_566; 

		//проц function(   ) функция_567; 

		//проц function(   ) функция_568; 

		//проц function(   ) функция_569; 

		//проц function(   ) функция_570; 

		//проц function(   ) функция_571; 

		//проц function(   ) функция_572; 

		//проц function(   ) функция_573; 

		//проц function(   ) функция_574; 

		//проц function(   ) функция_575; 

		//проц function(   ) функция_576; 

		//проц function(   ) функция_577; 

		//проц function(   ) функция_578; 

		//проц function(   ) функция_579; 

		//проц function(   ) функция_580; 

		//проц function(   ) функция_581; 

		//проц function(   ) функция_582; 

		//проц function(   ) функция_583; 

		//проц function(   ) функция_584; 

		//проц function(   ) функция_585; 

		//проц function(   ) функция_586; 

		//проц function(   ) функция_587; 

		//проц function(   ) функция_588; 

		//проц function(   ) функция_589; 

		//проц function(   ) функция_590; 

		//проц function(   ) функция_591; 

		//проц function(   ) функция_592; 

		//проц function(   ) функция_593; 

		//проц function(   ) функция_594; 

		//проц function(   ) функция_595; 

		//проц function(   ) функция_596; 

		//проц function(   ) функция_597; 

		//проц function(   ) функция_598; 

		//проц function(   ) функция_599; 

		//проц function(   ) функция_600; 

		//проц function(   ) функция_601; 

		//проц function(   ) функция_602; 

		//проц function(   ) функция_603; 

		//проц function(   ) функция_604; 

		//проц function(   ) функция_605; 

		//проц function(   ) функция_606; 

		//проц function(   ) функция_607; 

		//проц function(   ) функция_608; 

		//проц function(   ) функция_609; 

		//проц function(   ) функция_610; 

		//проц function(   ) функция_611; 

		//проц function(   ) функция_612; 

		//проц function(   ) функция_613; 

		//проц function(   ) функция_614; 

		//проц function(   ) функция_615; 

		//проц function(   ) функция_616; 

		//проц function(   ) функция_617; 

		//проц function(   ) функция_618; 

		//проц function(   ) функция_619; 

		//проц function(   ) функция_620; 

		//проц function(   ) функция_621; 

		//проц function(   ) функция_622; 

		//проц function(   ) функция_623; 

		//проц function(   ) функция_624; 

		//проц function(   ) функция_625; 

		//проц function(   ) функция_626; 

		//проц function(   ) функция_627; 

		//проц function(   ) функция_628; 

		//проц function(   ) функция_629; 

		//проц function(   ) функция_630; 

		//проц function(   ) функция_631; 

		//проц function(   ) функция_632; 

		//проц function(   ) функция_633; 

		//проц function(   ) функция_634; 

		//проц function(   ) функция_635; 

		//проц function(   ) функция_636; 

		//проц function(   ) функция_637; 

		//проц function(   ) функция_638; 

		//проц function(   ) функция_639; 

		//проц function(   ) функция_640; 

		//проц function(   ) функция_641; 

		//проц function(   ) функция_642; 

		//проц function(   ) функция_643; 

		//проц function(   ) функция_644; 

		//проц function(   ) функция_645; 

		//проц function(   ) функция_646; 

		//проц function(   ) функция_647; 

		//проц function(   ) функция_648; 

		//проц function(   ) функция_649; 

		//проц function(   ) функция_650; 

		//проц function(   ) функция_651; 

		//проц function(   ) функция_652; 

		//проц function(   ) функция_653; 

		//проц function(   ) функция_654; 

		//проц function(   ) функция_655; 

		//проц function(   ) функция_656; 

		//проц function(   ) функция_657; 

		//проц function(   ) функция_658; 

		//проц function(   ) функция_659; 

		//проц function(   ) функция_660; 

		//проц function(   ) функция_661; 

		//проц function(   ) функция_662; 

		//проц function(   ) функция_663; 

		//проц function(   ) функция_664; 

		//проц function(   ) функция_665; 

		//проц function(   ) функция_666; 

		//проц function(   ) функция_667; 

		//проц function(   ) функция_668; 

		//проц function(   ) функция_669; 

		//проц function(   ) функция_670; 

		//проц function(   ) функция_671; 

		//проц function(   ) функция_672; 

		//проц function(   ) функция_673; 

		//проц function(   ) функция_674; 

		//проц function(   ) функция_675; 

		//проц function(   ) функция_676; 

		//проц function(   ) функция_677; 

		//проц function(   ) функция_678; 

		//проц function(   ) функция_679; 

		//проц function(   ) функция_680; 

		//проц function(   ) функция_681; 

		//проц function(   ) функция_682; 

		//проц function(   ) функция_683; 

		//проц function(   ) функция_684; 

		//проц function(   ) функция_685; 

		//проц function(   ) функция_686; 

		//проц function(   ) функция_687; 

		//проц function(   ) функция_688; 

		//проц function(   ) функция_689; 

		//проц function(   ) функция_690; 

		//проц function(   ) функция_691; 

		//проц function(   ) функция_692; 

		//проц function(   ) функция_693; 

		//проц function(   ) функция_694; 

		//проц function(   ) функция_695; 

		//проц function(   ) функция_696; 

		//проц function(   ) функция_697; 

		//проц function(   ) функция_698; 

		//проц function(   ) функция_699; 

		//проц function(   ) функция_700; 

		//проц function(   ) функция_701; 

		//проц function(   ) функция_702; 

		//проц function(   ) функция_703; 

		//проц function(   ) функция_704; 

		//проц function(   ) функция_705; 

		//проц function(   ) функция_706; 

		//проц function(   ) функция_707; 

		//проц function(   ) функция_708; 

		//проц function(   ) функция_709; 

		//проц function(   ) функция_710; 

		//проц function(   ) функция_711; 

		//проц function(   ) функция_712; 

		//проц function(   ) функция_713; 

		//проц function(   ) функция_714; 

		//проц function(   ) функция_715; 

		//проц function(   ) функция_716; 

		//проц function(   ) функция_717; 

		//проц function(   ) функция_718; 

		//проц function(   ) функция_719; 

		//проц function(   ) функция_720; 

		//проц function(   ) функция_721; 

		//проц function(   ) функция_722; 

		//проц function(   ) функция_723; 

		//проц function(   ) функция_724; 

		//проц function(   ) функция_725; 

		//проц function(   ) функция_726; 

		//проц function(   ) функция_727; 

		//проц function(   ) функция_728; 

		//проц function(   ) функция_729; 

		//проц function(   ) функция_730; 

		//проц function(   ) функция_731; 

		//проц function(   ) функция_732; 

		//проц function(   ) функция_733; 

		//проц function(   ) функция_734; 

		//проц function(   ) функция_735; 

		//проц function(   ) функция_736; 

		//проц function(   ) функция_737; 

		//проц function(   ) функция_738; 

		//проц function(   ) функция_739; 

		//проц function(   ) функция_740; 

		//проц function(   ) функция_741; 

		//проц function(   ) функция_742; 

		//проц function(   ) функция_743; 

		//проц function(   ) функция_744; 

		//проц function(   ) функция_745; 

		//проц function(   ) функция_746; 

		//проц function(   ) функция_747; 

		//проц function(   ) функция_748; 

		//проц function(   ) функция_749; 

		//проц function(   ) функция_750; 

		//проц function(   ) функция_751; 

		//проц function(   ) функция_752; 

		//проц function(   ) функция_753; 

		//проц function(   ) функция_754; 

		//проц function(   ) функция_755; 

		//проц function(   ) функция_756; 

		//проц function(   ) функция_757; 

		//проц function(   ) функция_758; 

		//проц function(   ) функция_759; 

		//проц function(   ) функция_760; 

		//проц function(   ) функция_761; 

		//проц function(   ) функция_762; 

		//проц function(   ) функция_763; 

		//проц function(   ) функция_764; 

		//проц function(   ) функция_765; 

		//проц function(   ) функция_766; 

		//проц function(   ) функция_767; 

		//проц function(   ) функция_768; 

		//проц function(   ) функция_769; 

		//проц function(   ) функция_770; 

		//проц function(   ) функция_771; 

		//проц function(   ) функция_772; 

		//проц function(   ) функция_773; 

		//проц function(   ) функция_774; 

		//проц function(   ) функция_775; 

		//проц function(   ) функция_776; 

		//проц function(   ) функция_777; 

		//проц function(   ) функция_778; 

		//проц function(   ) функция_779; 

		//проц function(   ) функция_780; 

		//проц function(   ) функция_781; 

		//проц function(   ) функция_782; 

		//проц function(   ) функция_783; 

		//проц function(   ) функция_784; 

		//проц function(   ) функция_785; 

		//проц function(   ) функция_786; 

		//проц function(   ) функция_787; 

		//проц function(   ) функция_788; 

		//проц function(   ) функция_789; 

		//проц function(   ) функция_790; 

		//проц function(   ) функция_791; 

		//проц function(   ) функция_792; 

		//проц function(   ) функция_793; 

		//проц function(   ) функция_794; 

		//проц function(   ) функция_795; 

		//проц function(   ) функция_796; 

		//проц function(   ) функция_797; 

		//проц function(   ) функция_798; 

		//проц function(   ) функция_799; 

		//проц function(   ) функция_800; 

		//проц function(   ) функция_801; 

		//проц function(   ) функция_802; 

		//проц function(   ) функция_803; 

		//проц function(   ) функция_804; 

		//проц function(   ) функция_805; 

		//проц function(   ) функция_806; 

		//проц function(   ) функция_807; 

		//проц function(   ) функция_808; 

		//проц function(   ) функция_809; 

		//проц function(   ) функция_810; 

		//проц function(   ) функция_811; 

		//проц function(   ) функция_812; 

		//проц function(   ) функция_813; 

		//проц function(   ) функция_814; 

		//проц function(   ) функция_815; 

		//проц function(   ) функция_816; 

		//проц function(   ) функция_817; 

		//проц function(   ) функция_818; 

		//проц function(   ) функция_819; 

		//проц function(   ) функция_820; 

		//проц function(   ) функция_821; 

		//проц function(   ) функция_822; 

		//проц function(   ) функция_823; 

		//проц function(   ) функция_824; 

		//проц function(   ) функция_825; 

		//проц function(   ) функция_826; 

		//проц function(   ) функция_827; 

		//проц function(   ) функция_828; 

		//проц function(   ) функция_829; 

		//проц function(   ) функция_830; 

		//проц function(   ) функция_831; 

		//проц function(   ) функция_832; 

		//проц function(   ) функция_833; 

		//проц function(   ) функция_834; 

		//проц function(   ) функция_835; 

		//проц function(   ) функция_836; 

		//проц function(   ) функция_837; 

		//проц function(   ) функция_838; 

		//проц function(   ) функция_839; 

		//проц function(   ) функция_840; 

		//проц function(   ) функция_841; 

		//проц function(   ) функция_842; 

		//проц function(   ) функция_843; 

		//проц function(   ) функция_844; 

		//проц function(   ) функция_845; 

		//проц function(   ) функция_846; 

		//проц function(   ) функция_847; 

		//проц function(   ) функция_848; 

		//проц function(   ) функция_849; 

		//проц function(   ) функция_850; 

		//проц function(   ) функция_851; 

		//проц function(   ) функция_852; 

		//проц function(   ) функция_853; 

		//проц function(   ) функция_854; 

		//проц function(   ) функция_855; 

		//проц function(   ) функция_856; 

		//проц function(   ) функция_857; 

		//проц function(   ) функция_858; 

		//проц function(   ) функция_859; 

		//проц function(   ) функция_860; 

		//проц function(   ) функция_861; 

		//проц function(   ) функция_862; 

		//проц function(   ) функция_863; 

		//проц function(   ) функция_864; 

		//проц function(   ) функция_865; 

		//проц function(   ) функция_866; 

		//проц function(   ) функция_867; 

		//проц function(   ) функция_868; 

		//проц function(   ) функция_869; 

		//проц function(   ) функция_870; 

		//проц function(   ) функция_871; 

		//проц function(   ) функция_872; 

		//проц function(   ) функция_873; 

		//проц function(   ) функция_874; 

		//проц function(   ) функция_875; 

		//проц function(   ) функция_876; 

		//проц function(   ) функция_877; 

		//проц function(   ) функция_878; 

		//проц function(   ) функция_879; 

		//проц function(   ) функция_880; 

		//проц function(   ) функция_881; 

		//проц function(   ) функция_882; 

		//проц function(   ) функция_883; 

		//проц function(   ) функция_884; 

		//проц function(   ) функция_885; 

		//проц function(   ) функция_886; 

		//проц function(   ) функция_887; 

		//проц function(   ) функция_888; 

		//проц function(   ) функция_889; 

		//проц function(   ) функция_890; 

		//проц function(   ) функция_891; 

		//проц function(   ) функция_892; 

		//проц function(   ) функция_893; 

		//проц function(   ) функция_894; 

		//проц function(   ) функция_895; 

		//проц function(   ) функция_896; 

		//проц function(   ) функция_897; 

		//проц function(   ) функция_898; 

		//проц function(   ) функция_899; 

		//проц function(   ) функция_900; 

		//проц function(   ) функция_901; 

		//проц function(   ) функция_902; 

		//проц function(   ) функция_903; 

		//проц function(   ) функция_904; 

		//проц function(   ) функция_905; 

		//проц function(   ) функция_906; 

		//проц function(   ) функция_907; 

		//проц function(   ) функция_908; 

		//проц function(   ) функция_909; 

		//проц function(   ) функция_910; 

		//проц function(   ) функция_911; 

		//проц function(   ) функция_912; 

		//проц function(   ) функция_913; 

		//проц function(   ) функция_914; 

		//проц function(   ) функция_915; 

		//проц function(   ) функция_916; 

		//проц function(   ) функция_917; 

		//проц function(   ) функция_918; 

		//проц function(   ) функция_919; 

		//проц function(   ) функция_920; 

		//проц function(   ) функция_921; 

		//проц function(   ) функция_922; 

		//проц function(   ) функция_923; 

		//проц function(   ) функция_924; 

		//проц function(   ) функция_925; 

		//проц function(   ) функция_926; 

		//проц function(   ) функция_927; 

		//проц function(   ) функция_928; 

		//проц function(   ) функция_929; 

		//проц function(   ) функция_930; 

		//проц function(   ) функция_931; 

		//проц function(   ) функция_932; 

		//проц function(   ) функция_933; 

		//проц function(   ) функция_934; 

		//проц function(   ) функция_935; 

		//проц function(   ) функция_936; 

		//проц function(   ) функция_937; 

		//проц function(   ) функция_938; 

		//проц function(   ) функция_939; 

		//проц function(   ) функция_940; 

		//проц function(   ) функция_941; 

		//проц function(   ) функция_942; 

		//проц function(   ) функция_943; 

		//проц function(   ) функция_944; 

		//проц function(   ) функция_945; 

		//проц function(   ) функция_946; 

		//проц function(   ) функция_947; 

		//проц function(   ) функция_948; 

		//проц function(   ) функция_949; 

		//проц function(   ) функция_950; 

		//проц function(   ) функция_951; 

		//проц function(   ) функция_952; 

		//проц function(   ) функция_953; 

		//проц function(   ) функция_954; 

		//проц function(   ) функция_955; 

		//проц function(   ) функция_956; 

		//проц function(   ) функция_957; 

		//проц function(   ) функция_958; 

		//проц function(   ) функция_959; 

		//проц function(   ) функция_960; 

		//проц function(   ) функция_961; 

		//проц function(   ) функция_962; 

		//проц function(   ) функция_963; 

		//проц function(   ) функция_964; 

		//проц function(   ) функция_965; 

		//проц function(   ) функция_966; 

		//проц function(   ) функция_967; 

		//проц function(   ) функция_968; 

		//проц function(   ) функция_969; 

		//проц function(   ) функция_970; 

		//проц function(   ) функция_971; 

		//проц function(   ) функция_972; 

		//проц function(   ) функция_973; 

		//проц function(   ) функция_974; 

		//проц function(   ) функция_975; 

		//проц function(   ) функция_976; 

		//проц function(   ) функция_977; 

		//проц function(   ) функция_978; 

		//проц function(   ) функция_979; 

		//проц function(   ) функция_980; 

		//проц function(   ) функция_981; 

		//проц function(   ) функция_982; 

		//проц function(   ) функция_983; 

		//проц function(   ) функция_984; 

		//проц function(   ) функция_985; 

		//проц function(   ) функция_986; 

		//проц function(   ) функция_987; 

		//проц function(   ) функция_988; 

		//проц function(   ) функция_989; 

		//проц function(   ) функция_990; 

		//проц function(   ) функция_991; 

		//проц function(   ) функция_992; 

		//проц function(   ) функция_993; 

		//проц function(   ) функция_994; 

		//проц function(   ) функция_995; 

		//проц function(   ) функция_996; 

		//проц function(   ) функция_997; 

		//проц function(   ) функция_998; 

		//проц function(   ) функция_999; 

		//проц function(   ) функция_1000; 

		//проц function(   ) функция_1001; 

		//проц function(   ) функция_1002; 

		//проц function(   ) функция_1003; 

		//проц function(   ) функция_1004; 

		//проц function(   ) функция_1005; 

		//проц function(   ) функция_1006; 

		//проц function(   ) функция_1007; 

		//проц function(   ) функция_1008; 

	}

