module std.ctype;

import std.x.ctype;


 const dchar[66] РУСАЛФ =['а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П','Р','С','Т','У','Ф','Х','Ц','Ч','Ш','Щ','Ъ','Ы','Ь','Э','Ю','Я'];

 const ubyte[66] РУСАЛФб =cast(ubyte[])['а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я','А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П','Р','С','Т','У','Ф','Х','Ц','Ч','Ш','Щ','Ъ','Ы','Ь','Э','Ю','Я'];

 юткст[33] РУСн = [\U00000430,\U00000431,\U00000432,\U00000233,\U00000434,\U00000435,\U00000451,\U00000436,\U00000437,\U00000438,\U00000439,\U0000043a,\U0000043b,\U0000043c,\U0000043d,\U0000043e,\U0000043f,\U00000440,\U00000441,\U00000442,\U00000443,\U00000444,\U00000445,\U00000446,\U00000447,\U00000448,\U00000449,\U0000044a,\U0000044b,\U0000044c,\U0000044d,\U0000044e,\U0000044f];

 юткст[33] РУСв = [\U00000410,\U00000411,\U00000412,\U00000413,\U00000414,\U00000415,\U00000401,\U00000416,\U00000417,\U00000418,\U00000419,\U0000041a,\U0000041b,\U0000041c,\U0000041d,\U0000041e,\U0000041f,\U00000420,\U00000421,\U00000422,\U00000423,\U00000424,\U00000425,\U00000426,\U00000427,\U00000428,\U00000429,\U0000042a,\U0000042b,\U0000042c,\U0000042d,\U0000042e,\U0000042f];


export extern(D):

	цел числобукв_ли(дим б){return std.x.ctype.isalnum(б);}
	цел буква_ли(дим б){return  std.x.ctype.isalpha(б);}
	цел управ_ли(дим б){return std.x.ctype.iscntrl(б);}
	цел цифра_ли(дим б){return std.x.ctype.isdigit(б);}
	цел проп_ли(дим б){return std.x.ctype.islower(б);}
	цел пунктзнак_ли(дим б){return  std.x.ctype.ispunct(б);}
	цел межбукв_ли(дим б){return std.x.ctype.isspace(б);}
	цел заг_ли(дим б){return std.x.ctype.isupper(б);}
	цел цифраикс_ли(дим б){return std.x.ctype.isxdigit(б);}
	цел граф_ли(дим б){return  std.x.ctype.isgraph(б);}
	цел печат_ли(дим б) {return  std.x.ctype.isprint(б);}
	цел аски_ли(дим б){return  std.x.ctype.isascii(б);}
	дим впроп(дим б){return  std.x.ctype.tolower(б);}
	дим взаг(дим б){return std.x.ctype.toupper(б);}


 бул рус_ли(дим б)
 {
  юткст м_б =[б];
  switch(м_б)
 {
 case "а","б","в","г","д","е","ё","ж","з","и","й","к","л","м","н","о","п","р","с","т","у","ф","х","ц","ч","ш","щ","ъ","ы","ь","э","ю","я","А","Б","В","Г","Д","Е","Ё","Ж","З","И","Й","К","Л","М","Н","О","П","Р","С","Т","У","Ф","Х","Ц","Ч","Ш","Щ","Ъ","Ы","Ь","Э","Ю","Я": return true;
 default:
 }
  return false;
 }

 цел проверьРус(дим б)
 {
	 юткст м_б =[б];
	 switch(м_б)
	 {
	 case "а","б","в","г","д","е","ё","ж","з","и","й","к","л","м","н","о","п","р","с","т","у","ф","х","ц","ч","ш","щ","ъ","ы","ь","э","ю","я":
	 return _БНР;
	 case "А","Б","В","Г","Д","Е","Ё","Ж","З","И","Й","К","Л","М","Н","О","П","Р","С","Т","У","Ф","Х","Ц","Ч","Ш","Щ","Ъ","Ы","Ь","Э","Ю","Я":
	 return _БВР;
	 default:
	}
  return 0;
}

цел руспроп_ли(дим б)  { return (б <= 'я' &&  б >='а' || б == 'ё'); }
цел русзаг_ли(дим б)  { return (б <=  'Я' && б >= 'А' || б == 'Ё') ; }

unittest
{

ткст а = "а";
//шим Ан = РУСАЛФ[1];
	assert(а == \u0430);
	//assert(Ан == \U00000430);
	assert(числобукв_ли('а'));
	assert(числобукв_ли('б'));
	assert(числобукв_ли('в'));
	assert(числобукв_ли('г'));
	assert(числобукв_ли('д'));
	assert(числобукв_ли('е'));
	assert(числобукв_ли('D'));
	assert(числобукв_ли('ё'));
	assert(числобукв_ли('ж'));
	assert(числобукв_ли('з'));
	assert(числобукв_ли('и'));
	assert(числобукв_ли('й'));
	assert(числобукв_ли('к'));
	assert(числобукв_ли('л'));
	assert(числобукв_ли('м'));
	assert(числобукв_ли('н'));
	assert(числобукв_ли('о'));
	assert(числобукв_ли('п'));
	assert(числобукв_ли('р'));
	assert(числобукв_ли('с'));
	assert(числобукв_ли('т'));
	assert(числобукв_ли('у'));
	assert(числобукв_ли('ф'));
	assert(числобукв_ли('х'));
	assert(числобукв_ли('ц'));
	assert(числобукв_ли('ч'));
	assert(числобукв_ли('ш'));
	assert(числобукв_ли('щ'));
	assert(числобукв_ли('ъ'));
	assert(числобукв_ли('ы'));
	assert(числобукв_ли('ь'));
	assert(числобукв_ли('э'));
	assert(числобукв_ли('ю'));
	assert(числобукв_ли('я'));
	assert(числобукв_ли('А'));
	assert(числобукв_ли('Б'));
	assert(числобукв_ли('В'));
	assert(числобукв_ли('Г'));
	assert(числобукв_ли('Д'));
	assert(числобукв_ли('Е'));
	assert(числобукв_ли('Ё'));
	assert(числобукв_ли('Ж'));
	assert(числобукв_ли('З'));
	assert(числобукв_ли('И'));
	assert(числобукв_ли('Й'));
	assert(числобукв_ли('К'));
	assert(числобукв_ли('Л'));
	assert(числобукв_ли('М'));
	assert(числобукв_ли('Н'));
	assert(числобукв_ли('О'));
	assert(числобукв_ли('П'));
	assert(числобукв_ли('Р'));
	assert(числобукв_ли('С'));
	assert(числобукв_ли('Т'));
	assert(числобукв_ли('У'));
	assert(числобукв_ли('Ф'));
	assert(числобукв_ли('Х'));
	assert(числобукв_ли('Ц'));
	assert(числобукв_ли('Ч'));
	assert(числобукв_ли('Ш'));
	assert(числобукв_ли('Щ'));
	assert(числобукв_ли('Ъ'));
	assert(числобукв_ли('Ы'));
	assert(числобукв_ли('Ь'));
	assert(числобукв_ли('Э'));
	assert(числобукв_ли('Ю'));
	assert(буква_ли('Я'));
	assert(!управ_ли('Я'));
	assert(!управ_ли('ё'));
    assert(межбукв_ли(' '));
    assert(!межбукв_ли('z'));
	assert(!межбукв_ли('Ъ'));
    assert(взаг('a') == 'A');
	assert(взаг('м') == 'М');
    assert(впроп('Q') == 'q');
	assert(впроп('Ю') == 'ю');
    assert(!цифраикс_ли('G'));
	assert(руспроп_ли('ф'));
	assert(!цифраикс_ли('Ш'));
    assert(!руспроп_ли('z'));
	assert (русзаг_ли('П'));
	assert (русзаг_ли('Ё'));
	assert(!русзаг_ли('п'));
	assert (заг_ли('Ё'));
	эхо("!!!!!!!!!!");
}
