
import stdrus, io.Stdout;
/+
int main()
{

_скажинс("Проверим двых и дош (аналоги stdout и stderr)");
двых.пишиСтр(фм("<<<<<<<<<<Seems, we cannot get good Russian here, when testing \"двых\""));
дош.пишиСтр("<<<<<dosh..................................>>>>>");
_скажинс("Как видим, в консоли они теряют свою \"русскость\">>>>>>>
			");
	//Квывод ("hello world и по-русски").нс;
	return 0;
}
+/
проц main() 
        {
        Стдвыв ("hello").нс;               
        Стдвыв (1).нс;                     
        Стдвыв (3.14).нс;                  
        Стдвыв ('b').нс;                   
        Стдвыв ("abc") ("def") (3.14).нс;  
        Стдвыв ("abc", 1, 2, 3).нс;        
        Стдвыв (1, 2, 3).нс;        
        Стдвыв (1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1).нс;

        Стдвыв ("abc {}{}{}", 1, 2, 3).нс; 
        Стдвыв.форматируй ("abc {}{}{}", 1, 2, 3).нс;
        }