module mesht;
import stdrus, linalg.Vector, mesh.Handles, mesh.Status, mesh.Utils;
/+
проц вектТест()
{
	alias Вектор!(плав,3) Век3п;
    alias Вектор!(плав,2) Век2п;
    alias Вектор!(цел,2) Век2ц;
    alias Вектор!(цел,3) Век3ц;
    alias Вектор!(ббайт,10) Век10бб;

    alias скажифнс writefln;

    Век3п a;
    Век3п b =  [8,9,10];
    дво[] dyn = [7.0,6.0,3.0];
    Вектор!(дво,3) af = dyn;
    Вектор!(цел,3) ai;
    ai = [1,2,3];
    a = [1,2,3];
    
    writefln("A=", a);
    writefln("Alen=", a.нормаль);
    writefln("ai=", ai);
    writefln("B=", b);

    a = af;
}+/
проц main() {

//вектТест();

    УкзНаВектор x = 10;
    auto y = УкзНаВектор(15);
    assert(фм(x.инд()) == "10");
    assert(фм(y.инд()) == "15");
    assert(x<y);
    assert(y>x);
    y.__инкремент();
    x.__декремент();
    assert(фм(x.инд()) == "9");
    assert(фм(y.инд()) == "16");

    УкзНаВектор z = x;
    assert(фм(z.инд()) == "9");
	
	ИнфОСтатусе i;
    i.установи_бит(БитыСтатуса.УДАЛЁН);
    assert(i.установлен_ли_бит(БитыСтатуса.УДАЛЁН));
    assert(i.удалён_ли());
	
	скажинс("Пора натыкаться на неприятное!");
	    Век3п v = [.1f,.2,.3];
        Век3бб c = [0u,128,255];


        скажифнс("      v=%s       c=%s\n"
                 "cast(v)=%s cast(c)=%s", v,c, цветоКаст!(Век3бб)(v), цветоКаст!(Век3п)(c));
        скажифнс("      v=[%s,%s,%s]", v[0],v[1],v[2]);
	
    скажинс("Всё отлично");
}