import dinrus;

цел члоПарБотинок = 50;
цел съэкономленоКожи = 1250;
цел рабДней = 25;
цел парНаДень = 1500;

плав а = 3.6;
плав б, в;

цел съэкономлено()
{
цел экономияНаПару = съэкономленоКожи/члоПарБотинок;
скажифнс("Экономия на пару ботинок составила %s кв.см. кожи", экономияНаПару);
скажифнс("За %s дней было съэкономлено %s кв.см. кожи", рабДней, рабДней*(парНаДень*экономияНаПару));

б = а*2;
в = (а+б)-4.3;
скажифнс("Периметр треугольника = %s", а+б+в);
return 0;
}

проц main()
{
съэкономлено();
}